
Функция ПолучитьТекстЗапросаДляПроверки() Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	&ПрофильРазноски КАК ПрофильРазноски,
	               |	&НаправлениеДоговора КАК НаправлениеДоговора,
	               |	&Контрагент КАК Контрагент,
	               |	&Договор КАК Договор";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьЗначениеКонстанты(Идентификатор, ЗначениеПоУмолчанию =  Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗначенияКонстант.Значение,
	|	ЗначенияКонстант.ЗначениеВХранилище,
	|	ВЫБОР
	|		КОГДА ЗначенияКонстант.ЗначениеВХранилище
	|			ТОГДА ЗначенияКонстант.ХранилищеЗначения
	|	КОНЕЦ КАК ХранилищеЗначения
	|ИЗ
	|	РегистрСведений.СБ_НастройкиКазначейства КАК ЗначенияКонстант
	|ГДЕ
	|	ЗначенияКонстант.Идентификатор = &Идентификатор";
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ЗначениеПоУмолчанию;
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат ?(Выборка.ЗначениеВХранилище,  Выборка.ХранилищеЗначения.Получить(), Выборка.Значение);
		
	КонецЕсли; 
	
КонецФункции