
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	пНастройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
	УстановитьНастройкиПоУмолчанию(пНастройки);
	Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(пНастройки);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПараметры(Команда)
	
	Элементы.КомпоновщикНастроекПараметры.Видимость = НЕ Элементы.КомпоновщикНастроекПараметры.Видимость;
	Элементы.ФормаОткрытьПараметры.Пометка = Элементы.КомпоновщикНастроекПараметры.Видимость;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьНастройкиПоУмолчанию(Настройки)
	
	ОсновнойСчет 					= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОсновнойСчет"));
	СписокСчетов 					= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокСчетов"));
	ГруппаНеТранслироватьРБП 		= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГруппаНеТранслироватьРБП"));
	ИмяНастройкиНеТранслироватьРБП 	= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИмяНастройкиНеТранслироватьРБП"));
	Аналитика 						= Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аналитика"));
	
	Если ОсновнойСчет <> Неопределено 
		И НЕ ЗначениеЗаполнено(ОсновнойСчет.Значение) Тогда
		
		пЗначение = ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов; //97
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОсновнойСчет"), пЗначение); 
		
	КонецЕсли;
	
	Если СписокСчетов <> Неопределено 
		И НЕ ЗначениеЗаполнено(СписокСчетов.Значение) Тогда
		
		пЗначение = Новый СписокЗначений;
		пЗначение.Добавить(ПланыСчетов.Хозрасчетный.РасходыБудущихПериодов); //97
		пЗначение.Добавить(ПланыСчетов.Хозрасчетный.НДСпоПриобретеннымЦенностям); //19
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокСчетов"), пЗначение); 
		
	КонецЕсли;
	
	Если ГруппаНеТранслироватьРБП <> Неопределено 
		И НЕ ЗначениеЗаполнено(ГруппаНеТранслироватьРБП.Значение) Тогда
		
		пЗначение = "Служебные элементы Не сопоставлено";
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ГруппаНеТранслироватьРБП"), пЗначение); 
		
	КонецЕсли;
	
	Если ИмяНастройкиНеТранслироватьРБП <> Неопределено 
		И НЕ ЗначениеЗаполнено(ИмяНастройкиНеТранслироватьРБП.Значение) Тогда
		
		пЗначение = "Расходы будущих периодов";
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ИмяНастройкиНеТранслироватьРБП"), пЗначение); 
		
	КонецЕсли;
	
	Если Аналитика <> Неопределено 
		И НЕ ЗначениеЗаполнено(Аналитика.Значение) Тогда
		
		пЗначение = ПланыВидовХарактеристик.бит_ВидыДополнительныхАналитик.НайтиПоКоду("NЗаявки");
		
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Аналитика"), пЗначение); 
		
	КонецЕсли;
	
КонецПроцедуры