&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	МетаданныеОбъекта = Метаданные.Документы.бит_му_МодернизацияОС;
	// вызов механизма защиты
	бит_ЛицензированиеБФCервер.ПроверитьВозможностьРаботы(ЭтаФорма,МетаданныеОбъекта.ПолноеИмя(),Отказ);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// вызов механизма справочной информации
	ИжТиСи_СВД_Сервер.ОК_ВывестиРеквизиты(ЭтаФорма, "Документ.бит_му_КомплектацияОС.ФормаСписка");
	
	// Проверка однофирменности
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	ИспользоватьОтбор = ЗначениеЗаполнено(ОсновнаяОрганизация);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
									Список.Отбор,
									"Организация",
									ОсновнаяОрганизация,
									ВидСравненияКомпоновкиДанных.Равно,
									,
									ИспользоватьОтбор);
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура - обработчик события ""Нажатие"" кнопки ""ОткрытьСИ"" коммандной панели ""ДействияФормы"". 
// Открывает справку по данной форме.
//
&НаКлиенте
Процедура бит_си_ДействияФормыОткрытьСИ(Команда)
	Форма = ПолучитьФорму("Обработка.бит_си_СправочнаяИнформация.Форма.ФормаУправляемая", Новый Структура("ПараметрОткрытия", "Документ.бит_му_КомплектацияОС.ФормаСписка"), ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры

// Процедура - обработчик события "Нажатие" кнопки "ДИ:ПрикрепленныеФайлы" коммандной панели "ДействияФормы". 
// Открывает обработку "Прикрепленные файлы".
//
&НаКлиенте
Процедура бит_ДействияФормыПрикрепленныеФайлы(Команда)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено тогда
		Возврат
	КонецЕсли;
	
	//бит_РаботаСДиалогами.ОткрытьОбработкуПрикрепленияФайлов(Ложь, ТекущиеДанные.Ссылка, ЭтаФорма);
	Форма = ПолучитьФорму("Обработка.бит_ПрикреплениеФайлов.Форма.ФормаУправляемая", Новый Структура("ПараметрОткрытия", "Документ.бит_му_КомплектацияОС.ФормаСписка"), ЭтаФорма, ТекущиеДанные.Ссылка);
	Форма.Объект.Объект = ТекущиеДанные.Ссылка;
	Форма.Открыть();
	
КонецПроцедуры

