#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Обрабатывает изменение вида связи визы.
// 
Процедура ИзменениеВидаСвязи() Экспорт

	Если ВидСвязи = Перечисления.бит_ВидыСвязиВиз.ЦФО Тогда
		
		Описание    = Новый ОписаниеТипов(бит_ОбщегоНазначения.ПолучитьИмяТипаЦФО());
		ОбъектСвязи = Описание.ПривестиЗначение(ОбъектСвязи);		
		
	ИначеЕсли ВидСвязи = Перечисления.бит_ВидыСвязиВиз.ФизическоеЛицо Тогда
		
		Описание    = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		ОбъектСвязи = Описание.ПривестиЗначение(ОбъектСвязи);
		
	//Начало_бит_БК_Магомедов_13.02.2012 
	ИначеЕсли ВидСвязи = Перечисления.бит_ВидыСвязиВиз.бит_БК_Инициатор Тогда
		
		Описание    = Новый ОписаниеТипов("СправочникСсылка.бит_БК_Инициаторы");
		ОбъектСвязи = Описание.ПривестиЗначение(ОбъектСвязи);
	//Конец_бит_БК_Магомедов_13.02.2012
	
	Иначе
		
		Описание    = Новый ОписаниеТипов("СправочникСсылка.ФизическиеЛица");
		ОбъектСвязи = Описание.ПривестиЗначение(ОбъектСвязи);
		
	КонецЕсли; 

КонецПроцедуры // ИзменениеВидаСвязи()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ПередЗаписью" объекта справочника.
// 
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		
		Вид         = Перечисления.бит_ВидыВиз.Утверждающая;
		ВидСвязи    = Перечисления.бит_ВидыСвязиВиз.ФизическоеЛицо;
		РежимПечати = Перечисления.бит_РежимПечатиВиз.Виза;
		
		ИзменениеВидаСвязи();
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияНачалоСобытия(Отказ, ЭтотОбъект.ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияПриЗаписи(Отказ, ЭтотОбъект.ДополнительныеСвойства, Метаданные().ПолноеИмя());
		
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
