#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазрешитьРедактирование(Команда)
	
	ИзменитьРежимРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьРежимРедактирования()

	Элементы.Список.ТолькоПросмотр       = НЕ Элементы.Список.ТолькоПросмотр;

	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ИзменитьРежимРедактирования()

&НаСервере
Процедура УправлениеЭлементамиФормы()

	ТекстЗаголовка = ?(НЕ Элементы.Список.ТолькоПросмотр,НСтр("ru = 'Закончить редактирование'"),НСтр("ru = 'Разрешить редактирование'"));
	
	Элементы.КомандаРазрешитьРедактирование.Заголовок = ТекстЗаголовка;

	ТекстЗаголовка = НСтр("ru = 'Данные произвольных отчетов рекомендуется редактировать в элементах справочника ""Экземпляры произвольных отчетов"".'");
	
	Элементы.ДекорацияРазрешитьРедактирование.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры

#КонецОбласти

