#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 
	
	Для каждого Запись Из ЭтотОбъект Цикл
	
		 Если НЕ ЗначениеЗаполнено(Запись.Виза) Тогда
		 
			 бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнена виза!", Отказ, , СтатусСообщения.Важное);
			 
		 КонецЕсли; 
		 
		 Если НЕ ЗначениеЗаполнено(Запись.ОбъектВизирования) Тогда
		 
			 бит_ОбщегоНазначения.СообщитьОбОшибке("Не заполнен объект визирования!", Отказ, , СтатусСообщения.Важное);
		 
		 КонецЕсли; 
		 
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
