
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаРазрешитьРедактирование(Команда)
	
	ИзменитьРежимРедактирования();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИзменитьРежимРедактирования()

	Элементы.Список.ТолькоПросмотр       = НЕ Элементы.Список.ТолькоПросмотр;

	УправлениеЭлементамиФормы();
	
КонецПроцедуры // ИзменитьРежимРедактирования()

&НаСервере
Процедура УправлениеЭлементамиФормы()

	ТекстЗаголовка = ?(НЕ Элементы.Список.ТолькоПросмотр,
						НСтр("ru = 'Закончить редактирование'"),
						НСтр("ru = 'Разрешить редактирование'"));
	
	Элементы.КомандаРазрешитьРедактирование.Заголовок = ТекстЗаголовка;

	ТекстЗаголовка = НСтр("ru = 'Показатели произвольных отчетов рекомендуется редактировать в элементах справочника ""Настройки произвольных отчетов"".'");
	
	Элементы.ДекорацияРазрешитьРедактирование.Заголовок = ТекстЗаголовка;
	
КонецПроцедуры // УправлениеЭлементамиФормы()

#КонецОбласти

