#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем СохраненнаяНастройка Экспорт; // Текущий вариант отчета


Перем ИмяРегистраБухгалтерии Экспорт; // Хранит имя регистра бухгалтерии.

Перем мСписокРегистров Экспорт; // Хранит список регистров бухгалтерии управленческого учета.

Перем мПрограммноеОткрытие Экспорт; // Хранит значение программного открытия отчета.

Перем мЕстьРесурсСуммаМУ Экспорт; // Хранит подтверждение наличия ресурса "СуммаМУ".

Перем ЕстьВалюта Экспорт; // Хранить признак наличия валюты.

Перем ЕстьКоличество Экспорт; // Хранить признак наличия количества.

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область Настройки

// Процедура выполняет сохранение настроек отчета.
// 
Процедура СохранитьНастройку() Экспорт

    ИсключаемыеРеквизиты = Новый Структура;
    ИсключаемыеРеквизиты.Вставить("ПостроительОтчета");
    
    // Сформируем структуру настроек для сохранения.
    СтруктураНастроек = бит_БухгалтерскиеОтчетыСервер.ПолучитьСтруктуруПараметровДляСохранения(ЭтотОбъект, ИсключаемыеРеквизиты);
	бит_БухгалтерскиеОтчетыСервер.СохранитьНастройкуОбъекта(СохраненнаяНастройка, СтруктураНастроек);
    
КонецПроцедуры // СохранитьНастройку()

// Процедура заполняет параметры отчета по элементу справочника из переменной СохраненнаяНастройка.
// 
Процедура ПрименитьНастройку() Экспорт
    
    // Применим настройки отчета.
    бит_БухгалтерскиеОтчетыСервер.ПрименитьСохраненнуюНастройку(ЭтотОбъект, Истина);
	
КонецПроцедуры // ПрименитьНастройку()

// Процедура заполняет начальные настройки отчета.
// 
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ИмяРегистраБухгалтерии = РегистрБухгалтерии.ИмяОбъекта;
	
	МассивТекущихПоказателей = СформироватьМассивПоказателей();
	
	МассивСубконто = Новый Массив;
	
	Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиИОбороты.Счет КАК Счет,
	|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Счет) КАК СчетПредставление";
	
	Если ПоВалютам Тогда
		Текст = Текст +	",
		|	ОстаткиИОбороты.Валюта КАК Валюта,
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Валюта) КАК ВалютаПредставление";
	КонецЕсли;
	
	Текст = Текст + бит_БухгалтерскиеОтчетыСервер.ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(МассивТекущихПоказателей, Истина, 
							Истина, Истина, РазвернутоеСальдо);

			
	ТекстПоля    = "";
	ТекстОтбор   = "Валюта.*";
	ТекстИтоги   = "  Организация.*";
	ТекстПорядок = "";
	
	Сч = 0;
	Для Каждого ВидСубконто Из Счет.ВидыСубконто Цикл
		
		Сч = Сч + 1;
		
		ТекстПоля = ТекстПоля + ", " + " ОстаткиИОбороты.Субконто" + Сч + " КАК Субконто" + Сч;
		ТекстПоля = ТекстПоля + ", " + " ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Субконто" + Сч + ") КАК Субконто" + Сч + "Представление";
	
		ТекстОтбор   = ТекстОтбор   + ", Субконто" + Сч + ".*";
		ТекстИтоги   = ТекстИтоги   + ", Субконто" + Сч + ".*";
		ТекстПорядок = ТекстПорядок + ", Субконто" + Сч + ".*";
		
		МассивСубконто.Добавить(ВидСубконто.ВидСубконто);
		
	КонецЦикла;
	
	// BIT Amerkulov 26062014 ++
	Если ПоВалютам Тогда
		ТекстПоля = ТекстПоля + ", Валюта.* " ;
		ТекстОтбор = ТекстОтбор + ", Валюта " ;		
		ТекстИтоги = ТекстИтоги + ", Валюта " ;
	КонецЕсли;	
	// BIT --
	
	Если Не ПустаяСтрока(ТекстПоля) Тогда 		
		Текст = Текст + "
		|{ВЫБРАТЬ
		|" + Сред(ТекстПоля, 2) + "}"; 		
	КонецЕсли;
    
	Если НЕ ПустаяСтрока(ТекстОтбор) Тогда 		
		ТекстОтбор = "{" + ТекстОтбор + "}";  		
	КонецЕсли;
	
	СтрокаОграниченийПоРеквизитам = "";
	бит_БухгалтерскиеОтчетыСервер.ДополнитьСтрокуОграниченийПоРеквизитам(СтрокаОграниченийПоРеквизитам, "Организация", Организация);
	
	Текст = Текст + " 
	|
	|ИЗ
	|	РегистрБухгалтерии." + ИмяРегистраБухгалтерии + ".ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В ИЕРАРХИИ (&Счет), 
	|, " + СтрокаОграниченийПоРеквизитам + ТекстОтбор + ") КАК ОстаткиИОбороты
    |
	|УПОРЯДОЧИТЬ ПО Счет.Порядок ";
	
	Если Не ПустаяСтрока(ТекстПорядок) Тогда
		
		Текст = Текст + "
		|{УПОРЯДОЧИТЬ ПО
		|" + Сред(ТекстПорядок, 2) + "}";
		
	КонецЕсли;
    
	СтрокаИтогов = бит_БухгалтерскиеОтчетыСервер.ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(МассивТекущихПоказателей, Ложь, , , РазвернутоеСальдо);
	
	Текст = Текст + "
	|ИТОГИ " + Сред(СтрокаИтогов, 2); 
	
	Текст = Текст +	"
	|	ПО ОБЩИЕ";
	
	Если ПоСубсчетам Тогда
		
		Текст = Текст +	",
		|	Счет ИЕРАРХИЯ КАК Счет ";
		
	КонецЕсли;
	
	Если ПоВалютам Тогда
		
		Текст = Текст +	",
		|	Валюта ";
		
	КонецЕсли;
	
	Если Не ПустаяСтрока(ТекстИтоги) Тогда
		Текст = Текст +	"
		|{ИТОГИ ПО
		|" + Сред(ТекстИтоги, 2) + "}";
	КонецЕсли;
	
	ПостроительОтчета.Параметры.Вставить("Счет", Счет);
		
	ПостроительОтчета.Текст = Текст;
	
	Сч = 0;
	Для каждого Элемент Из  МассивСубконто Цикл
		Сч = Сч + 1;
		Поле = ПостроительОтчета.ДоступныеПоля.Найти("Субконто"+Сч);
		Поле.ТипЗначения   = Элемент.ТипЗначения;
		Поле.Представление = Элемент.Наименование;
	КонецЦикла;
		
	// Определим признаки учета субконто, которые могут быть использованы.
    СтруктураУчета = бит_БухгалтерскиеОтчетыСервер.ОпределитьПризнакиУчетаСубконтоРегистраБухгалтерии(ИмяРегистраБухгалтерии, МассивСубконто);
	ЕстьВалюта     = СтруктураУчета.ЕстьВалюта;
    ЕстьКоличество = СтруктураУчета.ЕстьКоличество;
	
КонецПроцедуры // ЗаполнитьНачальныеНастройки()

// Перезаполнение настроек построителя отчетов с сохранением пользовательских настроек.
// 
Процедура ПерезаполнитьНачальныеНастройки() Экспорт
	
	Настройки = ПостроительОтчета.ПолучитьНастройки();
	
	ЗаполнитьНачальныеНастройки();
	
	ПостроительОтчета.УстановитьНастройки(Настройки);
    
КонецПроцедуры // ПерезаполнитьНачальныеНастройки()

#КонецОбласти

#Область ЗаголовокОтчета

// Функция формирует заголовок отчета (синоним).
// 
// Возвращаемое значение:
//  Строка - заголовок отчета.
// 
Функция ЗаголовокОтчета() Экспорт
	
	ПредставлениеРегистра = бит_ПраваДоступа.ПолучитьПредставлениеОбъектаСистемыИзСпискаЗначений(мСписокРегистров, РегистрБухгалтерии);
	СтрокаПоСчету = ?(ЗначениеЗаполнено(Счет), Счет, Нстр("ru = ' не выбран счет'"));
	
	ТекстЗаголовка = Нстр("ru = 'Оборотно-сальдовая ведомость по счету %2% (%1%)'");
	ТекстЗаголовка = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстЗаголовка, ПредставлениеРегистра, СтрокаПоСчету);
	
	Возврат ТекстЗаголовка;	
    
КонецФункции // ЗаголовокОтчета()

// Функция формирует табличный документа отчета и выполняет заполнение области "Заголовок".
// 
// Возвращаемое значение:
//  ТабличныйДокумент - заголовок отчета.
// 
Функция СформироватьЗаголовок() Экспорт

	ОписаниеПериода = бит_БухгалтерскиеОтчетыСервер.СформироватьСтрокуВыводаПараметровПоДатам(Период.ДатаНачала, Период.ДатаОкончания);
	
	Макет = ПолучитьМакет("Макет");
	Итоги = Макет.ПолучитьОбласть("Итоги");
    
	ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");

	НазваниеОрганизации = бит_БухгалтерскиеОтчетыСервер.ПолучитьПолноеНазваниеОрганизации(Организация);
		
	ЗаголовокОтчета.Параметры.НазваниеОрганизации = НазваниеОрганизации;
	ЗаголовокОтчета.Параметры.Заголовок 		  = ЗаголовокОтчета();
	ЗаголовокОтчета.Параметры.ОписаниеПериода  	  = ОписаниеПериода;

	ТекстСписокПоказателей = Нстр("ru = 'Выводимые данные: '");
    
    Если ВыводитьСуммуРегл Тогда 
        ТекстСписокПоказателей = ТекстСписокПоказателей + Нстр("ru = 'сумма (регл.)'");
    КонецЕсли;
    Если ВыводитьСуммуУпр Тогда 
        ТекстСписокПоказателей = ТекстСписокПоказателей + ?(Найти(ТекстСписокПоказателей, "сумма") = 0, "", ", ") + Нстр("ru = 'сумма (упр.)'");
	КонецЕсли;
	Если мЕстьРесурсСуммаМУ И ВыводитьСуммуМУ Тогда 
        ТекстСписокПоказателей = ТекстСписокПоказателей + ?(Найти(ТекстСписокПоказателей, "сумма") = 0, "", ", ") + Нстр("ru = 'сумма (МСФО)'");
	КонецЕсли;
	Если ПоВалютам Тогда
		ТекстСписокПоказателей = ТекстСписокПоказателей + ?(Найти(ТекстСписокПоказателей, "сумма") = 0, "", ", ") + Нстр("ru = 'валютная сумма'");
	КонецЕсли; 
	Если ПоКоличеству Тогда
		ТекстСписокПоказателей = ТекстСписокПоказателей + ?(Найти(ТекстСписокПоказателей, "сумма") = 0, "", ", ") + Нстр("ru = 'количество'");
	КонецЕсли; 
	
	ТекстПроИтоги = "";
	Если ПоСубсчетам Тогда
		ТекстПроИтоги = ТекстПроИтоги + "субсчетам, "
	КонецЕсли;

	Если ПостроительОтчета.ИзмеренияСтроки.Количество() > 0 Тогда
		ТекстПроИтоги = ТекстПроИтоги + "субконто: " + бит_БухгалтерскиеОтчетыСервер.СформироватьСтрокуИзмерений(ПостроительОтчета.ИзмеренияСтроки);
	КонецЕсли;

	ЗаголовокОтчета.Параметры.ТекстПроСписокПоказателей = ТекстСписокПоказателей;
	Если Не ПустаяСтрока(ТекстПроИтоги) Тогда
		ЗаголовокОтчета.Параметры.ТекстПроИтоги = Нстр("ru = 'Детализация по '") + ТекстПроИтоги;
	КонецЕсли;

	// Вывод списка фильтров:
	СтрОтбор = бит_БухгалтерскиеОтчетыСервер.СформироватьСтрокуОтборов(ПостроительОтчета.Отбор);

	Если Не ПустаяСтрока(СтрОтбор) Тогда
		ОбластьОтбор = Макет.ПолучитьОбласть("СтрокаОтбор");
		ОбластьОтбор.Параметры.ТекстПроОтбор = Нстр("ru = 'Отбор: '") + СтрОтбор;
		ЗаголовокОтчета.Вывести(ОбластьОтбор);
	КонецЕсли;

	Возврат(ЗаголовокОтчета);

КонецФункции // СформироватьЗаголовок()

#КонецОбласти

#Область ФормированиеОтчета

// Процедура выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
// 
// Параметры:
//  ДокументРезультат   - ТабличныйДокумент - Табличный документ, формируемый отчетом.
//  ПоказыватьЗаголовок - Булево (По умолчанию = Истина) - признак отображения заголовка.
//  ВысотаЗаголовка     - Число (По умолчанию = 0) - высота заголовка.
// 
// Возвращаемое значение:
//  Булево - отчет сформирован.
// 
Функция СформироватьОтчет(ДокументРезультат,  ПоказыватьЗаголовок = Истина, ВысотаЗаголовка = 0) Экспорт

	// Очистка табличного поля
	ДокументРезультат.Очистить();
	
	// Проверим наличие ресурса с именем "СуммаМУ".
	мЕстьРесурсСуммаМУ = бит_ОбщегоНазначения.ЕстьРесурсСуммаМУРегистраБухгалтерии(ИмяРегистраБухгалтерии);
	   	
	Если Не ПараметрыОтчетаКорректны() Тогда
		
		ОтчетСформирован = Ложь;
		
	Иначе
		
		ОтчетСформирован = Истина;

		Макет           = ПолучитьМакет("Макет");
		ЗаголовокОтчета = Макет.ПолучитьОбласть("Заголовок");

		// Наклонный шрифт групп
		ШрифтГрупп = Новый Шрифт(Макет.Область("СтрокаПоказателя|Счет").Шрифт, , , , Истина);

		бит_БухгалтерскиеОтчетыСервер.СформироватьИВывестиЗаголовокОтчета(ЭтотОбъект, ДокументРезультат, ВысотаЗаголовка, ПоказыватьЗаголовок);
		
		МассивГруппировок = СформироватьМассивГруппировок();
	    
		МассивПоказателей = СформироватьМассивПоказателей();
			
		// Формат показателей
		СтруктураФорматовПоказателей = бит_БухгалтерскиеОтчетыСервер.СформироватьСтруктуруФорматовПоказателей(МассивПоказателей, ИмяРегистраБухгалтерии);
			
		ЗаголовокОтчета = Макет.ПолучитьОбласть("ЗаголовокОтчета");
		
		ДокументРезультат.Вывести(ЗаголовокОтчета, 1);

		ТекстРазвернутоеСальдо = ?(РазвернутоеСальдо, "РазвернутоеСальдо", "");
		ОбластьИтогиСтрокаЧисла = Макет.ПолучитьОбласть("ИтогиСтрока" + ТекстРазвернутоеСальдо + "|Числа");
		ОбластьИтогиЧислаМакет  = Макет.ПолучитьОбласть("Итоги"       + ТекстРазвернутоеСальдо + "|Числа");
		ОбластьИтогиСтрокаСчет  = Макет.ПолучитьОбласть("ИтогиСтрока" + ТекстРазвернутоеСальдо + "|Счет");
		ОбластьИтогиСчет        = Макет.ПолучитьОбласть("Итоги"       + ТекстРазвернутоеСальдо + "|Счет");
		ОбластьСтрокаСчет       = Макет.ПолучитьОбласть("Строка|Счет");
		ОбластьСтрокаЧисла      = Макет.ПолучитьОбласть("Строка|Числа");
		ОбластьСтрокаПоказателяСчет  = Макет.ПолучитьОбласть("СтрокаПоказателя|Счет");
		ОбластьСтрокаПоказателяЧисла = Макет.ПолучитьОбласть("СтрокаПоказателя|Числа");
		ОбластьСтрокаСчетВал       = Макет.ПолучитьОбласть("СтрокаВал|Счет");
		ОбластьСтрокаЧислаВал      = Макет.ПолучитьОбласть("СтрокаВал|Числа");
		ОбластьСтрокаПоказателяСчетВал  = Макет.ПолучитьОбласть("СтрокаПоказателяВал|Счет");
		ОбластьСтрокаПоказателяЧислаВал = Макет.ПолучитьОбласть("СтрокаПоказателяВал|Числа");
	
		СоответствиеСчетовПредков = бит_БухгалтерскиеОтчетыСервер.ВернутьСоответвиеСчетовПредков(Метаданные.РегистрыБухгалтерии[ИмяРегистраБухгалтерии].ПланСчетов.Имя, Счет);
		
		СтруктураПараметровОграничений = бит_БухгалтерскиеОтчетыСервер.СформироватьСтруктуруОграниченийДляОборотноСальдовойВедомостиПоСчету(ЭтотОбъект, ПоВалютам);
		
		//Если ПоВалютам Тогда		
		//	МассивГруппировок.Вставить(0, "Валюта");	 		
		//КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ОбластьСтрокаСчет"		   , ОбластьСтрокаСчет);
		СтруктураПараметров.Вставить("ОбластьСтрокаПоказателяСчет" ,ОбластьСтрокаПоказателяСчет);
		СтруктураПараметров.Вставить("ДокументРезультат"		   , ДокументРезультат);
		СтруктураПараметров.Вставить("ШрифтГрупп"				   , ШрифтГрупп);
		СтруктураПараметров.Вставить("ОбластьСтрокаПоказателяЧисла", ОбластьСтрокаПоказателяЧисла);
		СтруктураПараметров.Вставить("ОбластьСтрокаЧисла"		   , ОбластьСтрокаЧисла);
		СтруктураПараметров.Вставить("ФорматПоказателей"		   , СтруктураФорматовПоказателей);
		СтруктураПараметров.Вставить("НетЛинии"					   , Новый Линия(ТипЛинииЯчейкиТабличногоДокумента.НетЛинии, 1));
		СтруктураПараметров.Вставить("МассивПоказателей"		   , МассивПоказателей);
		СтруктураПараметров.Вставить("МассивГруппировок"		   , МассивГруппировок);
		СтруктураПараметров.Вставить("СоответствиеСчетовПредков"   , СоответствиеСчетовПредков);
		СтруктураПараметров.Вставить("СтруктураОграничений"		   , СтруктураПараметровОграничений);
		СтруктураПараметров.Вставить("ОбластьСтрокаСчетВал"		       , ОбластьСтрокаСчетВал);
		СтруктураПараметров.Вставить("ОбластьСтрокаЧислаВал"		   , ОбластьСтрокаЧислаВал);
		СтруктураПараметров.Вставить("ОбластьСтрокаПоказателяСчетВал"  , ОбластьСтрокаПоказателяСчетВал);
		СтруктураПараметров.Вставить("ОбластьСтрокаПоказателяЧислаВал" , ОбластьСтрокаПоказателяЧислаВал);
		
		// Формирование запроса
		Запрос = СформироватьЗапрос(СтруктураПараметров);
		РезультатЗапроса = Запрос.Выполнить();

		ДокументРезультат.НачатьАвтогруппировкуСтрок();

		Если МассивГруппировок.Количество() > 0 Тогда
			
			бит_БухгалтерскиеОтчетыСервер.ВывестиГруппировкуОборотноСальдовойВедомостиПоСчету(ЭтотОбъект, РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, МассивГруппировок[0]), 
								0, СтруктураПараметров);
		КонецЕсли;

		ДокументРезультат.ЗакончитьАвтогруппировкуСтрок();

		ИтогиПодвал = Макет.ПолучитьОбласть("ИтогиПодвал");

		// Выведем общие итоги
		Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОБЩИЕ");
		Выборка.Следующий();
		ВыводимаяОбласть = ОбластьИтогиСчет;
		ДокументРезультат.Вывести(ВыводимаяОбласть, 1);
		
		бит_БухгалтерскиеОтчетыСервер.ВывестиИтогиОборотноСальдовойВедомостиПоСчету(Выборка, ИмяРегистраБухгалтерии, МассивПоказателей, СтруктураФорматовПоказателей,
			Счет, ОбластьИтогиСтрокаЧисла, ОбластьИтогиЧислаМакет, ОбластьИтогиСтрокаСчет, ДокументРезультат, РазвернутоеСальдо);

		ДокументРезультат.Вывести(ИтогиПодвал, 1);
		
		// Заполним общую расшифровку:
		СтруктураНастроекОтчета = СформироватьОбщуюСтруктуруДляРасшифровки();
		СтруктураНастроекОтчета.Вставить("ПоказыватьЗаголовок", ПоказыватьЗаголовок);
		
	    ДокументРезультат.Область(1, 1).Расшифровка = СтруктураНастроекОтчета;

		// Зафиксируем заголовок отчета
		ДокументРезультат.ФиксацияСверху = ВысотаЗаголовка + 3;

		// Первую колонку не печатаем
		ДокументРезультат.ОбластьПечати = ДокументРезультат.Область(1, 2, ДокументРезультат.ВысотаТаблицы, ДокументРезультат.ШиринаТаблицы);
		
		// Присвоим имя для сохранения параметров печати табличного документа.
		ДокументРезультат.КлючПараметровПечати = "ОборотноСальдоваяВедомостьПоСчету " + ИмяРегистраБухгалтерии;

		бит_БухгалтерскиеОтчетыСервер.УстановитьКолонтитулыПоУмолчанию(ДокументРезультат, ЗаголовокОтчета(), Строка(бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь")));
		
	КонецЕсли;

	Возврат ОтчетСформирован;
	
КонецФункции // СформироватьОтчет()

// Функция возвращает массив показателей (ресурсов регистра) для отчета.
// 
// Возвращаемое значение:
//  Массив - массив показателей.
//
Функция СформироватьМассивПоказателей() Экспорт
	
	МассивПоказателей = Новый Массив;
    
    Если ВыводитьСуммуРегл Тогда 
        МассивПоказателей.Добавить("СуммаРегл");
    КонецЕсли;
    
    Если ВыводитьСуммуУпр Тогда 
        МассивПоказателей.Добавить("СуммаУпр");
    КонецЕсли;  
	
	Если мЕстьРесурсСуммаМУ И ВыводитьСуммуМУ Тогда 
        МассивПоказателей.Добавить("СуммаМУ");
    КонецЕсли;
	
    Если ПоВалютам Тогда
		МассивПоказателей.Добавить("ВалютнаяСумма");
	КонецЕсли; 
	
	Если ПоКоличеству Тогда
		МассивПоказателей.Добавить("Количество");
	КонецЕсли;
    
	Возврат МассивПоказателей;
		
КонецФункции // СформироватьМассивПоказателей()

// Формирует запрос по установленным условия, фильтрам и группировкам.
// 
// Параметры:
//  СтруктураПараметров - Структура, параметры необходимые для формирования текста запроса.
// 
// Возвращаемое значение:
//  Запрос - запрос, по которому фомируется отчет.
// 
Функция СформироватьЗапрос(СтруктураПараметров) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Счет", Счет);
	
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", ?(Период.ДатаОкончания = '00010101000000'
										  , Период.ДатаОкончания
										  , Новый Граница(КонецДня(Период.ДатаОкончания), ВидГраницы.Включая)));



	// БИТ Avseenkov 20.05.2014 Доработка отчетов по периметру
	//бит_БухгалтерскиеОтчетыСервер.УстановитьПараметрЗапроса_Организация(Запрос, Организация, Период);
	бит_БухгалтерскиеОтчетыСервер.УстановитьПараметрЗапроса_Организация(Запрос, Организация, Период, Истина);
	ТаблицаОрганизаций = бит_БухгалтерскиеОтчетыСервер.ПолучитьСоставПериметраКонсолидацииСУсловиями(Организация,Период.ДатаНачала, Период.ДатаОкончания);
	//}
	
	Если ПоСубсчетам Тогда
		Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОстаткиИОбороты.Счет КАК Счет,
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Счет) КАК СчетПредставление";
	Иначе
	    Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	&Счет КАК Счет,
		|	ПРЕДСТАВЛЕНИЕ(&Счет) КАК СчетПредставление";
	КонецЕсли;
		
	Если ПоВалютам Тогда
		
		Текст = Текст + ",
		|	ОстаткиИОбороты.Валюта КАК Валюта,
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Валюта) КАК ВалютаПредставление";
		
	КонецЕсли;
	
	Текст = Текст + бит_БухгалтерскиеОтчетыСервер.ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(СтруктураПараметров.МассивПоказателей, Истина, 
		Истина, Истина, РазвернутоеСальдо);
		
    ТекстПоля    = "";
	ТекстИтоги   = "";
	ТекстПорядок = "";
	
	Для каждого Измерение Из ПостроительОтчета.ИзмеренияСтроки Цикл
	
		ТекстПоля = ТекстПоля + ", " + Измерение.ПутьКДанным + " КАК " + Измерение.Имя;
		ТекстПоля = ТекстПоля + ", ПРЕДСТАВЛЕНИЕ(" + Измерение.ПутьКДанным + ") КАК " + Измерение.Имя + "Представление";
		
		ТекстИтоги = ТекстИтоги + ", " + Измерение.Имя + бит_БухгалтерскиеОтчетыСервер.ПолучитьПоТипуИзмеренияПостроителяОтчетаСтрокуЗапроса(Измерение.ТипИзмерения);
	
	КонецЦикла;
	
	ОтборПоВидамСубконто = "";
	ОграниченияПоПостроителюОтчета = бит_БухгалтерскиеОтчетыСервер.ПолучитьТекстОграниченийПоПостроителюОтчета(ПостроительОтчета, Запрос, ОтборПоВидамСубконто);
			
	СтрокаОграниченийПоРеквизитам = "";
	
	бит_БухгалтерскиеОтчетыСервер.ДополнитьСтрокуОграниченийПоОрганизации(СтрокаОграниченийПоРеквизитам, Организация, ОрганизацияВидСравнения, ОрганизацияИспользование);
	
	Если Не ПустаяСтрока(ОграниченияПоПостроителюОтчета)
		И Не ПустаяСтрока(СтрокаОграниченийПоРеквизитам) Тогда
		
		ОграниченияПоПостроителюОтчета = " И " + ОграниченияПоПостроителюОтчета;
		
	КонецЕсли;
	
	Текст = Текст + 
			ТекстПоля + " 
	|
	|ИЗ
	|	РегистрБухгалтерии." + ИмяРегистраБухгалтерии + ".ОстаткиИОбороты(&ДатаНач, &ДатаКон, , , Счет В ИЕРАРХИИ (&Счет)," + ОтборПоВидамСубконто + " 
	|, " + СтрокаОграниченийПоРеквизитам + ОграниченияПоПостроителюОтчета + ") КАК ОстаткиИОбороты
	|";
	
	
	// БИТ Avseenkov 20.05.2014 Доработка отчетов по периметру
	Если (ТипЗнч(Организация) = Тип("СправочникСсылка.бит_му_ПериметрыКонсолидации")) И ЗначениеЗаполнено(Организация) Тогда
		
		Если ТаблицаОрганизаций.Количество()> 0 Тогда 
			Сч = 0 ;
			Для Каждого Строка из ТаблицаОрганизаций цикл
				
				Сч = Сч + 1;
				Запрос.УстановитьПараметр("Организация"+Сч,Строка.Организация);
				СтрокаОграниченийПоРеквизитам = "";
				бит_БухгалтерскиеОтчетыСервер.ДополнитьСтрокуОграниченийПоРеквизитамДоп(СтрокаОграниченийПоРеквизитам, "Организация", Строка.Организация,"Организация"+Сч);
				
				
				Текст = Текст + " 
				| ОБЪЕДИНИТЬ ВСЕ";
				
				
				
				Если ПоСубсчетам Тогда
					Текст =  Текст + "
					|   ВЫБРАТЬ 
					|	ОстаткиИОбороты.Счет КАК Счет,
					|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Счет) КАК СчетПредставление";
				Иначе
					Текст = Текст + " 
					|   ВЫБРАТЬ 
					|	&Счет КАК Счет,
					|	ПРЕДСТАВЛЕНИЕ(&Счет) КАК СчетПредставление";
				КонецЕсли;
				
				Если ПоВалютам Тогда
					
					Текст = Текст + ",
					|	ОстаткиИОбороты.Валюта КАК Валюта,
					|	ПРЕДСТАВЛЕНИЕ(ОстаткиИОбороты.Валюта) КАК ВалютаПредставление";
					
				КонецЕсли;
				
				Текст = Текст +   бит_БухгалтерскиеОтчетыСервер.ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомостьБИТ(СтруктураПараметров.МассивПоказателей, Истина, 
				Истина, Истина, РазвернутоеСальдо,,Строка);
				
				ТекстПоля    = "";
				
				Для каждого Измерение Из ПостроительОтчета.ИзмеренияСтроки Цикл
					
					ТекстПоля = ТекстПоля + ", " + Измерение.ПутьКДанным + " КАК " + Измерение.Имя;
					ТекстПоля = ТекстПоля + ", ПРЕДСТАВЛЕНИЕ(" + Измерение.ПутьКДанным + ") КАК " + Измерение.Имя + "Представление";
					
					//ТекстИтоги = ТекстИтоги + ", " + Измерение.Имя + бит_БухгалтерскиеОтчеты.ПолучитьПоТипуИзмеренияПостроителяОтчетаСтрокуЗапроса(Измерение.ТипИзмерения);
					
				КонецЦикла;
				
				Если Строка.ДатаОкончания > Период.ДатаНачала и
					Строка.ДатаОкончания < КонецДня(Период.ДатаОкончания) Тогда 
					ДатаКонец = "&ДатаКон"+Сч;
					Запрос.УстановитьПараметр("ДатаКон"+Сч, КонецДня(Строка.ДатаОкончания));
				Иначе 
					ДатаКонец = "&ДатаКон";
				КонецЕсли;
				
				Если Строка.Период > Период.ДатаНачала Тогда 
					ДатаНачало = "&ДатаНач"+Сч;
					Запрос.УстановитьПараметр("ДатаНач"+Сч,Строка.Период);
				Иначе 
					ДатаНачало = "&ДатаНач";
				КонецЕсли;
				
				
				Текст = Текст + ТекстПоля + "
				|
				|ИЗ
				|	РегистрБухгалтерии."+ИмяРегистраБухгалтерии+".ОстаткиИОбороты("+ ДатаНачало+","+ ДатаКонец+", , , Счет В ИЕРАРХИИ (&Счет),"+ОтборПоВидамСубконто+" 
				|, " + СтрокаОграниченийПоРеквизитам + ОграниченияПоПостроителюОтчета + ") КАК ОстаткиИОбороты
				|";
				
				
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	//}
	
	ТекстИтогов = бит_БухгалтерскиеОтчетыСервер.ВернутьЧастьЗапросаПоВыборкеПолейОборотноСальдоваяВедомость(СтруктураПараметров.МассивПоказателей, Ложь, , , РазвернутоеСальдо);
	
	Текст = Текст + Символы.ПС + "ИТОГИ" + Символы.ПС + Сред(ТекстИтогов, 2);
				
	Текст = Текст + "
	|	ПО ОБЩИЕ";
	
	Если ПоСубсчетам Тогда
		
		Текст = Текст + ",
		|	Счет ИЕРАРХИЯ КАК Счет ";
		
	КонецЕсли;
	
	Если ПоВалютам Тогда
		
		Текст = Текст + ",
		|	Валюта ";
		
	КонецЕсли;
	
	Текст = Текст + ТекстИтоги + "
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос;
	
КонецФункции // СформироватьЗапрос()

// Функция возвращает общую структуру для расшифровки.
// 
// Возвращаемое значение:
//  Структура - общая структура расшифровки.
// 
Функция СформироватьОбщуюСтруктуруДляРасшифровки() Экспорт
	
	СтруктураНастроекОтчета = Новый Структура;

	СтруктураНастроекОтчета.Вставить("Период", Период);
	
	СтруктураНастроекОтчета.Вставить("Организация"             , Организация);
	СтруктураНастроекОтчета.Вставить("ОрганизацияВидСравнения" , ОрганизацияВидСравнения);
	СтруктураНастроекОтчета.Вставить("ОрганизацияИспользование", ОрганизацияИспользование);
    
    СтруктураНастроекОтчета.Вставить("ВыводитьСуммуРегл" , ВыводитьСуммуРегл);
    СтруктураНастроекОтчета.Вставить("ВыводитьСуммуУпр"  , ВыводитьСуммуУпр);
	СтруктураНастроекОтчета.Вставить("РегистрБухгалтерии", РегистрБухгалтерии);
	
	Если мЕстьРесурсСуммаМУ Тогда
		СтруктураНастроекОтчета.Вставить("ВыводитьСуммуМУ", ВыводитьСуммуМУ);
	КонецЕсли;
	
	НастройкиОтбора = бит_БухгалтерскиеОтчетыСервер.ПолучитьКопиюОтбораВТЗ(ПостроительОтчета.Отбор);
	
	// BIT AMerkulov 26062014 ++
	
	Если Счет.Валютный Тогда
		СтрокаОтбораВалюты = НастройкиОтбора.Добавить();
		СтрокаОтбораВалюты.ВидСравнения = ВидСравнения.Равно;
		СтрокаОтбораВалюты.Имя = "Валюта";
		СтрокаОтбораВалюты.Представление = "Валюта";
		СтрокаОтбораВалюты.ПутьКДанным = "Валюта";
		СтрокаОтбораВалюты.Использование = Ложь;
		
		Массив = Новый Массив;
		Массив.Добавить(Тип("СправочникСсылка.Валюты"));
		Описание  = Новый ОписаниеТипов(Массив);
		
		СтрокаОтбораВалюты.ТипЗначения = Описание;
		
	КонецЕсли;
	
	
	// BIT AMerkulov 26062014 --
	
	СтруктураНастроекОтчета.Вставить("Отбор", Новый ХранилищеЗначения(НастройкиОтбора));
			
	Возврат СтруктураНастроекОтчета;
	
КонецФункции // СформироватьОбщуюСтруктуруДляРасшифровки()

// Функция возвращает массив группировок для отчета.
// 
// Параметры:
//  Массив - массив группировок.
// 
Функция СформироватьМассивГруппировок() Экспорт
	
	МассивГруппировок = Новый Массив;

	Если ПоСубСчетам Тогда
		МассивГруппировок.Добавить("Счет");
	КонецЕсли;
	
	Для Сч = 0 По ПостроительОтчета.ИзмеренияСтроки.Количество() - 1  Цикл
		
		МассивГруппировок.Добавить(ПостроительОтчета.ИзмеренияСтроки[Сч].Имя);
		
	КонецЦикла;

	Возврат МассивГруппировок;
		
КонецФункции // СформироватьМассивГруппировок()

#КонецОбласти

// Процедура выполняется при смене счета
// 
// Параметры:
//  УстановитьСтарыеНастройки - Булево (По умолчанию = Истина).
// 
Процедура ОбработкаВыбораСчета(УстановитьСтарыеНастройки = Истина) Экспорт

    СвСч = бит_БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
    
	ПоВалютам    = СвСч.Валютный; 
	ПоКоличеству = СвСч.Количественный;
	ПоСубсчетам  = Истина;
	
	СтарыеНастройки = бит_БухгалтерскиеОтчетыСервер.ПолучитьКопиюОтбораВТЗ(ПостроительОтчета.Отбор);
	
	ЗаполнитьНачальныеНастройки();
    
    бит_БухгалтерскиеОтчетыСервер.СформироватьПервоначальныйОтборПостроителяПоСубконто(ПостроительОтчета, Счет);
    
    Если УстановитьСтарыеНастройки Тогда
        бит_БухгалтерскиеОтчетыСервер.УстановитьОтборИзТаблицы(ПостроительОтчета.Отбор, СтарыеНастройки);
    КонецЕсли;
    
КонецПроцедуры // ОбработкаВыбораСчета()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проверки

// Проверка корректности настроек отчета
// 
// Возвращаемое значение:
//   Булево
// 
Функция ПараметрыОтчетаКорректны()
  	
	РезультатПроверки = 
		бит_БухгалтерскиеОтчетыСервер.ПроверитьСчет(Счет)
		И бит_ОбщегоНазначенияКлиентСервер.ВременнойИнтервалКорректный(Период.ДатаНачала, Период.ДатаОкончания)
		И бит_БухгалтерскиеОтчетыСервер.ПроверитьНаличиеВыбранногоПоказателя(ЭтотОбъект, Ложь, мЕстьРесурсСуммаМУ)
		И Не бит_БухгалтерскиеОтчетыСервер.ОпределитьНаличиеДублирующегосяПараметраВИзмерениях(ПостроительОтчета);
	
	Возврат РезультатПроверки;
	
КонецФункции // ПараметрыОтчетаКорректны()

#КонецОбласти

#КонецОбласти

#Область Инициализация
	
СохраненнаяНастройка = Справочники.бит_СохраненныеНастройки.ПустаяСсылка();

// Сформируем список выбора регистров бухгалтерии.
мСписокРегистров = бит_УправленческийУчет.СформироватьСписокОбъектовДляВыбора(Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии, "бит_Дополнительный");

мПрограммноеОткрытие = Ложь;
мЕстьРесурсСуммаМУ   = Ложь;

#КонецОбласти

#КонецЕсли
