//ОК Ванюков К.А. + /Установка интервала дат с начала открытого квартала организации Окей
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Запрос 											= Новый Запрос;
	Запрос.Текст 									= "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//|	ГраницыЗапретаИзмененияДанных.Организация,
	//|	ГраницыЗапретаИзмененияДанных.ГраницаЗапретаИзменений
	//|ИЗ
	//|	РегистрСведений.ГраницыЗапретаИзмененияДанных КАК ГраницыЗапретаИзмененияДанных
	//|ГДЕ
	//|	ГраницыЗапретаИзмененияДанных.Организация.Код = ""000000045""";
	|	ГраницыЗапретаИзмененияДанных.Организация,
	|	ГраницыЗапретаИзмененияДанных.ДатаЗапрета КАК ГраницаЗапретаИзменений 
	|ИЗ
	|	РегистрСведений.бит_ДатыЗапретаРедактирования КАК ГраницыЗапретаИзмененияДанных
	|ГДЕ
	|	ГраницыЗапретаИзмененияДанных.Организация.Код = ""000000045""";

	
	Выборка 										= Запрос.Выполнить().Выбрать();
	ДатаОтбора = Дата(1, 1, 1);
	ПолеКомпоновкиДата = Новый ПолеКомпоновкиДанных("Дата");
	Если Выборка.Следующий() Тогда 
		ДатаЗапретаРедактирования 					= Выборка.ГраницаЗапретаИзменений;
		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДата Тогда
				ДатаОтбора = ЭлементОтбора.ПравоеЗначение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ДатаОтбора < ДатаЗапретаРедактирования Тогда 
			//Список.Отбор.Дата.ВидСравнения	= ВидСравнения.Больше;
			//Список.Отбор.Дата.Значение		= ДатаЗапретаРедактирования;
			//Список.Отбор.Дата.Использование	= Истина;
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Дата", ДатаЗапретаРедактирования, ВидСравненияКомпоновкиДанных.Больше,,Истина);
		КонецЕсли;
	КонецЕсли;
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-15 (#3101)
	УстановитьУсловноеОформление();
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-16 (#3161)
	//Элементы.ок_НеНайденКонтракт.Видимость   = Пользователи.ЭтоПолноправныйПользователь();
	//Элементы.ок_НеНайденКонтракт.Доступность = Пользователи.ЭтоПолноправныйПользователь();	
	//Заменено на:
	Элементы.ок_НеНайденКонтракт.Видимость   = Ложь;
	Элементы.ок_НеНайденКонтракт.Доступность = Ложь;	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-16 (#3161)
	
	
	Если УправлениеДоступом.ЕстьРоль("бит_БК_ГлавныйБК") Тогда 
		
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-16 (#3161)
		Элементы.ок_НеНайденКонтракт.Видимость   = Истина;
		Элементы.ок_НеНайденКонтракт.Доступность = Истина;
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-16 (#3161)
		
		НоваяКоманда = Команды.Добавить("ок_ТранслироватьВБК");
		НоваяКоманда.Действие  = "ТранслироватьВБККоманда";
		НоваяКоманда.Заголовок = "Транслировать в БК";
		НоваяКоманда.Подсказка = "Транслировать выделенные документы в БК";
		
		НоваяКнопка = Элементы.Добавить("ТранслироватьВБК", Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанель);
		НоваяКнопка.ИмяКоманды = "ок_ТранслироватьВБК";			

	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-15 (#3101)
	
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-16 (#3101)
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Возврат;
	
	// Видимость ок_НеНайденКонтракт

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ок_НеНайденКонтракт");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость"	, Пользователи.ЭтоПолноправныйПользователь());
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Доступность"	, Пользователи.ЭтоПолноправныйПользователь());
	
	
КонецПроцедуры
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-16 (#3101)

&НаСервере
Функция ТипДокументаПриИзменении_Сервер()
	Если ЗначениеЗаполнено(ТипДокумента) Тогда 
		ТипДокументаИспользование	= Истина;
	Иначе 
		ТипДокументаИспользование	= Ложь;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипДокумента", ТипДокумента, ВидСравненияКомпоновкиДанных.Равно,,ТипДокументаИспользование);
КонецФункции


//ОК Ванюков К.А. + /Автоматическая установка отборов при заполнении значений отборов / 2012-12-21
&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	ТипДокументаПриИзменении_Сервер();	
КонецПроцедуры

&НаСервере
Функция ВаучерПриИзменении_Сервер()
	Если ЗначениеЗаполнено(Ваучер) Тогда 
		ВаучерИспользование	= Истина;
	Иначе 
		ВаучерИспользование	= Ложь;
	КонецЕсли;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ваучер", Ваучер, ВидСравненияКомпоновкиДанных.Равно,,ВаучерИспользование);
КонецФункции


//ОК Ванюков К.А. + /Автоматическая установка отборов при заполнении значений отборов / 2012-12-21
&НаКлиенте
Процедура ВаучерПриИзменении(Элемент)
	ВаучерПриИзменении_Сервер();	
КонецПроцедуры


&НаКлиенте
Процедура ИспользованиеВаучерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ваучер", Ваучер, ВидСравненияКомпоновкиДанных.Равно,,ВаучерИспользование);
КонецПроцедуры


&НаКлиенте
Процедура ИспользованиеТипДокументаПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипДокумента", ТипДокумента, ВидСравненияКомпоновкиДанных.Равно,,ТипДокументаИспользование);
КонецПроцедуры

//ОК Ванюков К.А. -

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-16 (#3101)
&НаКлиенте
Процедура ТранслироватьВБККоманда(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество()=0 Тогда 
		Возврат;
	КонецЕсли;
	
	//ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2019-04-11 (#3325)
	//ТранслироватьВБКНаСервере();
	Если ТранслироватьВБКНаСервере(Элементы.Список.ВыделенныеСтроки) Тогда
		Элементы.Список.Обновить(); // чтобы обновить признаки "Не найден контракт" в форме списка
	КонецЕсли;	
	//ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2019-04-11 (#3325)
	
КонецПроцедуры

//ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2019-04-11 (#3325)
//&НаСервере
//Процедура ТранслироватьВБКНаСервере()
&НаСервереБезКонтекста
Функция ТранслироватьВБКНаСервере(Знач ВыделенныеСтроки)	
//ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2019-04-11 (#3325)	
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-11 (#3101)		
	//Запрос = Новый Запрос;
	//Запрос.УстановитьПараметр("ВыбранныеОперации"	,	Элементы.Список.ВыделенныеСтроки);
	//
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	//|	бит_ок_ОперацияАксапты.Ссылка КАК Ссылка
	//|ИЗ	
	//|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный, 	
	//|	Документ.бит_ок_ОперацияАксапты КАК бит_ок_ОперацияАксапты
	//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.бит_ОборотыПоБюджетам КАК бит_ОборотыПоБюджетам
	//|	ПО (бит_ОборотыПоБюджетам.Регистратор = бит_ок_ОперацияАксапты.Ссылка)
	//|		И (бит_ОборотыПоБюджетам.Активность)
	//|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДополнительныеДанныеПоОперациямАксапты КАК бит_ДополнительныеДанныеПоОперациямАксапты
	//|	ПО (бит_ДополнительныеДанныеПоОперациямАксапты.Документ = бит_ок_ОперацияАксапты.Ссылка)		
	//|ГДЕ
	//|	бит_ОборотыПоБюджетам.Регистратор ЕСТЬ NULL
	//|	И бит_ок_ОперацияАксапты.Ссылка В (&ВыбранныеОперации)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	бит_ок_ОперацияАксапты.Ссылка";
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//
	//Если РезультатЗапроса.Пустой() Тогда 
	//	Возврат;
	//КонецЕсли;
	//
	//МассивИсточники = Новый Массив;
	//Источник = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное","РегистрНакопления.бит_ок_ОборотыАксапты");
	//Если ЗначениеЗаполнено(Источник) Тогда
	//	МассивИсточники.Добавить(Источник);
	//КонецЕсли;
	//МассивПриемники = Новый Массив;
	//Приемник = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное","РегистрНакопления.бит_ОборотыПоБюджетам");
	//Если ЗначениеЗаполнено(Приемник) Тогда
	//	МассивПриемники.Добавить(Приемник);
	//КонецЕсли;
	//Приемник = Справочники.бит_ОбъектыСистемы.НайтиПоРеквизиту("ИмяОбъектаПолное","РегистрНакопления.бит_КонтрольныеЗначенияБюджетов");
	//Если ЗначениеЗаполнено(Приемник) Тогда
	//	МассивПриемники.Добавить(Приемник);
	//КонецЕсли;
	//	
	//ОК_ОбщегоНазначения.ВыполнитьТрансляциюОперацийАксаптыВРегистрыБК(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка"), МассивИсточники, МассивПриемники);
	//Заменено на:
	//ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2019-04-11 (#3325)
	//Документы.бит_ок_ОперацияАксапты.ТранслироватьВБК(Элементы.Список.ВыделенныеСтроки);
	//КонецПроцедуры
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-11 (#3101)
	Возврат Документы.бит_ок_ОперацияАксапты.ТранслироватьВБК(ВыделенныеСтроки);	
КонецФункции
//ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2019-04-11 (#3325)
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-11 (#3101)			

//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-16 (#3101)

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//ОКЕЙ Рычаков А.С. (СофтЛаб) Начало 2019-11-13 (#3533)
	// проверим связку документа с ЗнРДС, если есть, то запретим изменение документа
	ок_УправлениеФормамиКлиент.ОбновлениеКомандПриАктивацииСтрокиВФормеСписка(ЭтотОбъект);
	//ОКЕЙ Рычаков А.С. (СофтЛаб) Конец 2019-11-13 (#3533)
	
КонецПроцедуры