
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДанных.Значение = НачалоПериода;
	ПараметрДанных.Использование = ЗначениеЗаполнено(НачалоПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДанных.Значение = КонецДня(КонецПериода);
	ПараметрДанных.Использование = ЗначениеЗаполнено(КонецПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	ПараметрДанных.Значение = Организация;
	ПараметрДанных.Использование = ЗначениеЗаполнено(Организация);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ГруппаОСУУ");
	ПараметрДанных.Значение = ГруппаОСУУ;
	ПараметрДанных.Использование = ЗначениеЗаполнено(ГруппаОСУУ);
	
	
	стрЗаголовок = ?(ЗначениеЗаполнено(Организация), БухгалтерскиеОтчетыВызовСервера.ПолучитьТекстОрганизация(Организация) + Символы.ПС, "") + "Комплектация ОС " +БухгалтерскиеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(НачалоПериода, КонецПериода);
	
	КомпоновщикНастроек.Настройки.ПараметрыВывода.Элементы.Найти("Title").Значение = стрЗаголовок;
	
КонецПроцедуры
