
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	Элементы.ФормаКонвертировать.Видимость = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаЗаполнитьМСФО(Команда)
	
	ТекстВопроса =  НСтр("ru = 'Заполнить алгоритма закрытия месяца МСФО по умолчанию. Продолжить?'");
	Оповещение = Новый ОписаниеОповещения("КомандаЗаполнитьОкончание", ЭтотОбъект);
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Обработчик завершения выбора диалога вопрос.
//  См. Синтакс-помощник: ПоказатьВопрос().
//
&НаКлиенте 
Процедура КомандаЗаполнитьОкончание(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьАлгоритм();
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_уп_Алгоритмы"));
		ОповеститьОбИзменении(Тип("СправочникСсылка.бит_ПользовательскиеДействия"));
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполнение завершено.'")); 
	КонецЕсли;
                
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет и назначает перечень виз по-умолчанию.
// 
&НаСервере
Процедура ЗаполнитьАлгоритм()
	
	Справочники.бит_уп_Алгоритмы.ЗаполнитьАлгоритм("ЗакрытиеМуПоУмолчанию");
	
КонецПроцедуры // ЗаполнитьВизы()

&НаКлиенте
Процедура Конвертировать(Команда)
	
	КонвертироватьНаСервере();
	ОповеститьОбИзменении(Тип("СправочникСсылка.бит_уп_Алгоритмы"));
	
КонецПроцедуры

&НаСервере
Процедура КонвертироватьНаСервере()

	Справочники.бит_уп_Алгоритмы.ЗаполнитьКартуМаршрутаXMLПриПереходеНаНовуюВерсию(Истина);
	
КонецПроцедуры

#КонецОбласти
