
&НаКлиенте
Процедура УстановитьВсеФлаги(Команда)
	Для Каждого Стр Из ТаблицаАналитик Цикл
		Стр.Выбор = Истина;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлаги(Команда)
	Для Каждого Стр Из ТаблицаАналитик Цикл
		Стр.Выбор = Ложь;	
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Если СуммаДляЗагрузки > 0 Тогда
		Коэффициент = Выбрано/СуммаДляЗагрузки;
		Для Каждого ТекСтрока Из ТаблицаАналитик Цикл
			Если ТекСтрока.Выбор Тогда 
			 ТекСтрока.Сумма = ТекСтрока.Сумма/Коэффициент;
			 КонецЕсли;
		КонецЦикла;		
	КонецЕсли;
	
	
	ЭтаФорма.Закрыть(ТаблицаАналитик);
	
КонецПроцедуры


&НаСервере
Процедура ПересчитатьСуммы()
	
	СуммаВыбранных = 0;
	
	Для Каждого ТекСтрока Из ТаблицаАналитик Цикл
		Если ТекСтрока.Выбор Тогда 
			 СуммаВыбранных = СуммаВыбранных + ТекСтрока.Сумма;
		 КонецЕсли;
	 КонецЦикла;	 
	Выбрано = СуммаВыбранных;
	
	СуммаДляЗагрузки = Выбрано;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикВыборПриИзменении(Элемент)
	ПересчитатьСуммы();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		Заявка = Параметры.Заявка;
		СуммаВключаетНДС = Параметры.СуммаВключаетНДС;
	
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	бит_ФормаВводаБюджетаБДДС.ЦФО,
		                      |	СУММА(ВЫБОР
		                      |			КОГДА &СуммаВключаетНДС
		                      |				ТОГДА бит_ФормаВводаБюджетаБДДС.Сумма
		                      |			ИНАЧЕ бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС
		                      |		КОНЕЦ) КАК Сумма,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-30 (#3117)
							  //|	NULL КАК СтавкаНДС,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-30 (#3117)		                      
		                      |	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов,
		                      |	бит_ФормаВводаБюджетаБДДС.Период,
		                      |	бит_ФормаВводаБюджетаБДДС.Аналитика_2 КАК Объект,
		                      |	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-30 (#3117)
							  |	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС КАК СтавкаНДС,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-30 (#3117)
		                      |	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС
		                      |ИЗ
		                      |	Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС
		                      |ГДЕ
		                      |	бит_ФормаВводаБюджетаБДДС.Ссылка = &Заявка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	бит_ФормаВводаБюджетаБДДС.Аналитика_2,
		                      |	бит_ФормаВводаБюджетаБДДС.Период,
		                      |	бит_ФормаВводаБюджетаБДДС.ЦФО,
		                      |	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов,
		                      |	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-30 (#3117)
							  |	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС,
							  //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-30 (#3117)
		                      |	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС");
						  
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Запрос.УстановитьПараметр("СуммаВключаетНДС", СуммаВключаетНДС);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДобавленнаяСтрока = ТаблицаАналитик.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,Выборка);
		ДобавленнаяСтрока.Выбор = Истина;
		
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-30 (#3117)
		//Если Выборка.бит_БК_ЦенаБезНДС <> Выборка.бит_БК_ЦенаСНДС Тогда
		//	ДобавленнаяСтрока.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;	
		//КонецЕсли;
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-30 (#3117)		
		
	КонецЦикла;
	
	ПересчитатьСуммы();

КонецПроцедуры
