
&НаКлиенте
Процедура ОткрытьФормуВводаНастроекКазначейства(Команда)
	ОткрытьФорму("РегистрСведений.СБ_НастройкиКазначейства.Форма.ФормаВводаНастроекКазначейства"); 
КонецПроцедуры

//ОКЕЙ Рычаков А.C. (СофтЛаб) Начало 2019-11-27 (#3437)
&НаСервере
Процедура СписокПроверкаПеретаскиванияНаСервере(ПараметрыПеретаскивания, Ключ)
	
	МенеджерЗаписи = РегистрыСведений.СБ_НастройкиКазначейства.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи,ПараметрыПеретаскивания);
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.ок_ПредставлениеРаздела = Ключ;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если ЗначениеЗаполнено(Строка) И ТипЗнч(Строка) = Тип("СтрокаГруппировкиДинамическогоСписка") И ПараметрыПеретаскивания.Значение.Количество() > 0 Тогда
		СписокПроверкаПеретаскиванияНаСервере(ПараметрыПеретаскивания.Значение[0], Строка.Ключ);
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры
//ОКЕЙ Рычаков А.C. (СофтЛаб) Конец 2019-11-27 (#3437)
