

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПараметрДатаС = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаНач");
	ПараметрДатаС.Значение = ДатаС;
	
	ПараметрДатаПо = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ДатаКон");
	ПараметрДатаПо.Значение = КонецДня(ДатаПо);
	
	НашНаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	
	Если ЗначениеЗаполнено(ОрганизацияЗаказчик) Тогда
		ПараметрОрганизацияЗаказчик = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияЗаказчик");
		ПараметрОрганизацияЗаказчик.Значение = ОрганизацияЗаказчик;
	Иначе
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "&ОрганизацияЗаказчик", "бит_му_НРП_ВНА.ОрганизацияЗаказчик");	
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОрганизацияПодрядчик) Тогда
		ПараметрОрганизацияПодрядчик = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияПодрядчик");
		ПараметрОрганизацияПодрядчик.Значение = ОрганизацияПодрядчик;
	Иначе
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "&ОрганизацияПодрядчик", "бит_му_НРП_ВНА.ОрганизацияПодрядчик");	
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ОбъектОС) Тогда
		
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "= &Объект", "<> 2");
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "ИНАЧЕ ЛОЖЬ", "ИНАЧЕ ИСТИНА");
		ПараметрОбъект = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Объект");
		ПараметрОбъект.Значение = Справочники.ОбъектыСтроительства.ПустаяСсылка();
		
	Иначе
		
		ПараметрОбъект = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Объект");
		ПараметрОбъект.Значение = ОбъектОС;
		
	КонецЕсли;	
	
КонецПроцедуры

