#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти	
	
#Область СлужебныйПрограммныйИнтерфейс

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт
	
	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация
	|ИЗ
	|	Документ.бит_ЗакрытиеЗаявок КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка";
	
	Результат = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(Результат[0]);
	
	НомераТаблиц = Новый Структура;

	Запрос.Текст = ТекстЗапросаДокументыПланирования(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();
	
	Для каждого НомерТаблицы Из НомераТаблиц Цикл
		ПараметрыПроведения.Вставить(НомерТаблицы.Ключ, Результат[НомерТаблицы.Значение].Выгрузить());
	КонецЦикла;
	
	ПараметрыПроведения.Вставить("Реквизиты", Реквизиты);	
	Возврат ПараметрыПроведения;
	
КонецФункции 

#КонецОбласти 	

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаДокументыПланирования(НомераТаблиц)
	
	НомераТаблиц.Вставить("ДокументыПланирования", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ДокументыПланирования.НомерСтроки КАК НомерСтроки,
	|	ДокументыПланирования.ДокументПланирования КАК ДокументПланирования,
	|	ДокументыПланирования.ПричинаЗакрытия КАК ПричинаЗакрытия
	|ИЗ
	|	Документ.бит_ЗакрытиеЗаявок.ДокументыПланирования КАК ДокументыПланирования
	|ГДЕ
	|	ДокументыПланирования.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти 
 
#КонецЕсли
