#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет дополнительные списки.
// 
// Параметры:
//  СписокПараметровНаФорме     - СписокЗначений - список параметров на форме.
//  СписокДополнительныхСвойств - СписокЗначений - список дополнительных свойств.
// 
Процедура ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме, СписокДополнительныхСвойств, ЭтоРасшифровка) Экспорт
	
	// Список имен параметров СКД, заполняемых пользователем через элементы формы.
	СписокПараметровНаФорме.Добавить("Периодичность");
	СписокПараметровНаФорме.Добавить("Бюджет");
	СписокПараметровНаФорме.Добавить("ОтображатьПустыеСтроки");
	
	// Список дополнительных свойств
	СписокДополнительныхСвойств.Добавить("ВидОтчета");
	СписокДополнительныхСвойств.Добавить("СценарииСравнения");
		
КонецПроцедуры // ЗаполнитьДополнительныеСписки()

#КонецОбласти
 
#КонецЕсли
