
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	флУдалось = ПроверитьПодключение(ТекущаяСтрока.Ссылка); 	
	Если флУдалось Тогда		
		ТекстСообщения = НСтр("ru = 'Тестовое подключение успешно выполнено.'");		
	Иначе		
		ТекстСообщения = НСтр("ru = 'Не удалось выполнить тестовое подключение!'");		
	КонецЕсли; 
	
	ЗаголовокСообщения = НСтр("ru = 'Тестовое подключение'");	
	ПоказатьПредупреждение(,ТекстСообщения, 15, ЗаголовокСообщения);		
	
КонецПроцедуры // КомандаПроверитьПодключение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция производит тестовое подключение.
// 
// Возвращаемое значение:
//  флУдалось - Булево.
// 
&НаСервере
Функция ПроверитьПодключение(НастройкаПодключения)
	
	флУдалось = Ложь;	
	Если НастройкаПодключения.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
		
		 флУдалось = Справочники.бит_мпд_НастройкиВнешнихПодключений.ТестовоеСоедениеREST(НастройкаПодключения, "Ошибки");
		
	Иначе	
		
		Подключение = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьКОМ(НастройкаПодключения,"Ошибки");
		
		Если Подключение = Неопределено Тогда		
			флУдалось = Ложь; 		
		Иначе	           		
			флУдалось = Истина; 		
		КонецЕсли; 
		
		Подключение = Неопределено;
		
	КонецЕсли; 
	
	Возврат флУдалось;
	
КонецФункции // ПроверитьПодключение()

#КонецОбласти

