
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заявка 			   = Параметры.Заявка;		
	ДокументЗаполнения = Параметры.Документ;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ФормаВводаБюджета.Ссылка КАК ФВБ,
	|	ПоступлениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПоступлениеТоваровУслуг.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ПОМЕСТИТЬ ВТ0_Инвест
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
	|		ПО (ИСТИНА)
	|ГДЕ
	|	бит_ФормаВводаБюджета.Ссылка = &Заявка
	|	И ПоступлениеТоваровУслуг.Ссылка = &ДокументЗаполнения
	|	И бит_ФормаВводаБюджета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ФормаВводаБюджета.Ссылка,
	|	ПоступлениеНМА.Контрагент,
	|	ПоступлениеНМА.ДоговорКонтрагента
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеНМА КАК ПоступлениеНМА
	|		ПО (ИСТИНА)
	|ГДЕ
	|	бит_ФормаВводаБюджета.Ссылка = &Заявка
	|	И ПоступлениеНМА.Ссылка = &ДокументЗаполнения
	|	И бит_ФормаВводаБюджета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Начало 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13)
	| &ЗапросДляАвансовогоОтчета
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Конец 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФВБ,
	|	ДоговорКонтрагента,
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_ФормаВводаБюджетаБДДС.Период КАК ок_Период,
	|	бит_ФормаВводаБюджетаБДДС.ЦФО КАК ок_ЦФО,
	|	бит_ФормаВводаБюджетаБДДС.Проект КАК ок_Проект,
	|	бит_ФормаВводаБюджетаБДДС.Аналитика_2 КАК ок_Аналитика_2,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов КАК ок_СтатьяОборотов,
	|	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС КАК СтавкаНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС КАК СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.Сумма КАК Сумма,
	|	бит_ФормаВводаБюджетаБДДС.Сумма - бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС КАК СуммаНДС,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов.ВидСтатьи КАК ВидСтатьи,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-08 (#3141)
	//|	бит_ФормаВводаБюджетаБДДС.НомерСтроки КАК НомерСтроки,
	//Заменено на:
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС КАК ЦенаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС КАК ЦенаСНДС,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-08 (#3141)
	|	бит_ФормаВводаБюджетаБДДС.Контрагент КАК ок_Контрагент,
	|	бит_ФормаВводаБюджетаБДДС.ДоговорКонтрагента КАК ок_ДоговорКонтрагента,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_Организация КАК ок_Организация
	|ИЗ
	|	ВТ0_Инвест КАК ВТ0_Инвест
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-11 (#3157)
	//|		ПО ВТ0_Инвест.ФВБ = бит_ФормаВводаБюджетаБДДС.Аналитика_1
	//Заменено на:
	|		ПО (ВТ0_Инвест.ФВБ = бит_ФормаВводаБюджетаБДДС.Аналитика_1 ИЛИ
	|			ВТ0_Инвест.ФВБ = бит_ФормаВводаБюджетаБДДС.Ссылка.бит_бк_НомерЗаявки)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-11 (#3157)	
	|			И ВТ0_Инвест.Контрагент = бит_ФормаВводаБюджетаБДДС.Контрагент
	|			И ВТ0_Инвест.ДоговорКонтрагента = бит_ФормаВводаБюджетаБДДС.ДоговорКонтрагента
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Начало 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13) 
	//|			И (бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Контракт))
	//Заменено на:
	|			И (бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Контракт) &УсловиеДляАвансовогоОтчета)
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Конец 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ФормаВводаБюджетаБДДС.Период,
	|	бит_ФормаВводаБюджетаБДДС.ЦФО,
	|	бит_ФормаВводаБюджетаБДДС.Проект,
	|	бит_ФормаВводаБюджетаБДДС.Аналитика_2,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов,
	|	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.Сумма,
	|	бит_ФормаВводаБюджетаБДДС.Сумма - бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов.ВидСтатьи,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-08 (#3141)
	//|	бит_ФормаВводаБюджетаБДДС.НомерСтроки,
	//Заменено на:
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-08 (#3141)
	|	бит_ФормаВводаБюджетаБДДС.Контрагент,
	|	бит_ФормаВводаБюджетаБДДС.ДоговорКонтрагента,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_Организация
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС
	|ГДЕ
	|	бит_ФормаВводаБюджетаБДДС.Ссылка = &Заявка
	|	И бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
	|
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-25 (#3102)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ФормаВводаБюджетаБДДС.Период,
	|	бит_ФормаВводаБюджетаБДДС.ЦФО,
	|	бит_ФормаВводаБюджетаБДДС.Проект,
	|	бит_ФормаВводаБюджетаБДДС.Аналитика_2,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов,
	|	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.Сумма,
	|	бит_ФормаВводаБюджетаБДДС.Сумма - бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов.ВидСтатьи,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-08 (#3141)
	//|	бит_ФормаВводаБюджетаБДДС.НомерСтроки,
	//Заменено на:
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-08 (#3141)
	|	бит_ФормаВводаБюджетаБДДС.Контрагент,
	|	бит_ФормаВводаБюджетаБДДС.ДоговорКонтрагента,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_Организация
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС	
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
	|		ПО бит_ФормаВводаБюджетаБДДС.Аналитика_1 = бит_ФормаВводаБюджета.Ссылка	
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(&ДокументЗаполнения) = ТИП(Документ.бит_БюджетнаяОперация)
	|	И бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Контракт)
	|	И бит_ФормаВводаБюджетаБДДС.Аналитика_1 = &Заявка
	|	И бит_ФормаВводаБюджета.Ссылка = &Заявка
	|	И бит_ФормаВводаБюджета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-25 (#3102)
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	бит_ФормаВводаБюджетаБДДС.Период,
	|	бит_ФормаВводаБюджетаБДДС.ЦФО,
	|	бит_ФормаВводаБюджетаБДДС.Проект,
	|	бит_ФормаВводаБюджетаБДДС.Аналитика_2,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов,
	|	бит_ФормаВводаБюджетаБДДС.бит_СтавкаНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.Сумма,
	|	бит_ФормаВводаБюджетаБДДС.Сумма - бит_ФормаВводаБюджетаБДДС.бит_БК_СуммаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.СтатьяОборотов.ВидСтатьи,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-08 (#3141)
	//|	бит_ФормаВводаБюджетаБДДС.НомерСтроки,
	//Заменено на:
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаБезНДС,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_ЦенаСНДС,
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-08 (#3141)
	|	бит_ФормаВводаБюджетаБДДС.Контрагент,
	|	бит_ФормаВводаБюджетаБДДС.ДоговорКонтрагента,
	|	бит_ФормаВводаБюджетаБДДС.бит_БК_Организация
	|ИЗ
	|	Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-11-07 (#3102)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
	|		ПО бит_ФормаВводаБюджетаБДДС.Аналитика_1 = бит_ФормаВводаБюджета.Ссылка
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-11-07 (#3102)
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(&ДокументЗаполнения) = ТИП(Документ.ОперацияБух)
	|	И бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Контракт)
	|	И бит_ФормаВводаБюджетаБДДС.Аналитика_1 = &Заявка
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-11-07 (#3102)
	|	И бит_ФормаВводаБюджета.Ссылка = &Заявка
	|	И бит_ФормаВводаБюджета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-11-07 (#3102)
	|
	|УПОРЯДОЧИТЬ ПО
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-08 (#3141)
	//|	НомерСтроки"); 
	//Заменено на:
	|	Аналитика_2,
	|	Период,
	|	ЦФО,
	|	СтатьяОборотов,
	|   ЦенаБезНДС,
	|	СтавкаНДС,
	|	ЦенаСНДС");
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-08 (#3141)
	
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Начало 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13)
	Если ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗапросДляАвансовогоОтчета", 
		" ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	бит_ФормаВводаБюджета.Ссылка,
		|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка),
		|	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета КАК бит_ФормаВводаБюджета
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АвансовыйОтчет КАК АвансовыйОтчет
		|		ПО (бит_ФормаВводаБюджета.Ссылка = &Заявка
		|				И бит_ФормаВводаБюджета.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)
		|				И АвансовыйОтчет.Ссылка = &ДокументЗаполнения)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДляАвансовогоОтчета", "ИЛИ бит_ФормаВводаБюджетаБДДС.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный)");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ЗапросДляАвансовогоОтчета", "");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловиеДляАвансовогоОтчета", "");
	КонецЕсли;
	//ОКЕЙ Дмитриева В.В. (ПервыйБИТ) Конец 2021-06-03 (#ТП_БП05_ФР12, #ТП_БП05_ФР13)
	
	Запрос.УстановитьПараметр("Заявка"				, Заявка);
	Запрос.УстановитьПараметр("ДокументЗаполнения"	, ДокументЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДобавленнаяСтрока = ТаблицаАналитик.Добавить();
		ЗаполнитьЗначенияСвойств(ДобавленнаяСтрока,Выборка);
		ДобавленнаяСтрока.Выбор = Истина;
				
	КонецЦикла;
		
	Если НЕ Параметры.Свойство("ОтборПоКонтрагентуДоговору") ИЛИ
		 Заявка.ВидОперации <> ПредопределенноеЗначение("Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Инвестиционный")
	Тогда                                                                                                                      	
	
		Элементы.ГруппаОтбор.Видимость = Ложь;
		Элементы.ТаблицаАналитикГруппаКонтрагентДоговор.Видимость = Ложь;		
		
	КонецЕсли;
	
	Если Параметры.Свойство("ОтборОрганизация") Тогда 
		ОтборОрганизация = Параметры.ОтборОрганизация;
	КонецЕсли;	
	
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	Если Параметры.Свойство("ОднаСтрока") Тогда
		Если Параметры.ОднаСтрока Тогда
			Элементы.УстановитьВсеФлаги.Видимость = Ложь;
			Элементы.СнятьВсеФлаги.Видимость = Ложь;
			ОднаСтрока = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.бит_БюджетнаяОперация") Тогда
		Элементы.ФормаРаспределитьСуммуПоВыделеннымСтрокамПропорционально.Видимость = Ложь;
	ИначеЕсли ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		
	Иначе
		Элементы.Распределить.Видимость = Ложь;
	КонецЕсли;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-02-27 (#3247)
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Начало 2021-08-16 (#4289)
	//Если ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.бит_БюджетнаяОперация") Тогда 
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	//Если ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.бит_БюджетнаяОперация")
	//	Или ТипЗнч(ДокументЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	// ОКЕЙ Смирнов М.В. (СофтЛаб) Конец 2021-08-16 (#4289)
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	//	ДобавитьКомандуФормы("РаспределитьСуммуПоВыделеннымСтрокам", НСтр("ru = 'Сумма к распределению'"), "РаспределитьСуммуПоВыделеннымСтрокам");
	//	ВывестиКомандуНаФорму("КнопкаСуммаКРаспределению", "РаспределитьСуммуПоВыделеннымСтрокам", НСтр("ru = 'Сумма к распределению'"), Элементы.ФормаКоманднаяПанель);
	//КонецЕсли;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-02-27 (#3247)
		
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-11 (#3141)
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьИтогиПоСуммам();
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	Если ОднаСтрока Тогда
		УстановитьСнятьФлагиВыбора(Ложь);
	КонецЕсли;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийКомандФормы

//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
&НаКлиенте
Процедура РаспределитьСуммуПоВыделеннымСтрокамПоровну(Команда)
	
	РаспределитьСуммуПоВыделеннымСтрокам();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммуПоВыделеннымСтрокамПропорционально(Команда)
	
	РаспределитьСуммуПоВыделеннымСтрокам("Пропорционально");
	
КонецПроцедуры
//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)

&НаКлиенте
Процедура УстановитьВсеФлаги(Команда)
	
	УстановитьСнятьФлагиВыбора();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеФлаги(Команда)
	
	УстановитьСнятьФлагиВыбора(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура Перенести(Команда)
	
	Перем пАдресРезультата;
	
	пОтбор = Новый Структура("Выбор", Истина);	
	
	Если ТаблицаАналитик.НайтиСтроки(пОтбор).Количество()>0 Тогда 
				
		пАдресРезультата = ПолучитьАдресВременногоХранилищаДанныхЗаполнения(Этаформа.ВладелецФормы.УникальныйИдентификатор);
		
		ДобавитьЗаписьВРСДопАналитики(ДокументЗаполнения, Заявка);
		
	КонецЕсли;
	
	ЭтаФорма.Закрыть(пАдресРезультата);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОтборКонтрагентПриИзменении(Элемент)
	
	ОбновитьОтборТабЧасти();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборДоговорКонтрагентаПриИзменении(Элемент)
	
	ОбновитьОтборТабЧасти();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаАналитик

&НаКлиенте
Процедура ТаблицаАналитикПриИзменении(Элемент)
	ОбновитьИтогиПоСуммам();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикПроектПриИзменении(Элемент)
	
	ОбновитьИтогиПоСуммам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикСтавкаНДСПриИзменении(Элемент)
	РассчитатьСуммыСтроки();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаАналитикСуммаБезНДСПриИзменении(Элемент)
	РассчитатьСуммыСтроки();
КонецПроцедуры
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-11 (#3141)

//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
&НаКлиенте
Процедура ТаблицаАналитикВыборПриИзменении(Элемент)
	
	Если ОднаСтрока Тогда
		Для Каждого Стр Из ТаблицаАналитик Цикл
			Если Элементы.ТаблицаАналитик.ТекущаяСтрока <> Стр.ПолучитьИдентификатор() Тогда
				Стр.Выбор = Ложь;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-02-27 (#3247)
&НаКлиенте
//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
//Процедура РаспределитьСуммуПоВыделеннымСтрокам(Команда)
Процедура РаспределитьСуммуПоВыделеннымСтрокам(ВидРаспределения = "Поровну")
//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	//Алгоритм работы: Создать новую БО, указать документ-основание ФВБ. Нажать кнопку "Заполнить по заявке". 
	//Отметить несколько строк флажками, отредактировать их при необходимости. 
	//Нажать кнопку "Сумма к распределению" (добавить). Открывается диалог ввода суммы. Текст "Введите сумму для распределения между отмеченными строками". 
	//Сумма, указанная к распределению, равномерно распределяется между строками, отмеченными флагами. 
	//При этом учитывается ошибка округления и при необходимости в последней строке корректируется копейка.
	
	пОтбор = Новый Структура("Выбор", Истина);	
	
	ВыбранныеСтроки = ТаблицаАналитик.НайтиСтроки(пОтбор);
	
	Если ИтогСуммаБезНДС = 0 Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Не выбрано ни одной строки'"));
		Возврат;
	КонецЕсли;
	
	ДопПараметры = Новый Структура;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	//ДопПараметры.Вставить("СуммаДоРаспределения",	ИтогСуммаБезНДС);
	ДопПараметры.Вставить("ВидРаспределения",	ВидРаспределения);
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	ОповещениеПослеВводаСуммыРаспределения = Новый ОписаниеОповещения("ПослеВводаСуммыРаспределения", ЭтотОбъект, ДопПараметры);
	
	ПоказатьВводЧисла(ОповещениеПослеВводаСуммыРаспределения, ИтогСуммаБезНДС, НСтр("ru = 'Введите сумму для распределения между отмеченными строками'"), 15, 2);
	Модифицированность = Ложь;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеВводаСуммыРаспределения(СуммаРаспределения, ДопПараметры) Экспорт
	
	Модифицированность = Ложь;
	
	Если ТипЗнч(СуммаРаспределения) <> Тип("Число") ИЛИ
		 СуммаРаспределения = 0	
	Тогда 
		Возврат;
	КонецЕсли;
	
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-11-02 (#4415)
	//Если ДопПараметры.СуммаДоРаспределения = СуммаРаспределения Тогда 
	//	Возврат;
	//КонецЕсли;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-11-02 (#4415)
	
	пОтбор = Новый Структура("Выбор", Истина);	
	
	ВыбранныеСтроки = ТаблицаАналитик.НайтиСтроки(пОтбор);
	
	Если ВыбранныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	//Коэфф =  СуммаРаспределения/ДопПараметры.СуммаДоРаспределения;	
	Коэфф = 1/ВыбранныеСтроки.Количество();
	//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
	Если ДопПараметры.Свойство("ВидРаспределения") Тогда
		Если ДопПараметры.ВидРаспределения = "Пропорционально" Тогда
			СуммаВсехВыбранныхСтрок = 0;
			Для Каждого ТекСтрока Из ВыбранныеСтроки Цикл
				СуммаВсехВыбранныхСтрок = СуммаВсехВыбранныхСтрок + ТекСтрока.СуммаБезНДС;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
	
	СуммаБезНДС = 0;
	
	Для Каждого ТекСтрока Из ВыбранныеСтроки Цикл
				
		//ТекСтрока.СуммаБезНДС = ТекСтрока.СуммаБезНДС * Коэфф;
		//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-28 (#4415)
		Если ДопПараметры.Свойство("ВидРаспределения") Тогда
			Если ДопПараметры.ВидРаспределения = "Пропорционально" Тогда
				Коэфф = ?(СуммаВсехВыбранныхСтрок = 0, 0, ТекСтрока.СуммаБезНДС / СуммаВсехВыбранныхСтрок);
			КонецЕсли;
		КонецЕсли;
		//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-28 (#4415)
		ТекСтрока.СуммаБезНДС = СуммаРаспределения * Коэфф;
		СуммаБезНДС = СуммаБезНДС + ТекСтрока.СуммаБезНДС;
		
		ТекСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
												ТекСтрока.СуммаБезНДС,
												Ложь,
												УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС, Ложь));
												
		ТекСтрока.Сумма    = ТекСтрока.СуммаНДС + ТекСтрока.СуммаБезНДС;
				
	КонецЦикла;
	
	Разность = СуммаРаспределения - СуммаБезНДС;
	
	Если Разность<>0 Тогда 
		ТекСтрока.СуммаБезНДС = ТекСтрока.СуммаБезНДС + Разность;
		ТекСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
												ТекСтрока.СуммаБезНДС,
												Ложь,
												УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС, Ложь));
												
		ТекСтрока.Сумма    = ТекСтрока.СуммаНДС + ТекСтрока.СуммаБезНДС;

	КонецЕсли;	
	
	ОбновитьИтогиПоСуммам();
	
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-02-27 (#3247)

&НаКлиенте
Процедура УстановитьСнятьФлагиВыбора(ЗначениеФлага = Истина)
	
	Для Каждого Стр Из ТаблицаАналитик Цикл
		Если Элементы.ТаблицаАналитик.ПроверитьСтроку(Стр.ПолучитьИдентификатор()) Тогда 
			Стр.Выбор = ЗначениеФлага;	
		Иначе 
			Стр.Выбор = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	ОбновитьИтогиПоСуммам();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресВременногоХранилищаДанныхЗаполнения(УИДФормы)
	
	ПроектЗаполнения = ПредопределенноеЗначение("Справочник.Проекты.ПустаяСсылка");
	
	пТаблицаРезультат = ТаблицаАналитик.Выгрузить(Новый Структура("Выбор",Истина));
	       	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-01-09 (#3141)
	//Если пТаблицаРезультат.Количество()>0 Тогда 
	//	
	//	Если Заявка.ВидОперации = ПредопределенноеЗначение("Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Универсальный") Тогда 
	//		пНайденныеИнвест = пТаблицаРезультат.НайтиСтроки(Новый Структура("ВидСтатьи",ПредопределенноеЗначение("Справочник.бит_ВидыСтатейОборотов.ИнвестиционнаяДеятельность")));
	//		Если пНайденныеИнвест.Количество()>0 Тогда 
	//			ПроектЗаполнения = пНайденныеИнвест[0].ок_Проект;				
	//		КонецЕсли;
	//	Иначе
	//		ПроектЗаполнения = ТаблицаАналитик[0].ок_Проект;			
	//	КонецЕсли;
	//КонецЕсли;
	//Заменено на:
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2020-07-02 (#3759)
	//Если Заявка.БДДС.Количество()>0 Тогда 
	//	ПроектЗаполнения = Заявка.БДДС[0].Проект;
	//КонецЕсли;	
	//Заменено на:
	
	Если пТаблицаРезультат.НайтиСтроки(Новый Структура("ВидСтатьи",ПредопределенноеЗначение("Справочник.бит_ВидыСтатейОборотов.ИнвестиционнаяДеятельность"))).Количество()>0 Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	бит_ФормаВводаБюджетаБДДС.Проект КАК Проект
		|ИЗ
		|	Документ.бит_ФормаВводаБюджета.БДДС КАК бит_ФормаВводаБюджетаБДДС
		|ГДЕ
		|	бит_ФормаВводаБюджетаБДДС.Ссылка = &Заявка
		|	И бит_ФормаВводаБюджетаБДДС.Проект <> ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ФормаВводаБюджетаБДДС.НомерСтроки";
		
		Запрос.УстановитьПараметр("Заявка", Заявка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			ПроектЗаполнения = ВыборкаДетальныеЗаписи.Проект;
		КонецЕсли;   		
		
	КонецЕсли;  
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2020-07-02 (#3759)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-01-09 (#3141)
		
	Для Каждого пСтрока Из пТаблицаРезультат Цикл 
		Если пСтрока.ВидСтатьи = ПредопределенноеЗначение("Справочник.бит_ВидыСтатейОборотов.ИнвестиционнаяДеятельность") Тогда 
			пСтрока.ок_Проект = ПроектЗаполнения;
		КонецЕсли;
	КонецЦикла;				
	
	ДобавитьЗаписьВРСДопАналитики(ДокументЗаполнения, Заявка);
	
	Возврат ПоместитьВоВременноеХранилище(пТаблицаРезультат,УИДФормы);	
	
КонецФункции

&НаКлиенте
Процедура ОбновитьИтогиПоСуммам()
	
	мВыбранныеСтроки = ТаблицаАналитик.НайтиСтроки(Новый Структура("Выбор",Истина));
	
	пИтогСумма 		 = 0;
	пИтогСуммаБезНДС = 0;
	
	Для Каждого пВыбраннаяСтрока Из мВыбранныеСтроки Цикл 
		пИтогСумма = пИтогСумма + пВыбраннаяСтрока.Сумма;
		пИтогСуммаБезНДС = пИтогСуммаБезНДС + пВыбраннаяСтрока.СуммаБезНДС;
	КонецЦикла;
	
	ИтогСумма		= пИтогСумма;
	ИтогСуммаБезНДС = пИтогСуммаБезНДС;
		
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ДобавитьЗаписьВРСДопАналитики(ДокументЗаполнения, Заявка)
	
	ОписаниеТипаИзмерения = Метаданные.РегистрыСведений.бит_ДополнительныеАналитики.Измерения.Объект.Тип;
	Если Не ОписаниеТипаИзмерения.СодержитТип(ТипЗнч(ДокументЗаполнения)) Тогда 
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_НазначениеДополнительныхИзмерений.Аналитика КАК Аналитика
	|ИЗ
	|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК бит_НазначениеДополнительныхИзмерений
	|ГДЕ
	|	бит_НазначениеДополнительныхИзмерений.ИмяИзмерения = &ИмяИзмерения";
	
	Запрос.УстановитьПараметр("ИмяИзмерения", "Аналитика_1");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда 
			
		ЗаписьДопАналитик = РегистрыСведений.бит_ДополнительныеАналитики.СоздатьМенеджерЗаписи();
		ЗаписьДопАналитик.Объект			= ДокументЗаполнения;
		ЗаписьДопАналитик.ЗначениеАналитики = Заявка;
		ЗаписьДопАналитик.Аналитика 		= ВыборкаДетальныеЗаписи.Аналитика;
		
		ЗаписьДопАналитик.Прочитать();
		
		//СофтЛаб Начало 2018-10-09 3092
		//Если ЗаписьДопАналитик.Выбран() Тогда
		Если ЗаписьДопАналитик.Выбран() 
			И ЗаписьДопАналитик.ЗначениеАналитики = Заявка Тогда 
		//СофтЛаб Конец 2018-10-09 3092
			Возврат;
		КонецЕсли;
				
		ЗаписьДопАналитик.Объект			= ДокументЗаполнения;
		ЗаписьДопАналитик.ЗначениеАналитики = Заявка;
		ЗаписьДопАналитик.Аналитика 		= ВыборкаДетальныеЗаписи.Аналитика;
		
		Попытка
		
			ЗаписьДопАналитик.Записать();		
		
		Исключение
			
			пТекстОшибки = НСтр("ru = 'Не удалось добавить запись в РС для объекта %1 со значением аналитики %2 по причине: 
								|%3'");
			пТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(пТекстОшибки, ДокументЗаполнения,
																				  Заявка,
																				  ОписаниеОшибки());
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Заполнение ТЧ документа по упр. аналитикам'"), УровеньЖурналаРегистрации.Ошибка, Метаданные.РегистрыСведений.бит_ДополнительныеАналитики, ДокументЗаполнения, пТекстОшибки);
			
		КонецПопытки; 		
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборТабЧасти()
	
	стрОтбор = Новый Структура;
	
	Если ЗначениеЗаполнено(ОтборКонтрагент) Тогда
		стрОтбор.Вставить("ок_Контрагент"	,	ОтборКонтрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборДоговорКонтрагента) Тогда
		стрОтбор.Вставить("ок_ДоговорКонтрагента"	,	ОтборДоговорКонтрагента);
	КонецЕсли;
	
	Элементы.ТаблицаАналитик.ОтборСтрок = Новый ФиксированнаяСтруктура(стрОтбор);
		
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммыСтроки()
	
	ТекСтрока = ТаблицаАналитик.НайтиПоИдентификатору(Элементы.ТаблицаАналитик.ТекущаяСтрока);
	
	ТекСтрока.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(
												ТекСтрока.СуммаБезНДС,
												Ложь,
												УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(ТекСтрока.СтавкаНДС, Ложь));
												
	ТекСтрока.Сумма    = ТекСтрока.СуммаНДС + ТекСтрока.СуммаБезНДС;
												
КонецПроцедуры

//ОКЕЙ Василенко В.В. (СофтЛаб) Начало 2021-10-29 (#4415)
//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-02-27 (#3247)
//&НаСервере
//Процедура ДобавитьКомандуФормы(Имя, Заголовок, Действие)
//	
//	Если Команды.Найти(Имя) = Неопределено Тогда 
//		Команда = Команды.Добавить(Имя);
//		Команда.Заголовок 			   	   =  Заголовок;
//		Команда.Действие 				   = Действие;
//		Команда.ИзменяетСохраняемыеДанные  = Истина;
//	КонецЕсли;	
//	
//КонецПроцедуры

//&НаСервере
//Процедура ВывестиКомандуНаФорму(Имя, ИмяКоманды, Заголовок, Родитель, Картинка = Неопределено)
//	
//	Если Элементы.Найти(Имя) = Неопределено Тогда 	
//		Кнопка = Элементы.Добавить(Имя, Тип("КнопкаФормы"), Родитель);
//		Кнопка.ИмяКоманды = ИмяКоманды; 
//		Кнопка.Заголовок  = Заголовок;		
//		Если Картинка <> Неопределено Тогда           
//			Кнопка.Картинка = Картинка;
//		КонецЕсли;

//	КонецЕсли;
//	
//КонецПроцедуры
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-02-27 (#3247)
//ОКЕЙ Василенко В.В. (СофтЛаб) Конец 2021-10-29 (#4429)

#КонецОбласти
