
////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ 

// Хранит настройки дополнительных измерений
Перем мНастройкиИзмерений Экспорт;


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ - ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// бит_ASubbotina Процедура - обработчик события "ПриКомпоновкеРезультата" формы.
//
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	
	СписокПараметровНаФорме.Добавить("Период");
	СписокПараметровНаФорме.Добавить("Сценарий");
	СписокПараметровНаФорме.Добавить("СценарийЭталон");
	СписокПараметровНаФорме.Добавить("Периодичность");
	СписокПараметровНаФорме.Добавить("ОтображатьПустыеСтроки");

	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла;
															 
	//Если ЗначениеЗаполнено(Сценарий) Тогда
	//	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаСценария"));
	//    ЗначениеПараметра.Значение = Сценарий.Валюта;
	//    Если Не ЗначениеПараметра.Использование Тогда
	//        ЗначениеПараметра.Использование = Истина;
	//	КонецЕсли; 
	//КонецЕсли;
	//Если ЗначениеЗаполнено(СценарийЭталон) Тогда
	//	ЗначениеПараметра = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВалютаСценарияЭталон"));
	//    ЗначениеПараметра.Значение = СценарийЭталон.Валюта;
	//    Если Не ЗначениеПараметра.Использование Тогда
	//        ЗначениеПараметра.Использование = Истина;
	//    КонецЕсли;
	//КонецЕсли;														 
	
КонецПроцедуры // ПриКомпоновкеРезультата()

     
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, 
					"ОсновнойЗапрос", 
					мНастройкиИзмерений);