
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
	// Вызов механизма защиты
	 
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КоэффициентПриИзменении(Элемент)
	
	УстановитьКоэффициентУПодчиненных();

КонецПроцедуры

&НаСервере
Процедура УстановитьКоэффициентУПодчиненных()

	Выборка = Справочники.бит_СчетаБюджета.ВыбратьИерархически(Объект.Ссылка, Объект.Владелец);
	Пока Выборка.Следующий() Цикл
		
		СпрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		СпрОбъект.Коэффициент = Объект.Коэффициент;
		бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОбъект,,"Ошибки");
		
	КонецЦикла; 
	
КонецПроцедуры // УстановитьКоэффициентУПодчиненных()
          
#КонецОбласти

