
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ИмяВарианта = "ГруппировкаУниверсальная";
	
	ТекНастройки = КомпоновщикНастроек.ПолучитьНастройки();	
	
	Если ФВБ.ВидОперации <> ПредопределенноеЗначение("Перечисление.бит_БК_ВидыОперацийФормаВводаБюджета.Заявка_Универсальный") Тогда
			
		ИмяВарианта = "ГруппировкаИнвестОпер";
			
	КонецЕсли;
	
	СКД = Отчеты.ок_ОтчетПоБюджетуДляИнициатора.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	Настройки = СКД.ВариантыНастроек[ИмяВарианта].Настройки;
	
	КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "ФВБ", ФВБ, Истина); 	
	БухгалтерскиеОтчетыКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Дата", ФВБ.Дата, Истина); 	
			
	СтандартнаяОбработка = Ложь;
	
	ДокументРезультат.Очистить();
					
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки());
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
		
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	ДокументРезультат.ПоказатьУровеньГруппировокКолонок(0);
	
	ДокументРезультат.Автомасштаб = Истина;
	ДокументРезультат.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
КонецПроцедуры
