#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Процедура заполняет виды классов для предопределенных элементов.
// 
Процедура ЗаполнитьВидыКлассовДляПредопределенныхКлассовОС() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
    |	КлассыОС.Ссылка,
	|	КлассыОС.Наименование
    |ИЗ
    |	Справочник.бит_му_КлассыОсновныхСредств КАК КлассыОС
    |ГДЕ
    |	КлассыОС.Предопределенный = ИСТИНА
	|   И ВидКласса = ЗНАЧЕНИЕ(Перечисление.бит_му_ВидыКлассовОС.ПустаяСсылка)
	|";
	РезультатЗапроса = Запрос.Выполнить();	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СпрОб = Выборка.Ссылка.ПолучитьОбъект();
		
		СпрОб.ВидКласса = ?(Прав(Выборка.Наименование, 4) = "(ИС)" 
							, Перечисления.бит_му_ВидыКлассовОС.ИнвестиционнаяСобственность
							, Перечисления.бит_му_ВидыКлассовОС.ОсновныеСредства);
							
		бит_ОбщегоНазначения.ЗаписатьСправочник(СпрОб, , "Ошибки", Истина);
		
	КонецЦикла;     		

КонецПроцедуры // ЗаполнитьВидыКлассовДляПредопределенныхКлассовОС()

#КонецОбласти

#КонецЕсли