Функция ПолучитьПоследнийДокументПоСтроке(ИДСтроки, Кампания = Неопределено, Дата = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕСТЬNULL(ок_НачислениеАккруаловСоответствиеИДСтрокДокументуСрезПоследних.Документ, НЕОПРЕДЕЛЕНО) КАК Документ
		|ИЗ
		|	РегистрСведений.ок_НачислениеАккруаловСоответствиеИДСтрокДокументу.СрезПоследних(
		|			&Дата,
		|			ИДСтроки = &ИДСтроки
		|				И Кампания = &Кампания) КАК ок_НачислениеАккруаловСоответствиеИДСтрокДокументуСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", ?(Дата = Неопределено, Дата(1,1,1), Дата));
	Запрос.УстановитьПараметр("ИДСтроки", ИДСтроки);
	Если Кампания = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Кампания =  &Кампания","");
	Иначе
		Запрос.УстановитьПараметр("Кампания", Кампания);
	КонецЕсли; 
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Документ;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции