
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиСервер.ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если Параметры.Свойство("Алгоритм") Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.УстановитьОтборУСписка(Список.Отбор
																,Новый ПолеКомпоновкиДанных("Владелец")
																,Параметры.Алгоритм);
	
	КонецЕсли; 															
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти
