#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает имя обработки доставки.
//
// Параметры:
//  НастройкаДоставки	 - 	СправочникСсылка.бит_фн_НастройкиДоставкиОповещений - настройка доставки.
// 
// Возвращаемое значение:
//  Имя - Строка - имя объекта.
//
Функция ИмяОбработкиДоставки(НастройкаДоставки) Экспорт

    Имя = НастройкаДоставки.ОбработкаДоставки.ИмяОбъекта;
    
    Возврат Имя;
    
КонецФункции // ВидДоставки()

// Функция определяет использует ли данная настройка доставки через пуш уведомления.
//
// Параметры:
//  НастройкаДоставки	 - 	СправочникСсылка.бит_фн_НастройкиДоставкиОповещений - настройка доставки.
// 
// Возвращаемое значение:
//  флДоставкаЧерезПуш - Булево - флаг.
//
Функция ЭтоДоставкаЧерезПуш(НастройкаДоставки) Экспорт

    Имя = ИмяОбработкиДоставки(НастройкаДоставки);
    
    флДоставкаЧерезПуш = ?(Врег(Имя) = ВРег("бит_фн_ОбработкаДоставкиОповещенийПушУведомления"),Истина, Ложь);

    Возврат флДоставкаЧерезПуш;
    
КонецФункции // ЭтоДоставкаЧерезПуш()

// Функция определяет использует ли данная настройка доставки через Telegram.
//
// Параметры:
//  НастройкаДоставки	 - СправочникСсылка.бит_фн_НастройкиДоставкиОповещений	 - настройка доставки.
// 
// Возвращаемое значение:
//  флРез - Булево - результат.
//
Функция ЭтоДоставкаЧерезTelegram(НастройкаДоставки) Экспорт

    Имя = ИмяОбработкиДоставки(НастройкаДоставки);
    
    флРез = ?(Врег(Имя) = ВРег("бит_фн_ОбработкаДоставкиОповещенийTelegram"),Истина, Ложь);

    Возврат флРез;
    
КонецФункции // ЭтоДоставкаЧерезПуш()

//ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2019-05-13 (#3340)
	Функция ПолучитьЗначениеНастройки(НастройкаДоставки, ИмяНастройки) Экспорт
		Перем ЗначениеНастройки;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиДоставки.ЗначениеНастройки КАК ЗначениеНастройки
		|ИЗ
		|	Справочник.бит_фн_НастройкиДоставкиОповещений.НастройкиДоставки КАК НастройкиДоставки
		|ГДЕ
		|	НастройкиДоставки.Ссылка = &НастройкаДоставки
		|	И НастройкиДоставки.ИмяНастройки = &ИмяНастройки"
		;
		Запрос.УстановитьПараметр("НастройкаДоставки", НастройкаДоставки);
		Запрос.УстановитьПараметр("ИмяНастройки", ИмяНастройки);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.ЗначениеНастройки;
		КонецЕсли;
		
		Возврат ЗначениеНастройки;
		
	КонецФункции
	//ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2019-05-13 (#3340)

#КонецОбласти
 	
#КонецЕсли	