
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура формирует печатные формы объектов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//ПечатныйДокумент = СформироватьПечатнуюФормуПротоколРасчета(ИмяМакета, МассивСсылок);
	
	//1С-ИжТиСи, Кондратьев, 03.2020, обновление (
	//Запрос = Новый Запрос;
	//Запрос.Текст =
	//"ВЫБРАТЬ
	//|	рс_ПротоколыРасчета.ПротоколРасчета
	//|ИЗ
	//|	РегистрСведений.рс_ПротоколыРасчета КАК рс_ПротоколыРасчета
	//|ГДЕ
	//|	рс_ПротоколыРасчета.Регистратор В(&МассивСсылок)";
	//Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);
	//ТаблицаЗапрос = Запрос.Выполнить().Выгрузить();
	//
	//Если ТаблицаЗапрос.Количество() > 0 Тогда
	//	ПечатныйДокумент = ТаблицаЗапрос[0].ПротоколРасчета.Получить();
	//	Если ТипЗнч(ПечатныйДокумент) <> Тип("ТабличныйДокумент") Тогда
	//		ПечатныйДокумент = Новый ТабличныйДокумент;
	//		Возврат;
	//	КонецЕсли;
	//КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПротоколРасчета") Тогда					
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	рс_ПротоколыРасчета.ПротоколРасчета
		|ИЗ
		|	РегистрСведений.рс_ПротоколыРасчета КАК рс_ПротоколыРасчета
		|ГДЕ
		|	рс_ПротоколыРасчета.Регистратор В(&МассивСсылок)";
		Запрос.УстановитьПараметр("МассивСсылок", МассивОбъектов);
		ТаблицаЗапрос = Запрос.Выполнить().Выгрузить();
		
		Если ТаблицаЗапрос.Количество() > 0 Тогда
			ПечатныйДокумент = ТаблицаЗапрос[0].ПротоколРасчета.Получить();
			Если ТипЗнч(ПечатныйДокумент) <> Тип("ТабличныйДокумент") Тогда
				ПечатныйДокумент = Новый ТабличныйДокумент;
			КонецЕсли;
		КонецЕсли;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "ПротоколРасчета", НСтр("ru = 'Протокол расчета'"), 
			ПечатныйДокумент,,"Документ.рс_РаспределениеДоходовИРасходовЛогистики.ПротоколРасчета", НСтр("ru = 'Протокол расчета'"));
	КонецЕсли;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
	//1С-ИжТиСи, Кондратьев, 03.2020, обновление )

КонецПроцедуры // Печать()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ПолучитьТаблицуДокументов(МассивСсылок)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	*
	               |ИЗ
	               |	Документ." + ПустаяСсылка().Метаданные().Имя + " КАК Документы
	               |ГДЕ
	               |	Документы.Ссылка В(&МассивСсылок)";
	Запрос.Параметры.Вставить("МассивСсылок", МассивСсылок);
	Результат = Запрос.Выполнить();
	
	ТаблицаДокументов = Результат.Выгрузить();
	
	Возврат ТаблицаДокументов;
	
КонецФункции // ПолучитьТаблицуДокументов()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ТАБЛИЧНЫХ ДОКУМЕНТОВ
   
Функция СформироватьПечатнуюФормуПротоколРасчета(ИмяМакета, МассивСсылок) Экспорт

	ТабДок = Новый ТабличныйДокумент;
	ТабДок.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_рс_РаспределениеДоходовИРасходовЛогистики_ПротоколРасчета";  	
	
	// Таблица по документам
	ТаблицаДокументов = ПолучитьТаблицуДокументов(МассивСсылок);
	
	Если ТаблицаДокументов.Количество() > 0 Тогда
			
		// Таблица по табличной части
		ТаблицаДокументов = ПолучитьТаблицуДокументов(МассивСсылок);
		
		// Вывод результатов
		ПервыйДокумент   = Истина;
				
		Для каждого СтрДокумент Из ТаблицаДокументов Цикл
					
			//СофтЛаб Начало 2018-12-08 3096
			//// Текущий документ
			//ТекДокумент = СтрДокумент.Ссылка.ПолучитьОбъект();
			//СофтЛаб Конец 2018-12-08 3096
			
			ИмяМакета = "ПротоколРасчета";
			
			// Получаем макет и области
			Макет = Документы[ПустаяСсылка().Метаданные().Имя].ПолучитьМакет(ИмяМакета);
			ОбластьЗаголовок	= Макет.ПолучитьОбласть("Заголовок");
			ОбластьШапка		= Макет.ПолучитьОбласть("Шапка");
			ОбластьСтрока		= Макет.ПолучитьОбласть("Строка");
			ОбластьПодвал		= Макет.ПолучитьОбласть("Подвал");
			ОбластьИтоги		= Макет.ПолучитьОбласть("Итоги");
			
			// Rarus-spb byse 2012.12.29 {
			// Разделитель страниц
			//1С-ИжТиСи, Кондратьев, 27.03.2020, Обновление (
			//Попытка
			//	бит_ПечатьСервер.ВывестиГоризонтальныйРазделительСтраниц(ТабДок, ПервыйДокумент);
			//Исключение
			//1С-ИжТиСи, Кондратьев, 27.03.2020, Обновление )	
				Если Не ПервыйДокумент Тогда
					ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;  			
				ПервыйОбъект = Ложь;
			//1С-ИжТиСи, Кондратьев, 27.03.2020, Обновление (
			//КонецПопытки;
			//1С-ИжТиСи, Кондратьев, 27.03.2020, Обновление )
			// Rarus-spb byse 2012.12.29 }

			// Заполним общие для документа параметры
			ОбластьЗаголовок.Параметры.Заполнить(СтрДокумент);
			ОбластьЗаголовок.Параметры.Дата = Формат(СтрДокумент.Дата, "ДФ=dd.MM.yyyy");
			ОбластьШапка.Параметры.Заполнить(СтрДокумент);
			ОбластьПодвал.Параметры.Заполнить(СтрДокумент);
			
			// Выведем Заголовок и шапку
			ТабДок.Вывести(ОбластьЗаголовок);
			ТабДок.Вывести(ОбластьШапка);
			
			//СофтЛаб Начало 2018-12-08 3096
			//ТаблицаРасчета = ТекДокумент.ПолучитьТаблицуРасчета();
			ТаблицаРасчета = ПолучитьТаблицуРасчета(СтрДокумент.Ссылка);
			//СофтЛаб Конец 2018-12-08 3096
			
			Для Каждого ТекСтрока Из ТаблицаРасчета Цикл
				
				ОбластьСтрока.Параметры.Заполнить(ТекСтрока);
				// Выводим строки таблицы
				ТабДок.Вывести(ОбластьСтрока);
						
			КонецЦикла; 

			//// Выводим итоги и подвал
			ОбластьИтоги.Параметры.Сумма = ТаблицаРасчета.Итог("Сумма");
			ТабДок.Вывести(ОбластьИтоги);
			//ТабДок.Вывести(ОбластьПодвал);
			
		КонецЦикла;
	
	КонецЕсли;

	ТабДок.АвтоМасштаб = Истина;
	
    Возврат ТабДок;
	
КонецФункции // СформироватьПечатнуюФормуПротоколРасчета()

//СофтЛаб Начало 2018-12-08 3096
Функция ПолучитьТаблицуРасчета(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	рс_РаспределениеДоходовИРасходовЛогистикиБаза.Счет,
	|	рс_РаспределениеДоходовИРасходовЛогистикиБаза.Объект,
	|	рс_РаспределениеДоходовИРасходовЛогистикиБаза.ФункцияЦФО КАК Функция,
	|	рс_РаспределениеДоходовИРасходовЛогистикиБаза.Сумма
	|ИЗ
	|	Документ.рс_РаспределениеДоходовИРасходовЛогистики.База КАК рс_РаспределениеДоходовИРасходовЛогистикиБаза
	|ГДЕ
	|	рс_РаспределениеДоходовИРасходовЛогистикиБаза.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаЗапрос = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаЗапрос;
	
КонецФункции
//СофтЛаб Конец 2018-12-08 3096

//1С-ИжТиСи, Кондратьев, 03.2020, обновление (
// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
    // Протокол расчета.
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "ПротоколРасчета";
    КомандаПечати.Представление = НСтр("ru = 'Протокол расчета'");
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок       = 10;
	
КонецПроцедуры
//1С-ИжТиСи, Кондратьев, 03.2020, обновление )
