
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);

	ЭтоСемействоЕРП = бит_ОбщегоНазначения.ЭтоСемействоERP();
	
	ПодключитьСхемы(ЭтоСемействоЕРП);
	
	УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаУчетДоговоровВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура СхемаУчетФинДоговоровВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура СхемаУправлениеЗакупкамиВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");	
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма1","_Форма");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма2","_Форма");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
	
КонецПроцедуры	

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью элементов формы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП)
	
	Если ЭтоСемействоЕРП Тогда
		
		// Вкладка "Учет договоров"
		Элементы.Справочник_битchr95ШаблоныЗаполненияРеквизитов_ФормаСписка.Видимость = Ложь;
		Элементы.РегистрСведений_битchr95НазначениеШаблоновЗаполненияРеквизитов_ФормаСписка.Видимость = Ложь;
	    Элементы.Обработка_битchr95ФормированиеРасходныхДокументов_Форма.Видимость = Ложь;
		Элементы.Отчет_битchr95РеестрПроектовДоговоров_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95ИсполнениеДоговоров_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95ПланФактПоЗаявкамНаЗатраты_Форма.Видимость = Ложь;
		Элементы.Отчет_битchr95ОтчетПоПланируемымЗатратам_Форма.Видимость = Ложь;
		
		// Вкладка "Учет финансовых договоров"
		Элементы.ГруппаСтраницаУчетФинДоговоров.Видимость = Ложь;
		
		// Вкладка "Управление закупками"
		Элементы.ГруппаСтраницаУправлениеЗакупками.Видимость = Ложь;
		
	КонецЕсли; 	 
	
КонецПроцедуры // УправлениеВидимостьюЭлементов()

// Процедура подключает макеты-схемы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура ПодключитьСхемы(ЭтоСемействоЕРП)
	
	Если ЭтоСемействоЕРП Тогда
	 	// Устанавливаем графические схемы
		СхемаУчетДоговоров = Обработки.бит_ПанельФункций_ДоговорыИЗакупки.ПолучитьМакет("СхемаУчетДоговоров_ЕРП");
	Иначе	
	    // Устанавливаем графические схемы
		СхемаУчетДоговоров = Обработки.бит_ПанельФункций_ДоговорыИЗакупки.ПолучитьМакет("СхемаУчетДоговоров");
	КонецЕсли;
	
	// В ЕРП невидимы
	СхемаУчетФинДоговоров    = Обработки.бит_ПанельФункций_ДоговорыИЗакупки.ПолучитьМакет("СхемаУчетФинДоговоров");
	СхемаУправлениеЗакупками = Обработки.бит_ПанельФункций_ДоговорыИЗакупки.ПолучитьМакет("СхемаУправлениеЗакупками");
	
КонецПроцедуры// ПодключитьСхемы()

#КонецОбласти 