////////////////////////////////////////////////////////////////////////////////
// Переопределяемые процедуры, вызываемые из обработчиков форм, таких как:
// "ПриСозданииНаСервере", "ПриЧтенииНаСервере", "ПередЗаписьюНаСервере", 
// "ПослеЗаписи", а также при изменении некоторых реквизитов табличной части,
// таких как "Номенклатура", "Характеристика".
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ЗаполнениеОбработчиковФормы

// Переопределяемая процедура, вызываемая из одноименного обработчика события формы.
//
// Параметры:
//   Форма - форма, из обработчика события которой происходит вызов процедуры.
//  см. справочную информацию по событиям управляемой формы.
//
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	//ОКЕЙ Беднягин Е.А. (ПервыйБИТ) Начало 2021-04-03 (#НТП_БП06_ФР01, #НТП_БП06_ФР02)
	Если Форма.ИмяФормы= "Документ.КорректировкаДолга.Форма.ФормаДокумента" Тогда
		
		МассивДобавляемыхРеквизитов = Новый Массив;
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ок_ЭтоПереносЗадолженностиПоставщику", Новый ОписаниеТипов("Булево")));		
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы("ок_ФВБ", Новый ОписаниеТипов("ДокументСсылка.бит_ФормаВводаБюджета")));
		Форма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
		
		Форма.УстановитьДействие("ОбработкаВыбора", "Подключаемый_ОбработкаВыбора");
		Форма.Элементы.ТаблицаДебиторскаяЗадолженностьСделка.УстановитьДействие("ПриИзменении", "Подключаемый_ТаблицаДебиторскаяЗадолженностьСделкаПриИзменении");
		
		КомандаФормы = Форма.Команды.Добавить("ок_ПодборОстатковПоВзаиморасчетам");
		КомандаФормы.Действие = "Подключаемый_ПодборОстатковПоВзаиморасчетам";
		КомандаФормы.Заголовок = НСтр("ru = 'Подбор остатков по взаиморасчетам'");
		
		КнопкаФормы = Форма.Элементы.Добавить("ок_ПодборОстатковПоВзаиморасчетам", Тип("КнопкаФормы"), Форма.Элементы.ТаблицаКредиторскаяЗадолженностьЗаполнить);
		КнопкаФормы.ИмяКоманды = "ок_ПодборОстатковПоВзаиморасчетам";
	КонецЕсли;	
	//ОКЕЙ Беднягин Е.А. (ПервыйБИТ) Конец 2021-04-03 (#НТП_БП06_ФР01, #НТП_БП06_ФР02)

	//ОКЕЙ Первухин В.С. (ПервыйБИТ) Начало 2021-07-13 (ФР-МП-08)      
	Если Форма.ИмяФормы= "Обработка.СБ_ВыгрузкаБанковскихВыписокВAXAPTA.Форма.Форма" Тогда
		КомандаПодобратьСписокБанковскихВыписок 			=	Форма.Команды.Добавить("ок_ПодобратьСписокБанковскихВыписок");
		КомандаПодобратьСписокБанковскихВыписок.Действие 	=	"Подключаемый_ПодобратьСписокБанковскихВыписок";
		КомандаПодобратьСписокБанковскихВыписок.Заголовок	=	НСтр("ru = 'Подбор'");
		
		ЭлементПодобратьСписокБанковскихВыписок 			=	Форма.Элементы.Добавить("ок_ПодобратьСписокБанковскихВыписок", Тип("КнопкаФормы"), 
																	Форма.Элементы.СписокБанковскихВыписок.КоманднаяПанель);
		ЭлементПодобратьСписокБанковскихВыписок.Вид			=	ВидКнопкиФормы.ОбычнаяКнопка;
		ЭлементПодобратьСписокБанковскихВыписок.ИмяКоманды	=	"ок_ПодобратьСписокБанковскихВыписок";
	КонецЕсли;
	//ОКЕЙ Первухин В.С. (ПервыйБИТ) Конец 2021-07-13 (ФР-МП-08)

КонецПроцедуры

#КонецОбласти

#КонецОбласти


