
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ (Параметры.Свойство("Кампания")
		И Параметры.Свойство("ИДСтроки")) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не переданы параметры ""Кампания"" и ""ИД строки"". Откртыие формы прервано.");
		Отказ = Истина;
		Возврат;
		
	КонецЕсли; 
	
	ИсторияИЗмененийСтроки.Параметры.УстановитьЗначениеПараметра("Кампания", Параметры.Кампания);
	ИсторияИЗмененийСтроки.Параметры.УстановитьЗначениеПараметра("ИДСтроки", Параметры.ИДСтроки);
	
КонецПроцедуры
