&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// вызов механизма справочной информации
	//++ СВВ {[+](фрагмент добавлен), Сапожников Вадим 20.07.2015 9:34:36
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	//-- СВВ}Администратор 20.07.2015 9:34:36
	бит_си_ОбщегоНазначения.УстановитьПодменюСИ(ЭтаФорма, ЭтаФорма);
	//++ СВВ {[+](фрагмент добавлен), Администратор 20.07.2015 9:34:40
	#КонецЕсли
    УО = Список.УсловноеОформление;
	ЭО = УО.Элементы.Добавить();
	ЭлОтбора = ЭО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Группа");
	ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = "ПараметрыСоединенияSQL";
	ЭлОтбора.Использование = Истина;
	
	ЭлОтбора = ЭО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ИмяНастройки");
	ЭлОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлОтбора.ПравоеЗначение = "Пароль";
	ЭлОтбора.Использование = Истина;
	
	ЭО.Оформление.УстановитьЗначениеПараметра("Текст", "******");
	
	ПолеОформления = ЭО.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Значение");
	ПолеОформления.Использование = Истина;
	//-- СВВ}Сапожников Вадим 20.07.2015 9:34:40
КонецПроцедуры

// Процедура - обработчик события ""Нажатие"" кнопки ""ОткрытьСИ"" коммандной панели ""ДействияФормы"". 
// Открывает справку по данной форме.
//
&НаСервере
Процедура бит_си_ДействияФормыОткрытьСИ(Команда)
	
	бит_си_ОбщегоНазначения.ОткрытьСИ(Команда);
	
КонецПроцедуры
