
&НаСервере
Процедура ФормированиеСпискаПодразделений()
	
	Элементы.ДепартаментСтроит.СписокВыбора.Очистить();
	Элементы.ОтделПроектныхРеш.СписокВыбора.Очистить();
	Если Объект.ЗатратыФилиала Тогда
		///Берем только подразделения филиала
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_СоответствияАналитик.ПраваяАналитика_1 КАК ПодразделениеГоловнойОрганизации
		|ИЗ
		|	РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
		|ГДЕ
		|	бит_СоответствияАналитик.ВидСоответствия = &ВидСоответствия
		|	И бит_СоответствияАналитик.ЛеваяАналитика_1.Владелец = &Вл";
		Запрос.УстановитьПараметр("ВидСоответствия", Справочники.бит_ВидыСоответствийАналитик.ПодразделениеФилиала_ПодразделениеГоловнойОрганизации);
		Запрос.УстановитьПараметр("Вл", Объект.РаспределяемаяОрганизация);
		Выборка=Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Элементы.ДепартаментСтроит.СписокВыбора.Добавить(Выборка.ПодразделениеГоловнойОрганизации);
			Элементы.ОтделПроектныхРеш.СписокВыбора.Добавить(Выборка.ПодразделениеГоловнойОрганизации);
		КонецЦикла; 
	Иначе
		///Берем все подразделения организации, которые не имеют связи с подразделениями филиалов
		Выборка = Справочники.ПодразделенияОрганизаций.ВыбратьИерархически(, Объект.Организация);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	бит_СоответствияАналитик.ПраваяАналитика_1 КАК ПодразделениеГоловнойОрганизации
		|ИЗ
		|	РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
		|ГДЕ
		|	бит_СоответствияАналитик.ВидСоответствия = &ВидСоответствия
		|	И бит_СоответствияАналитик.ЛеваяАналитика_1.Владелец = &Вл";
		Запрос.УстановитьПараметр("ВидСоответствия", Справочники.бит_ВидыСоответствийАналитик.ПодразделениеФилиала_ПодразделениеГоловнойОрганизации);
		Запрос.УстановитьПараметр("Вл", Объект.Организация);
		МасНенужныхПодразделений = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ПодразделениеГоловнойОрганизации");
		Пока Выборка.Следующий() Цикл
			Если МасНенужныхПодразделений.Найти(Выборка.Ссылка) = Неопределено Тогда
				Элементы.ДепартаментСтроит.СписокВыбора.Добавить(Выборка.Ссылка);
				Элементы.ОтделПроектныхРеш.СписокВыбора.Добавить(Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ФормированиеСпискаФилиалов()
	
	Элементы.РаспределяемаяОрганизация.СписокВыбора.Очистить();
	ЗапросОрг = Новый Запрос;
	ЗапросОрг.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Организации.Ссылка КАК Организация
	|ИЗ
	|	Справочник.Организации КАК Организации
	|ГДЕ
	|	Организации.ГоловнаяОрганизация = &ГоловнаяОрганизация
	|	И Организации.Ссылка <> &ГоловнаяОрганизация";
	ЗапросОрг.УстановитьПараметр("ГоловнаяОрганизация", Объект.Организация);
	МассивОрганизаций = ЗапросОрг.Выполнить().Выгрузить().ВыгрузитьКолонку("Организация");
	Элементы.РаспределяемаяОрганизация.СписокВыбора.ЗагрузитьЗначения(МассивОрганизаций);
		
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныйПриИзменении(Элемент)
	
	Объект.Организация = ОбщегоНазначенияБПВызовСервера.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация", Объект.Ответственный);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора_ = Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора_, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = РезультатВыбора.КонецПериода;

КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Объект.РаспределяемаяОрганизация = "";
    Объект.ДепартаментСтроит = ""; 					
	Объект.ОтделПроектныхРеш = "";
	ФормированиеСпискаПодразделений();
	ФормированиеСпискаФилиалов();
	ДоступностьОрганизацииФилиала();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ВыдаватьСообщение = Ложь;                                    // хотя скорее всего достаточно просто сообщить
	Строка = "";                                                 // о не проведении.
	Если Объект.Ответственный = ПредопределенноеЗначение("Справочник.Пользователи.ПустаяСсылка") Тогда
		Строка = " Ответственный";
		ВыдаватьСообщение = Истина;
	КонецЕсли; 
	Если Объект.ДатаНачала = '00010101000000' ИЛИ Объект.ДатаОкончания = '00010101000000' Тогда
		Строка = Строка + " , период";
		ВыдаватьСообщение = Истина;
	КонецЕсли;
	Если Объект.Организация = ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка") Тогда
		ВыдаватьСообщение = Истина;
		Строка = Строка +" ,организация";
	КонецЕсли;
	Если Объект.ДепартаментСтроит = ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка") Тогда
		Строка = Строка+" , департамент строительства";
	    ВыдаватьСообщение = Истина;
	КонецЕсли;
	//Если  ОтделПроектныхРеш = Справочники.ПодразделенияОрганизаций.ПустаяСсылка() Тогда
	//	Строка = Строка+" ,отдел проектных решений";
	//	сч=1;
	//КонецЕсли;

	Если ВыдаватьСообщение Тогда
		Сообщить("Для проведения нужно заполнить недостающие поля:" + Строка); 
		ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Запись;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДоступностьОрганизацииФилиала()
	
	Элементы.РаспределяемаяОрганизация.Доступность = Объект.ЗатратыФилиала;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗатратыФилиалаПриИзменении(Элемент)
	
	ДоступностьОрганизацииФилиала();
	Если Не Объект.ЗатратыФилиала тогда
		Объект.РаспределяемаяОрганизация = "";
		Объект.ДепартаментСтроит = ""; 					
		Объект.ОтделПроектныхРеш = "";
		ФормированиеСпискаПодразделений();
		ФормированиеСпискаФилиалов();
		ДоступностьОрганизацииФилиала();	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределяемаяОрганизацияПриИзменении(Элемент)
	
	Объект.ДепартаментСтроит = ""; 					
	Объект.ОтделПроектныхРеш = "";
	ФормированиеСпискаПодразделений();
	ФормированиеСпискаФилиалов();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ДополнительныеОтчетыИОбработки
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец ДополнительныеОтчетыИОбработки

	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
		Объект.Организация = ОбщегоНазначенияБПВызовСервера.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация", Объект.Ответственный);
		Объект.РаспрДепартаментаСтроит = Истина;
		Объект.РаспрПроектныхРешений = Истина;
		Объект.РаспрЭксплуатации = Истина;
	КонецЕсли;
	ФормированиеСпискаПодразделений();
	ФормированиеСпискаФилиалов();
	ДоступностьОрганизацииФилиала();
	
КонецПроцедуры



