
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.Обработки.бит_фн_ОбработкаДоставкиОповещенийЭлПочта;
	
	// Вызов механизма защиты
	
	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2020-03-16 (#3669)
	ок_УправлениеФормами.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2020-03-16 (#3669)
	
	Если Параметры.Свойство("НастройкиДоставки") Тогда
	
		 Для каждого КиЗ Из Параметры.НастройкиДоставки Цикл
		 
		 	 ИмяРеквизита = "Настройка_"+КиЗ.Ключ;
			 Объект[ИмяРеквизита] = КиЗ.Значение;
		 
		 КонецЦикла; 
	
	КонецЕсли; 
	
	Если НЕ ЗначениеЗаполнено(Объект.Настройка_КодировкаСообщения) Тогда
		Объект.Настройка_КодировкаСообщения = "windows-1251";
	КонецЕсли;
	
	Элементы.Настройка_SMTPАутентификация.СписокВыбора.Добавить("БезАутентификации");
    Элементы.Настройка_SMTPАутентификация.СписокВыбора.Добавить("Default");	
	Элементы.Настройка_SMTPАутентификация.СписокВыбора.Добавить("Plain");
	Элементы.Настройка_SMTPАутентификация.СписокВыбора.Добавить("Login");
	Элементы.Настройка_SMTPАутентификация.СписокВыбора.Добавить("CramMD5");
	
	Элементы.Настройка_POPАутентификация.СписокВыбора.Добавить("Обычная");
	Элементы.Настройка_POPАутентификация.СписокВыбора.Добавить("APOP");
	Элементы.Настройка_POPАутентификация.СписокВыбора.Добавить("CramMD5");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоКнопкеОК(Команда)
	
	флНетОшибок = ПроверитьЗаполнение();
	
	Если флНетОшибок Тогда
		
		НастройкиДоставки = ОК_Сервер();
		ОповеститьОВыборе(НастройкиДоставки);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура получате структуру настройки доставки.
// 
&НаСервере
Функция ОК_Сервер()
	
	ОбработкаОбъект   = ДанныеФормыВЗначение(Объект,Тип("ОбработкаОбъект.бит_фн_ОбработкаДоставкиОповещенийЭлПочта"));
	НастройкиДоставки = бит_фн_ОповещенияСервер.ПолучитьСтруктуруНастроекДоставки(ОбработкаОбъект);

	Возврат НастройкиДоставки;
	
КонецФункции // ОК_Сервер()

#КонецОбласти
