
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос	= Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ГраницыЗапретаИзмененияДанных.Организация КАК Организация,
		|	ГраницыЗапретаИзмененияДанных.ДатаЗапрета КАК ГраницаЗапретаИзменений
		|ИЗ
		|	РегистрСведений.бит_ДатыЗапретаРедактирования КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	ГраницыЗапретаИзмененияДанных.Организация = &Организация";
	
	Организация_Окей = бит_БК_Общий.ПолучитьЗначениеНастройкиМеханизмаИмпортаДанных("Организации", "Организация ОКЕЙ"); 
	Запрос.УстановитьПараметр("Организация", Организация_Окей);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	ДатаОтбора = Дата(1, 1, 1);
	ПолеКомпоновкиДата = Новый ПолеКомпоновкиДанных("Дата");
	
	Если Выборка.Следующий() Тогда 
		
		ДатаЗапретаРедактирования = Выборка.ГраницаЗапретаИзменений;
		Для Каждого ЭлементОтбора Из Список.Отбор.Элементы Цикл
			Если ЭлементОтбора.ЛевоеЗначение = ПолеКомпоновкиДата Тогда
				ДатаОтбора = ЭлементОтбора.ПравоеЗначение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если ДатаОтбора < ДатаЗапретаРедактирования Тогда 
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Дата", ДатаЗапретаРедактирования, ВидСравненияКомпоновкиДанных.Больше,,Истина);
		КонецЕсли;
		
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	Элементы.ок_НеНайденКонтракт.Видимость   = Ложь;
	Элементы.ок_НеНайденКонтракт.Доступность = Ложь;	
	
	Если УправлениеДоступом.ЕстьРоль("бит_БК_ГлавныйБК") Тогда 
		
		Элементы.ок_НеНайденКонтракт.Видимость   = Истина;
		Элементы.ок_НеНайденКонтракт.Доступность = Истина;			

		НоваяКоманда = Команды.Добавить("ок_ТранслироватьВБК");
		НоваяКоманда.Действие  = "ТранслироватьВБККоманда";
		НоваяКоманда.Заголовок = "Транслировать в БК";
		НоваяКоманда.Подсказка = "Транслировать выделенные документы в БК";
		
		НоваяКнопка = Элементы.Добавить("ТранслироватьВБК", Тип("КнопкаФормы"), Элементы.ГруппаКоманднаяПанель);
		НоваяКнопка.ИмяКоманды = "ок_ТранслироватьВБК";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Возврат;
	
КонецПроцедуры

&НаСервере
Функция ТипДокументаПриИзменении_Сервер()
	
	Если ЗначениеЗаполнено(ТипДокумента) Тогда 
		ТипДокументаИспользование	= Истина;
	Иначе 
		ТипДокументаИспользование	= Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипДокумента", ТипДокумента, ВидСравненияКомпоновкиДанных.Равно,,ТипДокументаИспользование);
	
КонецФункции

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	
	ТипДокументаПриИзменении_Сервер();
	
КонецПроцедуры

&НаСервере
Функция ВаучерПриИзменении_Сервер()
	
	Если ЗначениеЗаполнено(Ваучер) Тогда 
		ВаучерИспользование	= Истина;
	Иначе 
		ВаучерИспользование	= Ложь;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ваучер", Ваучер, ВидСравненияКомпоновкиДанных.Равно,,ВаучерИспользование);
	
КонецФункции

&НаКлиенте
Процедура ВаучерПриИзменении(Элемент)
	
	ВаучерПриИзменении_Сервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеВаучерПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Ваучер", Ваучер, ВидСравненияКомпоновкиДанных.Равно,,ВаучерИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура ИспользованиеТипДокументаПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ТипДокумента", ТипДокумента, ВидСравненияКомпоновкиДанных.Равно,,ТипДокументаИспользование);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ок_УправлениеФормамиКлиент.ОбновлениеКомандПриАктивацииСтрокиВФормеСписка(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ТранслироватьВБККоманда(Команда)
	
	Если Элементы.Список.ВыделенныеСтроки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТранслироватьВБКНаСервере(Элементы.Список.ВыделенныеСтроки) Тогда
		
		Элементы.Список.Обновить(); // чтобы обновить признаки "Не найден контракт" в форме списка
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТранслироватьВБКНаСервере(Знач ВыделенныеСтроки)	
	
	Возврат Документы.бит_ок_ОперацияАксапты12.ТранслироватьВБК(ВыделенныеСтроки);
	
КонецФункции
