
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипОбъекта		 = Параметры.ТипОбъекта;
	НаименованиеОбъекта	 = Параметры.НаименованиеОбъекта;
	НаименованиеМакета	 = Параметры.НаименованиеМакета;
	НаименованиеОбласти	 = Параметры.НаименованиеОбласти;
	ЗакрыватьПриВыборе = Ложь;
	
	Если ТипОбъекта = "Документ" Тогда
		ПараметрыВыбораДляКода = Документы[НаименованиеОбъекта].ПолучитьПараметрыФормыВыбораДляКода(НаименованиеМакета, ТекущаяДата(), НаименованиеОбласти);
	Иначе
		Отказ	= Истина;
		Возврат;
	КонецЕсли;
	
	ДлинаНаименования	= 0;
	Для каждого СтрокаКода Из ПараметрыВыбораДляКода.СписокКодов Цикл
		ДлинаНаименования	= Макс(ДлинаНаименования, СтрДлина(СтрокаКода.Наименование));
	КонецЦикла;
	
	Если ДлинаНаименования > 100 Тогда
		Элементы.ТаблицаДанныхНаименование.МногострочныйРежим	= Истина;
	КонецЕсли;
	
	ТаблицаДанных.Загрузить(ПараметрыВыбораДляКода.СписокКодов);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаДанных

&НаКлиенте
Процедура ТаблицаДанныхВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	ВыбраннаяСтрока = Элементы.ТаблицаДанных.ТекущиеДанные;
	
	Если НЕ ВыбраннаяСтрока = Неопределено И НЕ ПустаяСтрока(ВыбраннаяСтрока.Код) Тогда
		Закрыть(ВыбраннаяСтрока.Код);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

