
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Шаблон = Параметры.Шаблон;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДиапазонДобавить(Команда)
	
	ДобавитьТекст("[" + ДиапазонСодержит + "]");
	ДиапазонСодержит = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПроизвольныйСимвол(Команда)
	ДобавитьТекст("_");
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	Закрыть(Шаблон);
КонецПроцедуры

&НаКлиенте
Процедура НеДиапазонДобавить(Команда)
	
	ДобавитьТекст("[^" + ДиапазонНеСодержит + "]");
	ДиапазонНеСодержит = "";
	
КонецПроцедуры

&НаКлиенте
Процедура СловоДобавить(Команда)
	
	ДобавитьТекст("%" + Слово + "%");
	Слово = "";
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИ(Команда)
	ДобавитьТекст("&");
КонецПроцедуры

&НаКлиенте
Процедура КомандаИЛИ(Команда)
	ДобавитьТекст("~");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобка1(Команда)
	ДобавитьТекст("{");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобка2(Команда)
	ДобавитьТекст("}");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьШаблонПоТексту(Команда)
	
	УсловиеВыполнено = ПроверитьШаблонПоТекстуСервер(Шаблон, ПроверочныйТекст);
	
	Если УсловиеВыполнено Тогда
		ТекстСообщения = Нстр("ru = 'Текст пройден.'"); 
	Иначе	
		ТекстСообщения = Нстр("ru = 'Текст не пройден.'"); 
	КонецЕсли; 
	
	ПоказатьПредупреждение(, ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура окончание процедуры вставки текста. 
//
// Параметры:
//  РезультатВыбора - Структура.
//  ДополнительныеПараметры - Структура.
//
&НаКлиенте 
Процедура ВставитьТекстЗавершение(РезультатВыбора, Текст) Экспорт
	
	Элементы.Шаблон.ВыделенныйТекст = Текст;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТекст(Текст)

	Элементы.Шаблон.ВыделенныйТекст = Текст;
	ЭтаФорма.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьШаблонПоТекстуСервер(Шаблон, ПроверочныйТекст)

	Запрос = Новый Запрос;
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	1 КАК Поле
	|ГДЕ
	|	&УсловияШаблона";
	
	Маска                 = СтрЗаменить(Шаблон, """", """"""); 
	МаскаПроверочныйТекст = СтрЗаменить(ПроверочныйТекст, """", """"""); 
	УсловиеВыполнено      = бит_МеханизмДопИзмерений.УсловиеШаблонаНазначенияПлатежаВыполнено(Маска, Запрос, ТекстЗапроса, """"+МаскаПроверочныйТекст+"""");
	
	Возврат УсловиеВыполнено;
	
КонецФункции

#КонецОбласти