Перем Счета Экспорт;
Перем ОграниченныйСписок Экспорт;

//+СБ ПискуноваВ 15.06.2016 #2366 Изменились требования к заполнению документа, процедуру полностью перенесла в бэкап
Процедура ЗаполнитьДанныеБэкап(СписокИспользумеых) Экспорт
	
	// BIT AMerkulov 18.10.2015 ++	
	// Изменен текст запроса для заполнения видов расчета
	// BIT AMerkulov 18.10.2015 --		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Подзапрос.Контрагент,
	               |	Подзапрос.КонтрагентНаименование КАК КонтрагентНаименование,
	               |	Подзапрос.Договор,
	               |	Подзапрос.ДокументРасчетов,
	               |	Подзапрос.ОтветственныйЗаДоговор,
	               |	Подзапрос.ПредметДоговора,
	               |	Подзапрос.СуммаЗадолженности,
	               |	Подзапрос.СрокИсполненияВзаиморасчеты,
	               |	Подзапрос.Счет,
	               |	Подзапрос.СрокИсполнения,
	               |	Подзапрос.ИНН,
	               |	Подзапрос.ДатаВозникновенияЗадолженности,
	               |	ВЫБОР
	               |		КОГДА Подзапрос.СрокИсполнения < &ПериодСрокИсполнения
	               |			ТОГДА РАЗНОСТЬДАТ(ВЫРАЗИТЬ(Подзапрос.СрокИсполнения КАК ДАТА), &ПериодСрокИсполнения, ДЕНЬ)
	               |		ИНАЧЕ ""-""
	               |	КОНЕЦ КАК ДнейПросрочки,
	               |	Подзапрос.ПлатежноеПоручение КАК ПлатежноеПоручение,
				   |	Подзапрос.ВидРасчета

	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	               |		ХозрасчетныйОстатки.Субконто1.Наименование КАК КонтрагентНаименование,
	               |		ХозрасчетныйОстатки.Субконто2 КАК Договор,
	               |		ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
	               |		Ответственные.Значение КАК ОтветственныйЗаДоговор,
	               |		ПредметДоговора.Значение КАК ПредметДоговора,
	               |		ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаЗадолженности,
	               |		ПрДатаОстатки.Значение КАК СрокИсполненияВзаиморасчеты,
	               |		ПрДата.Значение КАК СрокИсполненияПП,
	               |		ХозрасчетныйОстатки.Счет КАК Счет,
	               |		ВЫБОР
	               |			КОГДА ПрДатаОстатки.Значение ЕСТЬ NULL 
	               |				ТОГДА ПрДата.Значение
	               |			ИНАЧЕ ПрДатаОстатки.Значение
	               |		КОНЕЦ КАК СрокИсполнения,
	               |		ХозрасчетныйОстатки.Субконто1.ИНН КАК ИНН,
	               |		ВЫБОР
	               |			КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	               |				ТОГДА ВЫБОР
	               |						КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))) <> """"
	               |							ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))
	               |						ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	               |					КОНЕЦ
	               |			КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.СписаниеСРасчетногоСчета
	               |				ТОГДА ВЫБОР
	               |						КОГДА ХозрасчетныйОстатки.Субконто3.ДокументОснование = НЕОПРЕДЕЛЕНО
	               |							ТОГДА ХозрасчетныйОстатки.Субконто3
	               |						ИНАЧЕ ХозрасчетныйОстатки.Субконто3.ДокументОснование
	               |					КОНЕЦ
	               |			ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	               |		КОНЕЦ КАК ПлатежноеПоручение,
	               |		ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаВозникновенияЗадолженности,
	               |		ВидыРасчета.ВидРасчета КАК ВидРасчета
				   
	               |	ИЗ
	               |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация) КАК ХозрасчетныйОстатки
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ДополнительныеСведения.Объект КАК Объект,
	               |				ДополнительныеСведения.Значение КАК Значение
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |			ГДЕ
	               |				ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	               |				И ДополнительныеСведения.Свойство = &Ответственный) КАК Ответственные
	               |			ПО ХозрасчетныйОстатки.Субконто2 = Ответственные.Объект
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ДополнительныеСведения.Объект КАК Объект,
	               |				ДополнительныеСведения.Значение КАК Значение
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |			ГДЕ
	               |				ДополнительныеСведения.Свойство.Наименование ПОДОБНО ""Срок исполнения"") КАК ПрДата
	               |			ПО ХозрасчетныйОстатки.Субконто3.ДокументОснование = ПрДата.Объект
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ДополнительныеСведения.Значение КАК Значение,
	               |				ДополнительныеСведения.Объект КАК Объект
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |			ГДЕ                
	               |				ДополнительныеСведения.Свойство.Наименование ПОДОБНО ""Срок исполнения"") КАК ПрДатаОстатки
	               |			ПО ХозрасчетныйОстатки.Субконто3 = ПрДатаОстатки.Объект
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				ДополнительныеСведения.Объект КАК Объект,
	               |				ДополнительныеСведения.Значение КАК Значение
	               |			ИЗ
	               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	               |			ГДЕ
	               |				ДополнительныеСведения.Свойство = &ПредметДоговора
	               |				И ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов) КАК ПредметДоговора
	               |			ПО ХозрасчетныйОстатки.Субконто2 = ПредметДоговора.Объект
				   
				   
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				МАКСИМУМ(УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета) КАК ВидРасчета
	               |			ИЗ
	               |				РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, ) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента) КАК ВидыРасчета
				   
	               |			ПО ХозрасчетныйОстатки.Субконто2 = ПредметДоговора.Объект) КАК Подзапрос
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтрагентНаименование";
				   
				   
	Граница = Новый Граница(КонецМесяца(ПериодФормирования), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодСрокИсполнения", КонецДня(ПериодФормирования));		//Бит_Егоров: Граница.Значение);
	Запрос.УстановитьПараметр("Период", 			Граница);
	Запрос.УстановитьПараметр("Счет", 				СписокИспользумеых);
	Запрос.УстановитьПараметр("Ответственный", 		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ответственный за договор"));
	Запрос.УстановитьПараметр("ПредметДоговора", 	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Предмет договора"));
	
	// BIT AMerkulov 18.10.2015 ++	
	Граница = Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("Дата", Граница.Значение);
	// BIT AMerkulov 18.10.2015 --			
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	// BIT AMerkulov 18.10.2015 ++	
	// Изменен текст запроса для заполнения видов расчета
	// BIT AMerkulov 18.10.2015 --	
	
	//+ СБ Прудникова 22.12.2011
	// заполним дополнительные колонки
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗРезультат.Контрагент,
	               |	ТЗРезультат.Договор,
	               |	ТЗРезультат.ДокументРасчетов,
	               |	ТЗРезультат.ОтветственныйЗаДоговор,
	               |	ТЗРезультат.ПредметДоговора,
	               |	ТЗРезультат.СуммаЗадолженности,
	               |	ТЗРезультат.Счет,
	               |	ЕСТЬNULL(ТЗРезультат.СрокИсполненияВзаиморасчеты, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокИсполненияВзаиморасчеты,
	               |	ЕСТЬNULL(ТЗРезультат.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокИсполнения,
	               |	ЕСТЬNULL(ТЗРезультат.ДатаВозникновенияЗадолженности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновенияЗадолженности,
	               |	ТЗРезультат.ДнейПросрочки,
	               |	ТЗРезультат.ПлатежноеПоручение КАК ПлатежноеПоручение
	               |ПОМЕСТИТЬ ТЗ
	               |ИЗ
	               |	&ТЗРезультат КАК ТЗРезультат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Контрагент,
	               |	ТЗ.Договор,
	               |	ТЗ.ДокументРасчетов,
	               |	ТЗ.ОтветственныйЗаДоговор,
	               |	ТЗ.ПредметДоговора,
	               |	ТЗ.СуммаЗадолженности,
	               |	ТЗ.Счет,
	               |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.СрокИсполненияВзаиморасчеты КАК ДАТА), ДЕНЬ) КАК СрокИсполненияВзаиморасчеты,
	               |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.СрокИсполнения КАК ДАТА), ДЕНЬ) КАК СрокИсполнения,
	               |	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.ДатаВозникновенияЗадолженности КАК ДАТА), ДЕНЬ) КАК ДатаВозникновенияЗадолженности,
	               |	ВЫБОР
	               |		КОГДА ТЗ.ДнейПросрочки = ""-""
	               |			ТОГДА 0
	               |		ИНАЧЕ ТЗ.ДнейПросрочки
	               |	КОНЕЦ КАК ДнейПросрочки,
	               |	ТЗ.ПлатежноеПоручение КАК ПлатежноеПоручение,
	               |	ВЫБОР
	               |		КОГДА ТЗ.ДнейПросрочки = ""-""
	               |			ТОГДА 0
	               |		КОГДА ТЗ.ДнейПросрочки > 365 * 3
	               |			ТОГДА 100
	               |		КОГДА ТЗ.ДнейПросрочки > 365 * 2
	               |			ТОГДА 75
	               |		КОГДА ТЗ.ДнейПросрочки > 365
	               |			ТОГДА 40
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентСписания
	               |ПОМЕСТИТЬ ДанныеСПроцентом
	               |ИЗ
	               |	ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТЗ.Контрагент,
	               |	ТЗ.Договор,
	               |	ТЗ.ДокументРасчетов,
	               |	ТЗ.ОтветственныйЗаДоговор,
	               |	ТЗ.ПредметДоговора,
	               |	ТЗ.СуммаЗадолженности,
	               |	ТЗ.СрокИсполненияВзаиморасчеты,
	               |	ТЗ.Счет,
	               |	ТЗ.СрокИсполнения,
	               |	ТЗ.ДатаВозникновенияЗадолженности,
	               |	ТЗ.ДнейПросрочки,
	               |	ТЗ.ПлатежноеПоручение КАК ПлатежноеПоручение,
	               |	ТЗ.НачислятьРезерв,
	               |	ТЗ.СчетМСФО,
	               |	ТЗ.ПроцентСписания,
	               |	ТЗ.СуммаСписания,
	               |	ТЗ.БИТ_НачислятьРезерв
	               |ПОМЕСТИТЬ ПредыдущийДок
	               |ИЗ
	               |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ.Данные КАК ТЗ
	               |ГДЕ
	               |	ТЗ.Ссылка В
	               |			(ВЫБРАТЬ ПЕРВЫЕ 1
	               |				ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка
	               |			ИЗ
	               |				Документ.ОК_НачислениеРезерваПодОбесценениеДЗ КАК ОК_НачислениеРезерваПодОбесценениеДЗ
	               |			ГДЕ
	               |				ОК_НачислениеРезерваПодОбесценениеДЗ.Проведен
	               |				И ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка <> &Ссылка
	               |				И ОК_НачислениеРезерваПодОбесценениеДЗ.Организация = &Организация
	               |				И ОК_НачислениеРезерваПодОбесценениеДЗ.Дата < &Период
	               |			УПОРЯДОЧИТЬ ПО
	               |				ОК_НачислениеРезерваПодОбесценениеДЗ.Дата УБЫВ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеСПроцентом.Контрагент,
	               |	ДанныеСПроцентом.Договор,
	               |	ДанныеСПроцентом.ДокументРасчетов,
	               |	ДанныеСПроцентом.ОтветственныйЗаДоговор,
	               |	ДанныеСПроцентом.ПредметДоговора,
	               |	ДанныеСПроцентом.СуммаЗадолженности КАК СуммаЗадолженности,
	               |	ДанныеСПроцентом.СрокИсполненияВзаиморасчеты,
	               |	ДанныеСПроцентом.Счет,
	               |	ДанныеСПроцентом.СрокИсполнения,
	               |	ДанныеСПроцентом.ДатаВозникновенияЗадолженности,
	               |	ДанныеСПроцентом.ДнейПросрочки,
	               |	ДанныеСПроцентом.ПлатежноеПоручение КАК ПлатежноеПоручение,
	               |	ДанныеСПроцентом.ПроцентСписания КАК ПроцентСписания,
	               |	ДанныеСПроцентом.СуммаЗадолженности * ДанныеСПроцентом.ПроцентСписания / 100 КАК СуммаСписания,
	               |	ВЫБОР
	               |		КОГДА ДанныеСПроцентом.СуммаЗадолженности * ДанныеСПроцентом.ПроцентСписания > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НачислятьРезерв,
	               |	ЕСТЬNULL(бит_СоответствияАналитик.ПраваяАналитика_1, ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)) КАК СчетМСФО,
	               |	ВЫБОР
	               |		КОГДА НЕ бит_СоответствияАналитик.ПраваяАналитика_1 = ЗНАЧЕНИЕ(ПланСчетов.БИТ_Дополнительный_2.ПустаяСсылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Порядок
	               |ПОМЕСТИТЬ ТекущийДок
	               |ИЗ
	               |	ДанныеСПроцентом КАК ДанныеСПроцентом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
	               |		ПО ДанныеСПроцентом.Счет = бит_СоответствияАналитик.ЛеваяАналитика_1
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-04-02 (#3700)
				   |		И бит_СоответствияАналитик.ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СчетРСБУ_СчетМСФО)
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-04-02 (#3700)
				   //|ГДЕ
				   //|	бит_СоответствияАналитик.ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СчетРСБУ_СчетМСФО)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущийДок.Контрагент,
	               |	ТекущийДок.Договор,
	               |	ТекущийДок.ДокументРасчетов,
	               |	ТекущийДок.ОтветственныйЗаДоговор,
	               |	ТекущийДок.ПредметДоговора,
	               |	ТекущийДок.СуммаЗадолженности,
	               |	ТекущийДок.СрокИсполненияВзаиморасчеты,
	               |	ТекущийДок.Счет,
	               |	ТекущийДок.СрокИсполнения,
	               |	ТекущийДок.ДатаВозникновенияЗадолженности,
	               |	ТекущийДок.ДнейПросрочки,
	               |	ТекущийДок.ПлатежноеПоручение,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.ПроцентСписания = 100
	               |			ТОГДА ПредыдущийДок.ПроцентСписания
	               |		ИНАЧЕ ТекущийДок.ПроцентСписания
	               |	КОНЕЦ КАК ПроцентСписания,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ)
	               |				ТОГДА ТекущийДок.СуммаЗадолженности
	               |			ИНАЧЕ ТекущийДок.СуммаСписания
	               |		КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаСписания,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ТекущийДок.НачислятьРезерв
	               |	КОНЕЦ КАК НачислятьРезерв,
					// BIT AMerkulov 18.10.2015 ++			   
				   |	ВидыРасчетов.ВидРасчета КАК ВидРасчетов,
				   	// BIT AMerkulov 18.10.2015 ++	
				   
	               |	ТекущийДок.СчетМСФО,
	               |	ТекущийДок.Порядок КАК Порядок,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТекущийДок.ПроцентСписания = 0
	               |					И ПредыдущийДок.ПроцентСписания = 0
	               |				ТОГДА ЛОЖЬ
	               |			КОГДА ТекущийДок.Счет = ПредыдущийДок.Счет
	               |					И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
	               |					И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
	               |					И ТекущийДок.Договор = ПредыдущийДок.Договор
	               |					И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
	               |					И ТекущийДок.ПроцентСписания = ПредыдущийДок.ПроцентСписания
	               |					И (ВЫРАЗИТЬ(ТекущийДок.СуммаСписания КАК ЧИСЛО(15, 2))) = (ВЫРАЗИТЬ(ПредыдущийДок.СуммаСписания КАК ЧИСЛО(15, 2)))
	               |					И ТекущийДок.ДокументРасчетов = ПредыдущийДок.ДокументРасчетов
	               |					И ТекущийДок.ОтветственныйЗаДоговор = ПредыдущийДок.ОтветственныйЗаДоговор
	               |					И ТекущийДок.ДатаВозникновенияЗадолженности = ПредыдущийДок.ДатаВозникновенияЗадолженности
	               |					И ТекущийДок.ПлатежноеПоручение = ПредыдущийДок.ПлатежноеПоручение
	               |				ТОГДА ИСТИНА
	               |			КОГДА ПредыдущийДок.ПроцентСписания = 100
	               |					И ПредыдущийДок.БИТ_НачислятьРезерв
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК ПредыдущийПериод,
	               |	ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ) КАК БИТ_НачислятьРезерв
	               |ИЗ
	               |	ТекущийДок КАК ТекущийДок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущийДок КАК ПредыдущийДок
	               |		ПО ТекущийДок.Счет = ПредыдущийДок.Счет
	               |			И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
	               |			И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
	               |			И ТекущийДок.Договор = ПредыдущийДок.Договор
	               |			И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
	               |			И ТекущийДок.ДокументРасчетов = ПредыдущийДок.ДокументРасчетов
	               |			И ТекущийДок.ОтветственныйЗаДоговор = ПредыдущийДок.ОтветственныйЗаДоговор
	               |			И (НАЧАЛОПЕРИОДА(ТекущийДок.ДатаВозникновенияЗадолженности, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПредыдущийДок.ДатаВозникновенияЗадолженности, ДЕНЬ))
				   
					   // BIT AMerkulov 18.10.2015 ++	
				   
					|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыРасчетов КАК ВидыРасчетов
					|		ПО ТекущийДок.Договор = ВидыРасчетов.ДоговорКонтрагента
				   // BIT AMerkulov 18.10.2015 --	
			   
				   // BIT AMerkulov 23.12.2014 ++				   
				   |ГДЕ
				   |	НЕ ТекущийДок.Контрагент В
				   |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |					бит_СобственныеКонтрагенты.Контрагент
				   |				ИЗ
				   |					РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты)
				   |
				   // BIT AMerkulov 23.12.2014 --					   
				   
	               |СГРУППИРОВАТЬ ПО
	               |	ТекущийДок.Контрагент,
	               |	ТекущийДок.Договор,
	               |	ТекущийДок.ДокументРасчетов,
	               |	ТекущийДок.ОтветственныйЗаДоговор,
	               |	ТекущийДок.ПредметДоговора,
	               |	ТекущийДок.СуммаЗадолженности,
	               |	ТекущийДок.СрокИсполненияВзаиморасчеты,
	               |	ТекущийДок.Счет,
					// BIT AMerkulov 18.10.2015 ++			   
				   |	ВидыРасчетов.ВидРасчета,
				   	// BIT AMerkulov 18.10.2015 ++					   
	               |	ТекущийДок.СрокИсполнения,
	               |	ТекущийДок.ДатаВозникновенияЗадолженности,
	               |	ТекущийДок.ДнейПросрочки,
	               |	ТекущийДок.ПлатежноеПоручение,
	               |	ТекущийДок.СчетМСФО,
	               |	ТекущийДок.Порядок,
	               |	ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ),
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.ПроцентСписания = 100
	               |			ТОГДА ПредыдущийДок.ПроцентСписания
	               |		ИНАЧЕ ТекущийДок.ПроцентСписания
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ТекущийДок.НачислятьРезерв
	               |	КОНЕЦ,
	               |	ВЫРАЗИТЬ(ВЫБОР
	               |			КОГДА ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ)
	               |				ТОГДА ТекущийДок.СуммаЗадолженности
	               |			ИНАЧЕ ТекущийДок.СуммаСписания
	               |		КОНЕЦ КАК ЧИСЛО(15, 2))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок УБЫВ,
	               |	ПроцентСписания УБЫВ";
	
	
	Граница = Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("ТЗРезультат",ТЗРезультат);
	Запрос.УстановитьПараметр("Дата", Граница.Значение);
	Запрос.УстановитьПараметр("Организация",Организация);
	//Бит_Егоров+
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период",КонецМесяца(ПериодФормирования));
    //Бит_Егоров-
 	Результат = Запрос.Выполнить().Выгрузить();
	Данные.Загрузить(Результат);
	
КонецПроцедуры

Процедура ЗаполнитьДанные(СписокИспользумеых) Экспорт
	
	// BIT AMerkulov 18.10.2015 ++	
	// Изменен текст запроса для заполнения видов расчета
	// BIT AMerkulov 18.10.2015 --		
	
	Запрос = Новый Запрос;
	//++СБ Пискунова ВВ 25.04.16  изменение запроса (#2366)
	//было до изменения кода!!! //++СБ Пискунова ВВ 25.04.16 (#2366)  

	
	//"ВЫБРАТЬ
	//               |	Подзапрос.Контрагент,
	//               |	Подзапрос.КонтрагентНаименование КАК КонтрагентНаименование,
	//               |	Подзапрос.Договор,
	//               |	Подзапрос.ДокументРасчетов,
	//               |	Подзапрос.ОтветственныйЗаДоговор,
	//               |	Подзапрос.ПредметДоговора,
	//               |	Подзапрос.СуммаЗадолженности,
	//               |	Подзапрос.СрокИсполненияВзаиморасчеты,
	//               |	Подзапрос.Счет,
	//               |	Подзапрос.СрокИсполнения,
	//               |	Подзапрос.ИНН,
	//               |	Подзапрос.ДатаВозникновенияЗадолженности,
	//               |	ВЫБОР
	//               |		КОГДА Подзапрос.СрокИсполнения < &ПериодСрокИсполнения
	//               |			ТОГДА РАЗНОСТЬДАТ(ВЫРАЗИТЬ(Подзапрос.СрокИсполнения КАК ДАТА), &ПериодСрокИсполнения, ДЕНЬ)
	//               |		ИНАЧЕ ""-""
	//               |	КОНЕЦ КАК ДнейПросрочки,
	//               |	Подзапрос.ПлатежноеПоручение КАК ПлатежноеПоручение,
	//			   |	Подзапрос.ВидРасчета

	//               |ИЗ
	//               |	(ВЫБРАТЬ
	//               |		ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	//               |		ХозрасчетныйОстатки.Субконто1.Наименование КАК КонтрагентНаименование,
	//               |		ХозрасчетныйОстатки.Субконто2 КАК Договор,
	//               |		ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
	//               |		Ответственные.Значение КАК ОтветственныйЗаДоговор,
	//               |		ПредметДоговора.Значение КАК ПредметДоговора,
	//               |		ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаЗадолженности,
	//               |		ПрДатаОстатки.Значение КАК СрокИсполненияВзаиморасчеты,
	//               |		ПрДата.Значение КАК СрокИсполненияПП,
	//               |		ХозрасчетныйОстатки.Счет КАК Счет,
	//               |		ВЫБОР
	//               |			КОГДА ПрДатаОстатки.Значение ЕСТЬ NULL 
	//               |				ТОГДА ПрДата.Значение
	//               |			ИНАЧЕ ПрДатаОстатки.Значение
	//               |		КОНЕЦ КАК СрокИсполнения,
	//               |		ХозрасчетныйОстатки.Субконто1.ИНН КАК ИНН,
	//               |		ВЫБОР
	//               |			КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	//               |				ТОГДА ВЫБОР
	//               |						КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))) <> """"
	//               |							ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))
	//               |						ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	//               |					КОНЕЦ
	//               |			КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.СписаниеСРасчетногоСчета
	//               |				ТОГДА ВЫБОР
	//               |						КОГДА ХозрасчетныйОстатки.Субконто3.ДокументОснование = НЕОПРЕДЕЛЕНО
	//               |							ТОГДА ХозрасчетныйОстатки.Субконто3
	//               |						ИНАЧЕ ХозрасчетныйОстатки.Субконто3.ДокументОснование
	//               |					КОНЕЦ
	//               |			ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	//               |		КОНЕЦ КАК ПлатежноеПоручение,
	//               |		ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаВозникновенияЗадолженности,
	//               |		ВидыРасчета.ВидРасчета КАК ВидРасчета
	//			   
	//               |	ИЗ
	//               |		РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация) КАК ХозрасчетныйОстатки
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |				ДополнительныеСведения.Объект КАК Объект,
	//               |				ДополнительныеСведения.Значение КАК Значение
	//               |			ИЗ
	//               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	//               |			ГДЕ
	//               |				ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	//               |				И ДополнительныеСведения.Свойство = &Ответственный) КАК Ответственные
	//               |			ПО ХозрасчетныйОстатки.Субконто2 = Ответственные.Объект
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |				ДополнительныеСведения.Объект КАК Объект,
	//               |				ДополнительныеСведения.Значение КАК Значение
	//               |			ИЗ
	//               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	//               |			ГДЕ
	//               |				ДополнительныеСведения.Свойство.Наименование ПОДОБНО ""Срок исполнения"") КАК ПрДата
	//               |			ПО ХозрасчетныйОстатки.Субконто3.ДокументОснование = ПрДата.Объект
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |				ДополнительныеСведения.Значение КАК Значение,
	//               |				ДополнительныеСведения.Объект КАК Объект
	//               |			ИЗ
	//               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	//               |			ГДЕ                
	//               |				ДополнительныеСведения.Свойство.Наименование ПОДОБНО ""Срок исполнения"") КАК ПрДатаОстатки
	//               |			ПО ХозрасчетныйОстатки.Субконто3 = ПрДатаОстатки.Объект
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |				ДополнительныеСведения.Объект КАК Объект,
	//               |				ДополнительныеСведения.Значение КАК Значение
	//               |			ИЗ
	//               |				РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	//               |			ГДЕ
	//               |				ДополнительныеСведения.Свойство = &ПредметДоговора
	//               |				И ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов) КАК ПредметДоговора
	//               |			ПО ХозрасчетныйОстатки.Субконто2 = ПредметДоговора.Объект
	//			   
	//			   
	//               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	//               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	//               |				МАКСИМУМ(УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета) КАК ВидРасчета
	//               |			ИЗ
	//               |				РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, ) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних
	//               |			
	//               |			СГРУППИРОВАТЬ ПО
	//               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента) КАК ВидыРасчета
	//			   
	//               |			ПО ХозрасчетныйОстатки.Субконто2 = ПредметДоговора.Объект) КАК Подзапрос
	//               |
	//               |УПОРЯДОЧИТЬ ПО
	//               |	КонтрагентНаименование";
	//			   
	
	//Стало  Пискунова ВВ 25.04.16  изменение запроса (#2366)
	 Запрос.Текст =
	 "ВЫБРАТЬ
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	 |	МАКСИМУМ(УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета) КАК ВидРасчета,
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Организация КАК Организация
	 |ПОМЕСТИТЬ ВидыРасчета
	 |ИЗ
	 |	РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, Организация = &Организация) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента,
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Организация
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ДополнительныеСведения.Объект КАК Объект,
	 |	ДополнительныеСведения.Значение КАК Значение
	 |ПОМЕСТИТЬ Ответственные
	 |ИЗ
	 |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	 |ГДЕ
	 |	ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	 |	И ДополнительныеСведения.Свойство = &Ответственный
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ДополнительныеСведения.Объект КАК Объект,
	 |	ДополнительныеСведения.Значение КАК Значение
	 |ПОМЕСТИТЬ ПрДата
	 |ИЗ
	 |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	 |ГДЕ
	 |	ДополнительныеСведения.Свойство = &СрокИсполнения
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ДополнительныеСведения.Значение КАК Значение,
	 |	ДополнительныеСведения.Объект КАК Объект
	 |ПОМЕСТИТЬ ПрДатаОстатки
	 |ИЗ
	 |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	 |ГДЕ
	 |	ДополнительныеСведения.Свойство = &СрокИсполнения
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ДополнительныеСведения.Объект КАК Объект,
	 |	ДополнительныеСведения.Значение КАК Значение
	 |ПОМЕСТИТЬ ПредметДоговора
	 |ИЗ
	 |	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
	 |ГДЕ
	 |	ДополнительныеСведения.Свойство = &ПредметДоговора
	 |	И ДополнительныеСведения.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ХозрасчетныйОстатки.Субконто1 КАК Контрагент,
	 |	ХозрасчетныйОстатки.Субконто1.Наименование КАК КонтрагентНаименование,
	 |	ХозрасчетныйОстатки.Субконто2 КАК Договор,
	 |	ХозрасчетныйОстатки.Субконто3 КАК ДокументРасчетов,
	 |	Ответственные.Значение КАК ОтветственныйЗаДоговор,
	 |	ПредметДоговора.Значение КАК ПредметДоговора,
	 |	ХозрасчетныйОстатки.СуммаОстатокДт КАК СуммаЗадолженности,
	 |	ПрДата.Значение КАК СрокИсполненияПП,
	 |	ПрДатаОстатки.Значение КАК СрокИсполненияВзаиморасчеты,
	 |	ВЫРАЗИТЬ(ЕСТЬNULL(ВЫБОР
	 |				КОГДА ПрДатаОстатки.Значение ЕСТЬ NULL 
	 |					ТОГДА ПрДата.Значение
	 |				ИНАЧЕ ПрДатаОстатки.Значение
	 |			КОНЕЦ, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДАТА) КАК СрокИсполнения,
	 |	ХозрасчетныйОстатки.Счет КАК Счет,
	 |	ХозрасчетныйОстатки.Субконто1.ИНН КАК ИНН,
	 |	ХозрасчетныйОстатки.Субконто3.Дата КАК ДатаВозникновенияЗадолженности,
	 |	ВидыРасчета.ВидРасчета КАК ВидРасчета,
	 |	ВЫБОР
	 |		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.ДокументРасчетовСКонтрагентом
	 |			ТОГДА ВЫБОР
	 |					КОГДА (ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))) <> """"
	 |						ТОГДА ВЫРАЗИТЬ(ХозрасчетныйОстатки.Субконто3.Комментарий КАК СТРОКА(100))
	 |					ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	 |				КОНЕЦ
	 |		КОГДА ХозрасчетныйОстатки.Субконто3 ССЫЛКА Документ.СписаниеСРасчетногоСчета
	 |			ТОГДА ВЫБОР
	 |					КОГДА ХозрасчетныйОстатки.Субконто3.ДокументОснование = НЕОПРЕДЕЛЕНО
	 |						ТОГДА ХозрасчетныйОстатки.Субконто3
	 |					ИНАЧЕ ХозрасчетныйОстатки.Субконто3.ДокументОснование
	 |				КОНЕЦ
	 |		ИНАЧЕ ХозрасчетныйОстатки.Субконто3
	 |	КОНЕЦ КАК ПлатежноеПоручение,
	 |	ВЫБОР
	 |		КОГДА ВЫБОР
	 |				КОГДА ПрДатаОстатки.Значение ЕСТЬ NULL 
	 |					ТОГДА ПрДата.Значение
	 |				ИНАЧЕ ПрДатаОстатки.Значение
	 |			КОНЕЦ < &ПериодСрокИсполнения
	 |			ТОГДА РАЗНОСТЬДАТ(ДАТАВРЕМЯ(1, 1, 1), &ПериодСрокИсполнения, ДЕНЬ)
	 |		ИНАЧЕ ""-""
	 |	КОНЕЦ КАК ДнейПросрочки
	 |ПОМЕСТИТЬ Предварительная
	 |ИЗ
	 |	РегистрБухгалтерии.Хозрасчетный.Остатки(&Период, Счет В ИЕРАРХИИ (&Счет), , Организация = &Организация) КАК ХозрасчетныйОстатки
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Ответственные КАК Ответственные
	 |		ПО ХозрасчетныйОстатки.Субконто2 = Ответственные.Объект
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ПредметДоговора КАК ПредметДоговора
	 |		ПО ХозрасчетныйОстатки.Субконто2 = ПредметДоговора.Объект
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ПрДата КАК ПрДата
	 |		ПО ХозрасчетныйОстатки.Субконто3.ДокументОснование = ПрДата.Объект
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ПрДатаОстатки КАК ПрДатаОстатки
	 |		ПО ХозрасчетныйОстатки.Субконто3 = ПрДатаОстатки.Объект
	 |		ЛЕВОЕ СОЕДИНЕНИЕ ВидыРасчета КАК ВидыРасчета
	 |		ПО ХозрасчетныйОстатки.Организация = ВидыРасчета.Организация
	 |			И ХозрасчетныйОстатки.Субконто2 = ВидыРасчета.ДоговорКонтрагента
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	Предварительная.Контрагент,
	 |	Предварительная.КонтрагентНаименование,
	 |	Предварительная.Договор,
	 |	Предварительная.ДокументРасчетов,
	 |	Предварительная.ОтветственныйЗаДоговор,
	 |	Предварительная.ПредметДоговора,
	 |	Предварительная.СуммаЗадолженности,
	 |	Предварительная.СрокИсполненияПП,
	 |	Предварительная.СрокИсполненияВзаиморасчеты,
	 |	Предварительная.СрокИсполнения,
	 |	Предварительная.Счет,
	 |	Предварительная.ИНН,
	 |	Предварительная.ДатаВозникновенияЗадолженности,
	 |	Предварительная.ВидРасчета,
	 |	Предварительная.ПлатежноеПоручение,
	 |	Предварительная.ДнейПросрочки КАК ДнейПросрочкиБИТ,
	 |	ВЫБОР
	 |		КОГДА Предварительная.СрокИсполнения < &ПериодСрокИсполнения
	 |				И Предварительная.СрокИсполнения <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	 |			ТОГДА РАЗНОСТЬДАТ(Предварительная.СрокИсполнения, &ПериодСрокИсполнения, ДЕНЬ)
	 |		ИНАЧЕ ""-""
	 |	КОНЕЦ КАК ДнейПросрочки
	 |ИЗ
	 |	Предварительная КАК Предварительная";
	 
	Граница = Новый Граница(КонецМесяца(ПериодФормирования), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("ПериодСрокИсполнения", КонецДня(ПериодФормирования));		//Бит_Егоров: Граница.Значение);
	Запрос.УстановитьПараметр("Период", 			Граница);
	Запрос.УстановитьПараметр("Счет", 				СписокИспользумеых);
	Запрос.УстановитьПараметр("Ответственный", 		ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Ответственный за договор"));
	Запрос.УстановитьПараметр("ПредметДоговора", 	ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Предмет договора"));
	
	
	//++СБ Пискунова ВВ 25.04.16  изменение кода (#2366) 
	Запрос.УстановитьПараметр("СрокИсполнения", 			ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Срок исполнения"));
	
	
	// BIT AMerkulov 18.10.2015 ++	
	Граница = Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("Дата", Граница.Значение);
	// BIT AMerkulov 18.10.2015 --			
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	// BIT AMerkulov 18.10.2015 ++	
	// Изменен текст запроса для заполнения видов расчета
	// BIT AMerkulov 18.10.2015 --	
	
	//+ СБ Прудникова 22.12.2011
	// заполним дополнительные колонки
	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	//++СБ Пискунова ВВ 25.04.16  изменение кода (#2366) 
	"ВЫБРАТЬ
	|	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	МАКСИМУМ(УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета) КАК ВидРасчета,
	|	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Организация КАК Организация
	|ПОМЕСТИТЬ ВидыРасчетов
	|ИЗ
	|	РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, Организация = &Организация) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента,
	|	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗРезультат.Контрагент,
	|	ТЗРезультат.Договор,
	|	ТЗРезультат.ДокументРасчетов,
	|	ТЗРезультат.ОтветственныйЗаДоговор,
	|	ТЗРезультат.ПредметДоговора,
	|	ТЗРезультат.СуммаЗадолженности,
	|	ТЗРезультат.Счет,
	|	ЕСТЬNULL(ТЗРезультат.СрокИсполненияВзаиморасчеты, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокИсполненияВзаиморасчеты,
	|	ЕСТЬNULL(ТЗРезультат.СрокИсполнения, ДАТАВРЕМЯ(1, 1, 1)) КАК СрокИсполнения,
	|	ЕСТЬNULL(ТЗРезультат.ДатаВозникновенияЗадолженности, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозникновенияЗадолженности,
	|	ТЗРезультат.ДнейПросрочки,
	|	ТЗРезультат.ПлатежноеПоручение КАК ПлатежноеПоручение
	|ПОМЕСТИТЬ ТЗ
	|ИЗ
	|	&ТЗРезультат КАК ТЗРезультат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Контрагент,
	|	ТЗ.Договор,
	|	ТЗ.ДокументРасчетов,
	|	ТЗ.ОтветственныйЗаДоговор,
	|	ТЗ.ПредметДоговора,
	|	ТЗ.СуммаЗадолженности,
	|	ТЗ.Счет,
	|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.СрокИсполненияВзаиморасчеты КАК ДАТА), ДЕНЬ) КАК СрокИсполненияВзаиморасчеты,
	|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.СрокИсполнения КАК ДАТА), ДЕНЬ) КАК СрокИсполнения,
	|	НАЧАЛОПЕРИОДА(ВЫРАЗИТЬ(ТЗ.ДатаВозникновенияЗадолженности КАК ДАТА), ДЕНЬ) КАК ДатаВозникновенияЗадолженности,
	|	ВЫБОР
	|		КОГДА ТЗ.ДнейПросрочки = ""-""
	|			ТОГДА 0
	|		ИНАЧЕ ТЗ.ДнейПросрочки
	|	КОНЕЦ КАК ДнейПросрочки,
	|	ТЗ.ПлатежноеПоручение КАК ПлатежноеПоручение,
	|	ВЫБОР
	|		КОГДА ТЗ.ДнейПросрочки = ""-""
	|			ТОГДА 0
	|		КОГДА ТЗ.ДнейПросрочки > 365 * 3
	|			ТОГДА 100
	|		КОГДА ТЗ.ДнейПросрочки > 365 * 2
	|			ТОГДА 75
	|		КОГДА ТЗ.ДнейПросрочки > 365
	|			ТОГДА 40
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентСписания
	|ПОМЕСТИТЬ ДанныеСПроцентом
	|ИЗ
	|	ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗ.Контрагент,
	|	ТЗ.Договор,
	|	ТЗ.ДокументРасчетов,
	|	ТЗ.ОтветственныйЗаДоговор,
	|	ТЗ.ПредметДоговора,
	|	ТЗ.СуммаЗадолженности,
	|	ТЗ.СрокИсполненияВзаиморасчеты,
	|	ТЗ.Счет,
	|	ТЗ.СрокИсполнения,
	|	ТЗ.ДатаВозникновенияЗадолженности,
	|	ТЗ.ДнейПросрочки,
	|	ТЗ.ПлатежноеПоручение КАК ПлатежноеПоручение,
	|	ТЗ.НачислятьРезерв,
	|	ТЗ.СчетМСФО,
	|	ТЗ.ПроцентСписания,
	|	ТЗ.СуммаСписания,
	|	ТЗ.БИТ_НачислятьРезерв
	|ПОМЕСТИТЬ ПредыдущийДок
	|ИЗ
	|	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ.Данные КАК ТЗ
	|ГДЕ
	|	ТЗ.Ссылка В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка
	|			ИЗ
	|				Документ.ОК_НачислениеРезерваПодОбесценениеДЗ КАК ОК_НачислениеРезерваПодОбесценениеДЗ
	|			ГДЕ
	|				ОК_НачислениеРезерваПодОбесценениеДЗ.Проведен
	|				И ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка <> &Ссылка
	|				И ОК_НачислениеРезерваПодОбесценениеДЗ.Организация = &Организация
	|				И ОК_НачислениеРезерваПодОбесценениеДЗ.Дата < &Период
	|			УПОРЯДОЧИТЬ ПО
	|				ОК_НачислениеРезерваПодОбесценениеДЗ.Дата УБЫВ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСПроцентом.Контрагент,
	|	ДанныеСПроцентом.Договор,
	|	ДанныеСПроцентом.ДокументРасчетов,
	|	ДанныеСПроцентом.ОтветственныйЗаДоговор,
	|	ДанныеСПроцентом.ПредметДоговора,
	|	ДанныеСПроцентом.СуммаЗадолженности КАК СуммаЗадолженности,
	|	ДанныеСПроцентом.СрокИсполненияВзаиморасчеты,
	|	ДанныеСПроцентом.Счет,
	|	ДанныеСПроцентом.СрокИсполнения,
	|	ДанныеСПроцентом.ДатаВозникновенияЗадолженности,
	|	ДанныеСПроцентом.ДнейПросрочки,
	|	ДанныеСПроцентом.ПлатежноеПоручение КАК ПлатежноеПоручение,
	|	ДанныеСПроцентом.ПроцентСписания КАК ПроцентСписания,
	|	ДанныеСПроцентом.СуммаЗадолженности * ДанныеСПроцентом.ПроцентСписания / 100 КАК СуммаСписания,
	|	ИСТИНА КАК НачислятьРезерв,
	|	ЕСТЬNULL(бит_СоответствияАналитик.ПраваяАналитика_1, ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)) КАК СчетМСФО,
	|	ВЫБОР
	|		КОГДА НЕ бит_СоответствияАналитик.ПраваяАналитика_1 = ЗНАЧЕНИЕ(ПланСчетов.БИТ_Дополнительный_2.ПустаяСсылка)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Порядок
	|ПОМЕСТИТЬ ТекущийДок
	|ИЗ
	|	ДанныеСПроцентом КАК ДанныеСПроцентом
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
	|		ПО ДанныеСПроцентом.Счет = бит_СоответствияАналитик.ЛеваяАналитика_1
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-04-02 (#3700)
	|		И бит_СоответствияАналитик.ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СчетРСБУ_СчетМСФО)
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-04-02 (#3700)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийДок.Контрагент,
	|	ТекущийДок.Договор,
	|	ТекущийДок.ДокументРасчетов,
	|	ТекущийДок.ОтветственныйЗаДоговор,
	|	ТекущийДок.ПредметДоговора,
	|	ТекущийДок.СуммаЗадолженности,
	|	ТекущийДок.СрокИсполненияВзаиморасчеты,
	|	ТекущийДок.Счет,
	|	ТекущийДок.СрокИсполнения,
	|	ТекущийДок.ДатаВозникновенияЗадолженности,
	|	ТекущийДок.ДнейПросрочки,
	|	ТекущийДок.ПлатежноеПоручение,
	|	ТекущийДок.ПроцентСписания КАК ПроцентСписания,
	|	ЕСТЬNULL(ТекущийДок.СуммаСписания, 0) КАК СуммаСписания,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущийДок.СуммаСписания, 0) = 0
	|				ИЛИ ЕСТЬNULL(ТекущийДок.ПроцентСписания, 0) = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТекущийДок.НачислятьРезерв
	|	КОНЕЦ КАК НачислятьРезерв,
	|	ВидыРасчетов.ВидРасчета КАК ВидРасчетов,
	|	ТекущийДок.СчетМСФО,
	|	ТекущийДок.Порядок КАК Порядок,
	|	МАКСИМУМ(ВЫБОР
	|			КОГДА ТекущийДок.ПроцентСписания = 0
	|					И ПредыдущийДок.ПроцентСписания = 0
	|				ТОГДА ЛОЖЬ
	|			КОГДА ТекущийДок.Счет = ПредыдущийДок.Счет
	|					И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
	|					И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
	|					И ТекущийДок.Договор = ПредыдущийДок.Договор
	|					И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
	|					И ТекущийДок.ПроцентСписания = ПредыдущийДок.ПроцентСписания
	|					И (ВЫРАЗИТЬ(ТекущийДок.СуммаСписания КАК ЧИСЛО(15, 2))) = (ВЫРАЗИТЬ(ПредыдущийДок.СуммаСписания КАК ЧИСЛО(15, 2)))
	|					И ТекущийДок.ДокументРасчетов = ПредыдущийДок.ДокументРасчетов
	|					И ТекущийДок.ОтветственныйЗаДоговор = ПредыдущийДок.ОтветственныйЗаДоговор
	|					И ТекущийДок.ДатаВозникновенияЗадолженности = ПредыдущийДок.ДатаВозникновенияЗадолженности
	|					И ТекущийДок.ПлатежноеПоручение = ПредыдущийДок.ПлатежноеПоручение
	|				ТОГДА ИСТИНА
	|			КОГДА ПредыдущийДок.ПроцентСписания = 100
	|					И ПредыдущийДок.БИТ_НачислятьРезерв
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ) КАК ПредыдущийПериод,
	|	ЛОЖЬ КАК БИТ_НачислятьРезерв
	|ИЗ
	|	ТекущийДок КАК ТекущийДок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущийДок КАК ПредыдущийДок
	|		ПО ТекущийДок.Счет = ПредыдущийДок.Счет
	|			И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
	|			И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
	|			И ТекущийДок.Договор = ПредыдущийДок.Договор
	|			И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
	|			И ТекущийДок.ДокументРасчетов = ПредыдущийДок.ДокументРасчетов
	|			И ТекущийДок.ОтветственныйЗаДоговор = ПредыдущийДок.ОтветственныйЗаДоговор
	|			И (НАЧАЛОПЕРИОДА(ТекущийДок.ДатаВозникновенияЗадолженности, ДЕНЬ) = НАЧАЛОПЕРИОДА(ПредыдущийДок.ДатаВозникновенияЗадолженности, ДЕНЬ))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВидыРасчетов КАК ВидыРасчетов
	|		ПО ТекущийДок.Договор = ВидыРасчетов.ДоговорКонтрагента
	|ГДЕ
	|	НЕ ТекущийДок.Контрагент В
	|				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|					бит_СобственныеКонтрагенты.Контрагент
	|				ИЗ
	|					РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТекущийДок.Контрагент,
	|	ТекущийДок.Договор,
	|	ТекущийДок.ДокументРасчетов,
	|	ТекущийДок.ОтветственныйЗаДоговор,
	|	ТекущийДок.ПредметДоговора,
	|	ТекущийДок.СуммаЗадолженности,
	|	ТекущийДок.СрокИсполненияВзаиморасчеты,
	|	ТекущийДок.Счет,
	|	ВидыРасчетов.ВидРасчета,
	|	ТекущийДок.СрокИсполнения,
	|	ТекущийДок.ДатаВозникновенияЗадолженности,
	|	ТекущийДок.ДнейПросрочки,
	|	ТекущийДок.ПлатежноеПоручение,
	|	ТекущийДок.СчетМСФО,
	|	ТекущийДок.Порядок,
	|	ТекущийДок.ПроцентСписания,
	|	ЕСТЬNULL(ТекущийДок.СуммаСписания, 0),
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ТекущийДок.СуммаСписания, 0) = 0
	|				ИЛИ ЕСТЬNULL(ТекущийДок.ПроцентСписания, 0) = 0
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ТекущийДок.НачислятьРезерв
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок УБЫВ,
	|	ПроцентСписания УБЫВ";
	
	
	Граница = Новый Граница(КонецМесяца(Дата), ВидГраницы.Включая);			   
	Запрос.УстановитьПараметр("ТЗРезультат",ТЗРезультат);
	Запрос.УстановитьПараметр("Дата", Граница.Значение);
	Запрос.УстановитьПараметр("Организация",Организация);
	//Бит_Егоров+
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Запрос.УстановитьПараметр("Период",КонецМесяца(ПериодФормирования));
	//Бит_Егоров-
	Результат = Запрос.Выполнить().Выгрузить();
	Данные.Загрузить(Результат);
	
КонецПроцедуры
//-СБ ПискуноваВ 15.06.2016 #2366 Изменились требования к заполнению документа, процедуру полностью перенесла в бэкап

Процедура Инициализировать() Экспорт 

	Счета();	
	
КонецПроцедуры

Процедура Счета()
	
	ОграниченныйСписок	= Новый СписокЗначений;
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоАвансамВыданным);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПокупателями);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыПоПретензиям);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСРозничнымиПокупателями);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПоставщикамиИПодрядчиками);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.РасчетыСПрочимиПокупателямиИЗаказчиками);
	ОграниченныйСписок.Добавить(ПланыСчетов.Хозрасчетный.ПрочиеРасчетыСРазнымиДебиторамиИКредиторами);
	
	Счета				= ХранилищеСчетов.Получить();  
	
	Если Счета = Неопределено или типЗнч(Счета) = тип("СписокЗначений") и Счета.Количество() = 0 Тогда
		Счета			= ОграниченныйСписок;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	ХранилищеСчетов	=  Новый ХранилищеЗначения(Счета);
КонецПроцедуры

Процедура УстановитьСчета(ПолученныйСписок) Экспорт
	Счета = ПолученныйСписок;
КонецПроцедуры

//+ СБ Прудникова 2011-12-21
Функция ЗаполнитьДанныеПоРегиструДебиторскаяЗадолженность() Экспорт
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СчетAxapta,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Контрагент,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Договор,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения, &ПериодФормирования, ДЕНЬ) > 0
	               |			ТОГДА РАЗНОСТЬДАТ(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения, &ПериодФормирования, ДЕНЬ)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДнейПросрочки,
	               |	СУММА(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Сумма) КАК Сумма,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.ДатаВозникновения КАК ДатаВозникновения,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения КАК СрокИсполнения,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Валюта,
	               |	СУММА(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.ВалютнаяСумма) КАК ВалютнаяСумма
	               |ПОМЕСТИТЬ ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.СБ_ДебиторскаяЗадолженностьAxapta.СрезПоследних(&Период, НЕ Валюта = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних
	               |
				   
				   // BIT AMerkulov 18.01.2015 ++				   
				   |ГДЕ НАЧАЛОПЕРИОДА(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Период, МЕСЯЦ) = НАЧАЛОПЕРИОДА(&период, МЕСЯЦ)
				   // BIT AMerkulov 18.01.2015 --				   

	               |СГРУППИРОВАТЬ ПО
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СчетAxapta,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Контрагент,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Договор,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.Валюта,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.ДатаВозникновения,
	               |	СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения,
	               |	ВЫБОР
	               |		КОГДА РАЗНОСТЬДАТ(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения, &ПериодФормирования, ДЕНЬ) > 0
	               |			ТОГДА РАЗНОСТЬДАТ(СБ_ДебиторскаяЗадолженностьAxaptaСрезПоследних.СрокИсполнения, &ПериодФормирования, ДЕНЬ)
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеРегистра.СчетAxapta,
	               |	ДанныеРегистра.Контрагент,
	               |	ДанныеРегистра.Договор,
	               |	ДанныеРегистра.Сумма,
	               |	ДанныеРегистра.ДатаВозникновения,
	               |	ДанныеРегистра.СрокИсполнения,
	               |	ДанныеРегистра.Валюта,
	               |	ДанныеРегистра.ВалютнаяСумма,
	               |	ДанныеРегистра.ДнейПросрочки,
	               |	ВЫБОР
	               |		КОГДА ДанныеРегистра.ДнейПросрочки ЕСТЬ NULL 
	               |			ТОГДА 0
	               |		КОГДА ДанныеРегистра.ДнейПросрочки >= 0
	               |				И ДанныеРегистра.ДнейПросрочки < 365
	               |			ТОГДА 0
	               |		КОГДА ДанныеРегистра.ДнейПросрочки >= 365
	               |				И ДанныеРегистра.ДнейПросрочки < 365 * 2
	               |			ТОГДА 40
	               |		КОГДА ДанныеРегистра.ДнейПросрочки >= 365 * 2
	               |				И ДанныеРегистра.ДнейПросрочки < 365 * 3
	               |			ТОГДА 75
	               |		КОГДА ДанныеРегистра.ДнейПросрочки >= 365 * 3
	               |			ТОГДА 100
	               |	КОНЕЦ КАК ПроцентСписания
	               |ПОМЕСТИТЬ ДанныеСПроцентом
	               |ИЗ
	               |	ДанныеРегистра КАК ДанныеРегистра
	               |;
				   
				   // BIT AMerkulov 18.10.2015 ++	
				   
	               |////////////////////////////////////////////////////////////////////////////////
					|	ВЫБРАТЬ
	               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента КАК ДоговорКонтрагента,
	               |				МАКСИМУМ(УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета) КАК ВидРасчета
				   |ПОМЕСТИТЬ ВидыРасчетов
	               |			ИЗ
	               |				РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, ) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента
	               |;
				   
					// BIT AMerkulov 18.10.2015 --	
				   
				   
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка
	               |ПОМЕСТИТЬ СсылканапредыдущийДок
	               |ИЗ
	               |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ КАК ОК_НачислениеРезерваПодОбесценениеДЗ
	               |ГДЕ
	               |	ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка.Проведен = ИСТИНА
	               |	И ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка <> &Ссылка
	               |	И ОК_НачислениеРезерваПодОбесценениеДЗ.Организация = &Организация
	               |	И ОК_НачислениеРезерваПодОбесценениеДЗ.Дата < &Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОК_НачислениеРезерваПодОбесценениеДЗ.Дата УБЫВ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Счет,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.СчетМСФО,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Контрагент,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Договор,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.ДнейПросрочки,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.СуммаЗадолженности КАК СуммаЗадолженности,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.ПроцентСписания,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.СуммаСписания КАК СуммаСписания,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.НачислятьРезерв,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.БИТ_НачислятьРезерв,
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.ДатаВозникновенияЗадолженности
	               |ПОМЕСТИТЬ ПредыдущийДок
	               |ИЗ
	               |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ.Данные КАК ОК_НачислениеРезерваПодОбесценениеДЗДанные
	               |ГДЕ
	               |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Ссылка В
	               |			(ВЫБРАТЬ
	               |				СсылканапредыдущийДок.Ссылка
	               |			ИЗ
	               |				СсылканапредыдущийДок КАК СсылканапредыдущийДок)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ДанныеСПроцентом.СчетAxapta КАК Счет,
	               |	ДанныеСПроцентом.Контрагент,
	               |	ДанныеСПроцентом.Договор,
	               |	СУММА(ВЫБОР
	               |			КОГДА ДанныеСПроцентом.СчетAxapta = ""60.22""
	               |					И ДанныеСПроцентом.ВалютнаяСумма > 0
	               |				ТОГДА ДанныеСПроцентом.ВалютнаяСумма * КурсыВалютСрезПоследних.Курс
	               |			ИНАЧЕ ДанныеСПроцентом.Сумма
	               |		КОНЕЦ) КАК СуммаЗадолженности,
	               |	МАКСИМУМ(ДанныеСПроцентом.ПроцентСписания) КАК ПроцентСписания,
	               |	СУММА(ВЫРАЗИТЬ(ВЫБОР
	               |				КОГДА ДанныеСПроцентом.СчетAxapta = ""60.22""
	               |						И ДанныеСПроцентом.ВалютнаяСумма > 0
	               |					ТОГДА ДанныеСПроцентом.ВалютнаяСумма * КурсыВалютСрезПоследних.Курс * ДанныеСПроцентом.ПроцентСписания / 100
	               |				ИНАЧЕ ДанныеСПроцентом.Сумма * ДанныеСПроцентом.ПроцентСписания / 100
	               |			КОНЕЦ КАК ЧИСЛО(15, 2))) КАК СуммаСписания,
	               |	ВЫБОР
	               |		КОГДА ДанныеСПроцентом.Сумма * ДанныеСПроцентом.ПроцентСписания > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК НачислятьРезерв,
	               |	ЕСТЬNULL(бит_СоответствияАналитик.ПраваяАналитика_1, ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)) КАК СчетМСФО,
	               |	ВЫБОР
	               |		КОГДА НЕ бит_СоответствияАналитик.ПраваяАналитика_1 = ЗНАЧЕНИЕ(ПланСчетов.БИТ_Дополнительный_2.ПустаяСсылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Порядок,
	               |	ДанныеСПроцентом.ДатаВозникновения,
	               |	ДанныеСПроцентом.СрокИсполнения,
	               |	ДанныеСПроцентом.Валюта,
	               |	СУММА(ДанныеСПроцентом.ВалютнаяСумма) КАК ВалютнаяСумма,
	               |	КурсыВалютСрезПоследних.Курс,
	               |	ДанныеСПроцентом.ДнейПросрочки
	               |ПОМЕСТИТЬ ТекущийДок
	               |ИЗ
	               |	ДанныеСПроцентом КАК ДанныеСПроцентом
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_СоответствияАналитик КАК бит_СоответствияАналитик
	               |		ПО ДанныеСПроцентом.СчетAxapta = бит_СоответствияАналитик.ЛеваяАналитика_1
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-04-02 (#3700)
				   |		И бит_СоответствияАналитик.ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СчетРСБУ_СчетМСФО)
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-04-02 (#3700)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&Период, ) КАК КурсыВалютСрезПоследних
	               |		ПО ДанныеСПроцентом.Валюта = КурсыВалютСрезПоследних.Валюта
				   //|ГДЕ
	               //|	бит_СоответствияАналитик.ВидСоответствия = ЗНАЧЕНИЕ(Справочник.бит_ВидыСоответствийАналитик.СчетРСБУ_СчетМСФО)
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеСПроцентом.СчетAxapta,
	               |	ДанныеСПроцентом.Контрагент,
	               |	ДанныеСПроцентом.Договор,
	               |	ДанныеСПроцентом.ДатаВозникновения,
	               |	ДанныеСПроцентом.СрокИсполнения,
	               |	ДанныеСПроцентом.Валюта,
	               |	КурсыВалютСрезПоследних.Курс,
	               |	ЕСТЬNULL(бит_СоответствияАналитик.ПраваяАналитика_1, ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)),
	               |	ВЫБОР
	               |		КОГДА НЕ бит_СоответствияАналитик.ПраваяАналитика_1 = ЗНАЧЕНИЕ(ПланСчетов.БИТ_Дополнительный_2.ПустаяСсылка)
	               |			ТОГДА 1
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ДанныеСПроцентом.ДнейПросрочки,
	               |	ВЫБОР
	               |		КОГДА ДанныеСПроцентом.Сумма * ДанныеСПроцентом.ПроцентСписания > 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТекущийДок.Счет,
	               |	ТекущийДок.Контрагент,
	               |	ТекущийДок.Договор,
	               |	ТекущийДок.ДнейПросрочки,
	               |	ТекущийДок.СуммаЗадолженности,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА 100
	               |		ИНАЧЕ ТекущийДок.ПроцентСписания
	               |	КОНЕЦ КАК ПроцентСписания,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ)
	               |			ТОГДА ТекущийДок.СуммаЗадолженности
	               |		ИНАЧЕ ТекущийДок.СуммаСписания
	               |	КОНЕЦ КАК СуммаСписания,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ТекущийДок.НачислятьРезерв
	               |	КОНЕЦ КАК НачислятьРезерв,
	               |	ТекущийДок.СчетМСФО,
	               |	ТекущийДок.Порядок КАК Порядок,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТекущийДок.ПроцентСписания = 0
	               |					И ПредыдущийДок.ПроцентСписания = 0
	               |				ТОГДА ЛОЖЬ
	               |			КОГДА ТекущийДок.Счет = ПредыдущийДок.Счет
	               |					И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
	               |					И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
	               |					И ТекущийДок.Договор = ПредыдущийДок.Договор
	               |					И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
	               |					И ТекущийДок.ПроцентСписания = ПредыдущийДок.ПроцентСписания
	               |					И (ВЫРАЗИТЬ(ТекущийДок.СуммаСписания КАК ЧИСЛО(15, 2))) = (ВЫРАЗИТЬ(ПредыдущийДок.СуммаСписания КАК ЧИСЛО(15, 2)))
	               |					И ТекущийДок.НачислятьРезерв = ПредыдущийДок.НачислятьРезерв
	               |					И ТекущийДок.ДатаВозникновения = ПредыдущийДок.ДатаВозникновенияЗадолженности
	               |				ТОГДА ИСТИНА
	               |			КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |					И ПредыдущийДок.ПроцентСписания = 100
	               |				ТОГДА ИСТИНА
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ) КАК ПредыдущийПериод,
	               |	ТекущийДок.ДатаВозникновения КАК ДатаВозникновенияЗадолженности,
	               |	ТекущийДок.СрокИсполнения,
	               |	ВЫБОР
	               |		КОГДА ТекущийДок.Счет = ""60.22""
	               |			ТОГДА ТекущийДок.Валюта
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |	КОНЕЦ КАК Валюта,
	               |	ВЫБОР
	               |		КОГДА ТекущийДок.Счет = ""60.22""
	               |			ТОГДА ТекущийДок.ВалютнаяСумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВалютнаяСумма,
	               |	МАКСИМУМ(ВЫБОР
	               |			КОГДА ТекущийДок.Счет = ""60.22""
	               |				ТОГДА 1
	               |			ИНАЧЕ 0
	               |		КОНЕЦ) КАК ПроверкаВалютыОтличнойОтРубля,
	               |	ТекущийДок.Курс,
	               |	ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ) КАК БИТ_НачислятьРезерв
	               |ИЗ
	               |	ТекущийДок КАК ТекущийДок
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ПредыдущийДок КАК ПредыдущийДок
	               |		ПО ТекущийДок.Счет = ПредыдущийДок.Счет
				   |			И ТекущийДок.Контрагент = ПредыдущийДок.Контрагент
				   |			И ТекущийДок.Договор = ПредыдущийДок.Договор
				   |			И ТекущийДок.СчетМСФО = ПредыдущийДок.СчетМСФО
				   |			И ТекущийДок.СуммаЗадолженности = ПредыдущийДок.СуммаЗадолженности
				   // BIT AMerkulov 23.12.2014 ++				   
				   |ГДЕ
				   |	НЕ ТекущийДок.Контрагент В
				   |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |					бит_СобственныеКонтрагенты.Контрагент
				   |				ИЗ
				   |					РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты)
				   |
				   // BIT AMerkulov 23.12.2014 --				   
				   |СГРУППИРОВАТЬ ПО
				   |	ТекущийДок.Счет,
				   |	ТекущийДок.Контрагент,
				   |	ТекущийДок.Договор,
				   |	ТекущийДок.СчетМСФО,
				   |	ТекущийДок.СуммаЗадолженности,
	               |	ТекущийДок.Порядок,
	               |	ТекущийДок.ДатаВозникновения,
	               |	ТекущийДок.СрокИсполнения,
	               |	ТекущийДок.Курс,
	               |	ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ),
	               |	ТекущийДок.ДнейПросрочки,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ПредыдущийДок.БИТ_НачислятьРезерв, ЛОЖЬ)
	               |			ТОГДА ТекущийДок.СуммаЗадолженности
	               |		ИНАЧЕ ТекущийДок.СуммаСписания
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА ЛОЖЬ
	               |		ИНАЧЕ ТекущийДок.НачислятьРезерв
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТекущийДок.Счет = ""60.22""
	               |			ТОГДА ТекущийДок.Валюта
	               |		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ТекущийДок.Счет = ""60.22""
	               |			ТОГДА ТекущийДок.ВалютнаяСумма
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	ВЫБОР
	               |		КОГДА ПредыдущийДок.БИТ_НачислятьРезерв
	               |			ТОГДА 100
	               |		ИНАЧЕ ТекущийДок.ПроцентСписания
	               |	КОНЕЦ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Порядок УБЫВ";
	
	
		
	
	Запрос.УстановитьПараметр("Период",КонецМесяца(ПериодФормирования));
	Запрос.УстановитьПараметр("Дата",Новый Граница(КонецДня(Дата), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ДатаБезГрницы", КонецДня(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	//Бит_Егоров +
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ПериодФормирования", КонецДня(ПериодФормирования));
	//Бит_Егоров -
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаРезультата;
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ БИТ_ПровереноКазначейством Тогда
		Отказ = Истина;
		Сообщить("Документ не может быть проведен, так как не проверен казначейством");
		Возврат;
	КонецЕсли;
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверкаРеквизитов(Отказ,Заголовок);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ПроверкаДубля(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	СтруктураШапкиДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	ТаблицаДанных = ПодготовитьТаблицуДанные(СтруктураШапкиДокумента);

    Если Не Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаДанных, Отказ, Заголовок);
	КонецЕсли;

КонецПроцедуры

Процедура ДвиженияПоРегистрам(СтруктураШапкиДокумента,ТаблицаДанных, Отказ, Заголовок)
	
	Движения.бит_Дополнительный_2.Очистить();

	
	//СчетДт = ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("74104");
	СчетДт=ПолучитьНастройку("Начисление резерва под обесценение ДЗ","Счет ДЗ",отказ);
	
	Если НЕ ЗначениеЗаполнено(СчетДт) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	ВидДвижения = Перечисления.БИТ_ВидыДвиженияМСФО.КорректировкаМСФО;
	СтруктураПараметров = Новый Структура("Организация,Период,СчетДт,ВидДвижения"
										 ,СтруктураШапкиДокумента.Организация
										 ,СтруктураШапкиДокумента.Дата
										 ,СчетДт,ВидДвижения);
	
	
	Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
		
		// Сформируем проводки МСФО по начислению резерва
		// Дт Счет 74104  Кт СчетМСФО Контрагент Договор
		СтруктураПараметров.Вставить("СчетКт", СтрокаТаблицы.СчетМСФО);
		СформироватьДвиженияНачислениеРезерва(СтруктураШапкиДокумента,СтрокаТаблицы,СтруктураПараметров);
		
	КонецЦикла;
	
	СформироватьСторноЗаписи();
	
КонецПроцедуры // 

Процедура ПроверкаРеквизитов(Отказ, Заголовок)

	// проверим заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");	
	
	ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект,  СтруктураОбязательныхПолей,   Отказ, Заголовок);
	
	Если НЕ Дата = КонецМесяца(Дата) Тогда
		Сообщить("Дата указана некорректно");
		Отказ = Истина;
	КонецЕсли;
	
	
КонецПроцедуры //ПроверкаРеквизитов()

// Проверяет правильность заполнения шапки документа.
// Если какой-то из реквизитов шапки, влияющий на проведение не заполнен или
// заполнен не корректно, то выставляется флаг отказа в проведении.
// Проверяется также правильность заполнения реквизитов ссылочных полей документа.
// Проверка выполняется по объекту и по выборке из результата запроса по шапке.
//
// Параметры: 
//  ДокументОбъект             - объект проводимого документа, 
//  СтруктураОбязательныхПолей - структура, содержащая имена полей, которые собственно и надо проверить.
//  Отказ                      - флаг отказа в проведении.
//  Заголовок                  - строка, заголовок сообщения об ошибке проведения.
//
Процедура ПроверитьЗаполнениеШапкиДокумента(ДокументОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок) Экспорт

	ТипыПланыСчетов     = ПланыСчетов.ТипВсеСсылки();
	МетаданныеРеквизиты = ДокументОбъект.Метаданные().Реквизиты;

	Для каждого КлючЗначение Из СтруктураОбязательныхПолей Цикл

		Значение = ДокументОбъект[КлючЗначение.Ключ];
		ПредставлениеРеквизита = МетаданныеРеквизиты[КлючЗначение.Ключ].Представление();

		Если НЕ ЗначениеЗаполнено(Значение) Тогда 

			Если НЕ ЗначениеЗаполнено(КлючЗначение.Значение) Тогда //
				СтрокаСообщения = "Не заполнено значение реквизита """ + СокрЛП(ПредставлениеРеквизита) + """!";
			Иначе
				СтрокаСообщения = КлючЗначение.Значение;
			КонецЕсли;

			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(СтрокаСообщения, Отказ, Заголовок);
			Отказ = Истина;
		ИначеЕсли ТипыПланыСчетов.СодержитТип(ТипЗнч(Значение)) тогда

			Если Значение.ЗапретитьИспользоватьВПроводках Тогда
				СтрокаСообщения = "Реквизит """ + СокрЛП(ПредставлениеРеквизита) + """ : счет " + СокрЛП(Значение)+" """ + Значение.Наименование + """ нельзя использовать в проводках.";
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(СтрокаСообщения, Отказ, Заголовок);
				Отказ = Истина;

			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если СтруктураОбязательныхПолей.Свойство("Организация") и СтруктураОбязательныхПолей.Свойство("ДоговорКонтрагента") тогда

		// Если в документе есть организация и договор - провести проверку на соответствие
		//Организация в документе должна совпадать с организацией, указанной в договоре взаиморасчетов.
		Организация = ДокументОбъект.Организация;
		ДоговорКонтрагента = ДокументОбъект.ДоговорКонтрагента;
		Если ТипЗнч(ДоговорКонтрагента) = Тип("СправочникСсылка.ДоговорыКонтрагентов") тогда
			бит_МеханизмыТиповых.ПроверитьСоответствиеОрганизацииДоговоруВзаиморасчетов(Организация, ДоговорКонтрагента, ДоговорКонтрагента.Организация, Отказ, Заголовок);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры // ПроверитьЗаполнениеШапкиДокумента()

Процедура ПроверкаДубля(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка
	               |ИЗ
	               |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ КАК ОК_НачислениеРезерваПодОбесценениеДЗ
	               |ГДЕ
	               |	ОК_НачислениеРезерваПодОбесценениеДЗ.Проведен = ИСТИНА
	               |	И ОК_НачислениеРезерваПодОбесценениеДЗ.Дата = &Дата
	               |	И ОК_НачислениеРезерваПодОбесценениеДЗ.Организация = &Организация
	               |	И НЕ ОК_НачислениеРезерваПодОбесценениеДЗ.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Дата",КонецМесяца(Дата));
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Док = Результат.Выгрузить()[0].Ссылка;
		Сообщить("Документ не проведен. Существует проведенный документ: " + Док);
		Отказ = Истина;
	КонецЕсли;
	
	
КонецПроцедуры


Функция ПодготовитьТаблицуДанные(СтруктураШапкиДокумента)

	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.СчетМСФО,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Контрагент,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Договор,
	                |	СУММА(ОК_НачислениеРезерваПодОбесценениеДЗДанные.СуммаСписания) КАК СуммаСписания,
	                |	""Начисление резерва под обесценение дебиторской задолженности"" КАК Содержание
	                |ИЗ
	                |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ.Данные КАК ОК_НачислениеРезерваПодОбесценениеДЗДанные
	                |ГДЕ
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Ссылка = &Ссылка
	                |	И (ОК_НачислениеРезерваПодОбесценениеДЗДанные.НачислятьРезерв = ИСТИНА
	                |			ИЛИ ОК_НачислениеРезерваПодОбесценениеДЗДанные.БИТ_НачислятьРезерв = ИСТИНА)
	                |	И НЕ ОК_НачислениеРезерваПодОбесценениеДЗДанные.СчетМСФО = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	                |	И ОК_НачислениеРезерваПодОбесценениеДЗДанные.СуммаСписания <> 0
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.СчетМСФО,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Контрагент,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗДанные.Договор
	                |
	                |ОБЪЕДИНИТЬ ВСЕ
	                |
	                |ВЫБРАТЬ
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Счет,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Контрагент,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Договор,
	                |	СУММА(ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.СуммаПроводки),
	                |	""Корректировка начисления резерва по данным учета""
	                |ИЗ
	                |	Документ.ОК_НачислениеРезерваПодОбесценениеДЗ.БИТ_КорректировкаРезерва КАК ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва
	                |ГДЕ
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.СуммаПроводки <> 0
	                |	И ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Ссылка = &Ссылка
	                |	И НЕ ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Счет = ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.ПустаяСсылка)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Счет,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Контрагент,
	                |	ОК_НачислениеРезерваПодОбесценениеДЗБИТ_КорректировкаРезерва.Договор";
	Запрос.УстановитьПараметр("Ссылка",СтруктураШапкиДокумента.Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
КонецФункции

Процедура СформироватьДвиженияНачислениеРезерва(СтруктураШапкиДокумента,СтрокаТаблицы,СтруктураПараметров)
	
	Запись = Движения.бит_Дополнительный_2.Добавить();
	бит_му_ОбщегоНазначения.ЗаполнитьЗаписьРегистраМУ(Запись, СтруктураПараметров);											   
	
	// Заполним аналитику счета Дт и Кт.
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Объект" , СтруктураШапкиДокумента.ОбъектСтроительства);
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Функции",	СтруктураШапкиДокумента.бит_БК_ЦФО);
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетДт, Запись.СубконтоДт, "Периоды", СтруктураШапкиДокумента.Период);

	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "Контрагенты"		   , СтрокаТаблицы.Контрагент);
	бит_му_ОбщегоНазначения.УстановитьСубконто(Запись.СчетКт, Запись.СубконтоКт, "ДоговорыКонтрагентов", СтрокаТаблицы.Договор);
	Запись.ВидДвиженияМСФО = СтруктураПараметров.ВидДвижения;
	Запись.СуммаРегл  	= СтрокаТаблицы.СуммаСписания;
	Запись.СуммаУпр    = СтрокаТаблицы.СуммаСписания;
	Запись.СуммаМУ    = СтрокаТаблицы.СуммаСписания;
	//БИТ_Егоров+
	Запись.Содержание = СтрокаТаблицы.Содержание;
	//БИТ_Егоров-
КонецПроцедуры

Процедура СформироватьСторноЗаписи()
	ТаблицаДвижений = Движения.бит_Дополнительный_2.Выгрузить();
	//ДатаСторно = КонецДня(Дата) +1;  //ОК- Аверьянова #832#
	Для Каждого СтрокаТаблицы Из ТаблицаДвижений Цикл
		
		НоваяЗапись = Движения.бит_Дополнительный_2.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗапись,СтрокаТаблицы);
		бит_му_ОбщегоНазначения.УстановитьСубконто(НоваяЗапись.СчетДт, НоваяЗапись.СубконтоДт, "Объект" , ОбъектСтроительства);
		бит_му_ОбщегоНазначения.УстановитьСубконто(НоваяЗапись.СчетДт, НоваяЗапись.СубконтоДт, "Функции", бит_БК_ЦФО);
		бит_му_ОбщегоНазначения.УстановитьСубконто(НоваяЗапись.СчетДт, НоваяЗапись.СубконтоДт, "Периоды", Период);
        
		бит_му_ОбщегоНазначения.УстановитьСубконто(НоваяЗапись.СчетКт, НоваяЗапись.СубконтоКт, "Контрагенты"		   , СтрокаТаблицы.СубконтоКт2);
		бит_му_ОбщегоНазначения.УстановитьСубконто(НоваяЗапись.СчетКт, НоваяЗапись.СубконтоКт, "ДоговорыКонтрагентов", СтрокаТаблицы.СубконтоКт1);
		НоваяЗапись.Период = ДатаСторно;
		НоваяЗапись.СуммаРегл  	= -СтрокаТаблицы.СуммаРегл;
		НоваяЗапись.СуммаУпр    = -СтрокаТаблицы.СуммаУпр;
		НоваяЗапись.СуммаМУ    = -СтрокаТаблицы.СуммаМУ;
	КонецЦикла; 
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)Экспорт
	 бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
КонецПроцедуры

///  СБ Прудникова 2011-12-21

Функция ПолучитьНастройку(Группа, ИмяНастройки, Отказ)
	// +СБ. Кузнецова С. 2014-11-12 
	 //Отбор = Новый Структура("Группа,ИмяНастройки",Группа,ИмяНастройки);
	 Отбор = Новый Структура("Группа,ИмяНастройки, СБ_ПорядковыйНомерЗначения",Группа,ИмяНастройки, 0);
	// -СБ. Кузнецова С.
	 Структура = РегистрыСведений.бит_му_Настройки.Получить(Отбор);
	 Если Структура.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Структура.Значение) Тогда 
		 Сообщить("Не установлено значение настройки """+Группа+""" в регистре Настройки МСФО """+ИмяНастройки+""".");//,,,, Отказ);		
	 Иначе
		 Возврат Структура.Значение; 
	 КонецЕсли;
	 
 КонецФункции


//БИТ_Егоров+
Функция БИТ_ЗаполнитьКорректировкуРезерва()Экспорт
	
	ИсходныеДанные = Данные.Выгрузить(,"СчетМСФО, Контрагент, Договор, СуммаСписания");
	ИсходныеДанные.Свернуть("СчетМСФО, Контрагент, Договор","СуммаСписания");
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ИсходныеДанные.Контрагент,
	              |	ИсходныеДанные.СчетМСФО КАК Счет,
	              |	ИсходныеДанные.СуммаСписания,
	              |	ИсходныеДанные.Договор
	              |ПОМЕСТИТЬ ВТ_ИсходныеДанные
	              |ИЗ
	              |	&ИсходныеДанные КАК ИсходныеДанные
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	бит_Дополнительный_2Остатки.Субконто1 КАК Контрагент,
	              |	бит_Дополнительный_2Остатки.Субконто2 КАК Договор,
	              |	бит_Дополнительный_2Остатки.Счет,
	              |	СУММА(бит_Дополнительный_2Остатки.СуммаРеглОстатокДт) КАК СуммаРеглОстаток
	              |ПОМЕСТИТЬ ВТ_ДанныеМСФО
	              |ИЗ
	              |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	              |			&Период,
	              |			Счет В ИЕРАРХИИ
	              |				(ВЫБРАТЬ
	              |					ВТ_ИсходныеДанные.Счет
	              |				ИЗ
	              |					ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные),
	              |			,
	              |			(Субконто1, Субконто2) В
	              |				(ВЫБРАТЬ
	              |					ВТ_ИсходныеДанные.Контрагент,
	              |					ВТ_ИсходныеДанные.Договор
	              |				ИЗ
	              |					ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные)) КАК бит_Дополнительный_2Остатки
	              |
	              |СГРУППИРОВАТЬ ПО
	              |	бит_Дополнительный_2Остатки.Субконто1,
	              |	бит_Дополнительный_2Остатки.Субконто2,
	              |	бит_Дополнительный_2Остатки.Счет
	              |;
	              |
	              |////////////////////////////////////////////////////////////////////////////////
	              |ВЫБРАТЬ
	              |	ВТ_ДанныеМСФО.СуммаРеглОстаток КАК ДанныеУчета,
	              |	ВТ_ИсходныеДанные.Счет КАК Счет,
	              |	ВТ_ИсходныеДанные.Контрагент,
	              |	ВТ_ИсходныеДанные.Договор,
	              |	ВТ_ИсходныеДанные.СуммаСписания КАК НачисленныйРезерв,
	              |	ЕСТЬNULL(ВТ_ДанныеМСФО.СуммаРеглОстаток, 0) - ВТ_ИсходныеДанные.СуммаСписания КАК Дельта,
	              |	ВЫБОР
	              |		КОГДА ЕСТЬNULL(ВТ_ДанныеМСФО.СуммаРеглОстаток, 0) - ВТ_ИсходныеДанные.СуммаСписания < 0
	              |			ТОГДА ЕСТЬNULL(ВТ_ДанныеМСФО.СуммаРеглОстаток, 0) - ВТ_ИсходныеДанные.СуммаСписания
	              |		ИНАЧЕ 0
	              |	КОНЕЦ КАК СуммаПроводки
	              |ИЗ
	              |	ВТ_ИсходныеДанные КАК ВТ_ИсходныеДанные
	              |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеМСФО КАК ВТ_ДанныеМСФО
	              |		ПО ВТ_ИсходныеДанные.Контрагент = ВТ_ДанныеМСФО.Контрагент
	              |			И ВТ_ИсходныеДанные.Договор = ВТ_ДанныеМСФО.Договор
	              |			И ВТ_ИсходныеДанные.Счет = ВТ_ДанныеМСФО.Счет
				  
				  
				   // BIT AMerkulov 23.12.2014 ++				   
				   |ГДЕ
				   |	НЕ 	ВТ_ИсходныеДанные.Контрагент В
				   |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |					бит_СобственныеКонтрагенты.Контрагент
				   |				ИЗ
				   |					РегистрСведений.бит_СобственныеКонтрагенты КАК бит_СобственныеКонтрагенты)
				   |
				   // BIT AMerkulov 23.12.2014 --					   
				  
				 | ";
				  
	Запрос.УстановитьПараметр("ИсходныеДанные" , ИсходныеДанные);
	Запрос.УстановитьПараметр("Период", Новый Граница (КонецМесяца(ПериодФормирования), ВидГраницы.Включая));
	ТаблицаКорректировкаРезерва = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаКорректировкаРезерва;
КонецФункции
//БИТ_Егоров-