&НаСервере
Функция ЗаполнитьТП_Сервер()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Организация,
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.Контрагент,
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ДоговорКонтрагента,
	 |	УстановкаВидовРасчетовПоДоговорамСрезПоследних.ВидРасчета
	 |ИЗ
	 |	РегистрСведений.УстановкаВидовРасчетовПоДоговорам.СрезПоследних(&Дата, Организация = &Организация) КАК УстановкаВидовРасчетовПоДоговорамСрезПоследних";
	 Запрос.УстановитьПараметр("Дата",Объект.Дата);
	 Запрос.УстановитьПараметр("Организация",Объект.Организация);
	 Данные = Запрос.Выполнить().Выгрузить();
	 Объект.Принадлежности.Загрузить(Данные);
	 
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТП(Команда)
	
	ЗаполнитьТП_Сервер();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Объект.Ссылка.Пустая() Тогда // проверить объект на то, что он еще не внесен в ИБ
		// Заполнить реквизиты значениями по умолчанию.
		Объект.Ответственный =ПользователиКлиентСервер.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	Элементы.Принадлежности.ТекущиеДанные.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
	Элементы.Принадлежности.ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоДоговорам.ПустаяСсылка");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Копирование = Истина Тогда
		Элементы.Принадлежности.ТекущиеДанные.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		Элементы.Принадлежности.ТекущиеДанные.ВидРасчета = ПредопределенноеЗначение("Перечисление.ВидыРасчетовПоДоговорам.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииДоговора(Элемент)
	
	СтруктураОтбора = Новый Структура("Контрагент,ДоговорКонтрагента");
	СтруктураОтбора.Вставить("Контрагент", Элементы.Принадлежности.ТекущиеДанные.Контрагент);
	СтруктураОтбора.Вставить("ДоговорКонтрагента", Элементы.Принадлежности.ТекущиеДанные.ДоговорКонтрагента);
	Данные = Объект.Принадлежности.НайтиСтроки(СтруктураОтбора);
	Если (Данные.Количество() > 1) тогда
		
		Предупреждение("По данному договору уже указан вид расчета!");
		Элементы.Принадлежности.ТекущиеДанные.ДоговорКонтрагента = ПредопределенноеЗначение("Справочник.ДоговорыКонтрагентов.ПустаяСсылка");
		//ТЗ = Принадлежности.Выгрузить();
		//ТЗ.Свернуть("Контрагент,ДоговорКонтрагента");
		//Принадлежности.Загрузить(ТЗ);
		//ОтменаРедактирования = истина; 			
	КонецЕсли;
	
КонецПроцедуры

	