
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиДополнительныхПравПользователей;
		
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПравоПриИзменении(Элемент)
	
	Если ЭтотТипБулево(Запись.Право) Тогда
		Запись.Значение = Истина;	
	КонецЕсли; 
	
КонецПроцедуры // ПравоПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЭтотТипБулево(Право)

	Результат = Право.ТипЗначения = Новый ОписаниеТипов("Булево");

	Возврат Результат;
	
КонецФункции // ЭтотТипБулево()

#КонецОбласти