
#Область ОбработчикиСобытийФормы	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    ЗначениеСт  = Параметры.ЗначениеСт;
    СписокТипов = Параметры.СписокТипов;
    
    СтрОтборПоВладельцу = Параметры.СтрОтборПоВладельцу;
    Если СтрОтборПоВладельцу <> Неопределено Тогда
        бит_ОбщегоНазначенияКлиентСервер.УстановитьПараметрыВыбораЭлемента(Элементы.ЗначениеСт, СтрОтборПоВладельцу);
    КонецЕсли;
    
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗначениеСтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    
    бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
                                                       , Элементы.ЗначениеСт
                                                       , ЭтотОбъект
                                                       , "ЗначениеСт"
        											   , СписокТипов
        											   , СтандартнаяОбработка);
                                                       
КонецПроцедуры // ЗначениеСтНачалоВыбора()

#КонецОбласти

#Область ОбработчикиКомандФормы	

&НаКлиенте
Процедура ОК(Команда)
    
    Закрыть(ЗначениеСт);
    
КонецПроцедуры// ОК()

&НаКлиенте
Процедура Отмена(Команда)
   
    Закрыть();
    
КонецПроцедуры // Отмена()

#КонецОбласти

