
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ТекстОшибки = "";
	
	Если ЭтотОбъект.Количество() <> 1 Тогда
	
		МассивНепроверяемыхРеквизитов = Новый Массив;
		МассивНепроверяемыхРеквизитов.Добавить("Отсрочка");
		МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмерения");
		МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
		Для каждого ПроверяемаяЗапись Из ЭтотОбъект Цикл
	
			Если НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.Отсрочка)
				И ПроверяемаяЗапись.ТоварнаяГруппа.ЕстьОтсрочка Тогда
				
				ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Отсрочка"" не заполнено;" + Символы.ПС;
			
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ПроверяемаяЗапись.Отсрочка)
				И НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.ЕдиницаИзмерения) Тогда
				
				ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Единица измерения"" не заполнено;" + Символы.ПС;
				
			КонецЕсли;
			
			Если ПроверяемаяЗапись.Удалена
				И НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.ДатаОкончания) Тогда
				
				ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и удаляемой товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Дата окончания"" не заполнено;" + Символы.ПС;
				
			КонецЕсли;
		
		КонецЦикла;
		
	Иначе
		
		ПроверяемаяЗапись = ЭтотОбъект[0];
		МассивНепроверяемыхРеквизитов = Новый Массив;
		
		Если НЕ ПроверяемаяЗапись.ТоварнаяГруппа.ЕстьОтсрочка Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Отсрочка");
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.Отсрочка) Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмерения");
		КонецЕсли; 
		
		Если НЕ ПроверяемаяЗапись.Удалена Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончания");
		КонецЕсли; 
		
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
		
	КонецЕсли; 
	
	Для каждого ПроверяемаяЗапись Из ЭтотОбъект Цикл
		
		
		
		Если НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.Отсрочка)
			И ПроверяемаяЗапись.ТоварнаяГруппа.ЕстьОтсрочка Тогда
			
			ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Отсрочка"" не заполнено;" + Символы.ПС;
		
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ПроверяемаяЗапись.Отсрочка)
			И НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.ЕдиницаИзмерения) Тогда
			
			ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Единица измерения"" не заполнено;" + Символы.ПС;
			
		КонецЕсли;
		
		Если ПроверяемаяЗапись.Удалена
			И НЕ ЗначениеЗаполнено(ПроверяемаяЗапись.ДатаОкончания) Тогда
			
			ТекстОшибки = ТекстОшибки + "Для договора """ + ПроверяемаяЗапись.ДоговорКонтрагента + """ и удаляемой товарной группы """ + ПроверяемаяЗапись.ТоварнаяГруппа + """ поле ""Дата окончания"" не заполнено;" + Символы.ПС;
			
		КонецЕсли;
	
	КонецЦикла; 
	
	Если ТекстОшибки <> "" Тогда
		
		екстОшибки = ТекстОшибки + "Запись набора прервана.";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки,,,,Отказ);
	
	КонецЕсли; 
	
КонецПроцедуры