
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
 	ТекущийОбъект.Значение = Новый ХранилищеЗначения(ЭтаФорма.РеквизитВыбораЗначения);
	ПредставлениеЗначения = "";
	
	Попытка	
		ПредставлениеЗначения = Строка(ЭтаФорма.РеквизитВыбораЗначения);	
	Исключение
	КонецПопытки;
	ТекущийОбъект.ПредставлениеЗначения = ПредставлениеЗначения;
КонецПроцедуры            


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	//Вставить содержимое обработчика
	ЭтаФорма.РеквизитВыбораЗначения = ТекущийОбъект.Значение.Получить();
	//
КонецПроцедуры


&НаКлиенте
Процедура РеквизитВыбораЗначенияОчистка(Элемент, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Истина;
КонецПроцедуры


&НаКлиенте
Процедура РеквизитВыбораЗначенияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ПолеВыбораЗначения.ВыбиратьТип = ЭтаФорма.РеквизитВыбораЗначения = Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура РеквизитВыбораЗначенияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка)
	Элемент.ВыбиратьТип = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура РеквизитВыбораЗначенияПриИзменении(Элемент)
	Если ТипЗнч(ЭтаФорма.РеквизитВыбораЗначения) = Тип("СписокЗначений") Тогда 
		ЭтаФорма.РеквизитВыбораЗначения.ТипЗначения = ЭтаФорма.Список.ТипЗначения;
	КонецЕсли;
КонецПроцедуры


