
&НаКлиенте
// Процедура - обработчик команды "СправочнаяИнформацияОбщая"
// Открывает форму справочной информации с содержанием привязанным к контексту вызова.
// 
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ФормаИсточника = ПолучитьФорму("Обработка.бит_си_ИсточникСправочникСтатьи.Форма.ФормаУправляемая");
	ПараметрыФормы = Новый Структура("СписокЗакладок, ПараметрОткрытия");
	
	ПараметрыФормы.СписокЗакладок = ФормаИсточника.ПолучитьМассивИсточников("бит_си_ИсточникСправочникСтатьи");
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("УправляемаяФорма") Тогда
		ПараметрыФормы.ПараметрОткрытия = ФормаИсточника.ПреобразоватьИмяФормы(ПараметрыВыполненияКоманды.Источник.ИмяФормы) 
	ИначеЕсли ТипЗнч(ПараметрыВыполненияКоманды.Источник) = Тип("ОкноКлиентскогоПриложения") Тогда
		ТекФорма = ПараметрыВыполненияКоманды.Источник.ПолучитьСодержимое();
		Если НЕ ТипЗнч(ТекФорма) = Тип("УправляемаяФорма") Тогда
			ПараметрыФормы.ПараметрОткрытия = Неопределено;
		КонецЕсли;
		ПараметрыФормы.ПараметрОткрытия = ФормаИсточника.ПреобразоватьИмяФормы(ТекФорма.ИмяФормы) 
	Иначе
		ПараметрыФормы.ПараметрОткрытия = Неопределено;
	КонецЕсли;
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.ОбычноеПриложение Тогда
		#Если ТолстыйКлиентОбычноеПриложение Тогда
		Форма = Обработки.бит_си_ИсточникСправочникСтатьи.ПолучитьФорму();
		Форма.ПараметрОткрытия = ПараметрыФормы.ПараметрОткрытия;
		Форма.Открыть();
		#КонецЕсли
	Иначе
		Форма = ПолучитьФорму("Обработка.бит_си_СправочнаяИнформация.Форма", ПараметрыФормы, "бит_си_СправочнаяИнформация", Ложь);
		Если Форма.Открыта() Тогда
			Оповестить("бит_си_ОбновлениеСодержимого", ПараметрыФормы);
		Иначе
			Форма.Открыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКоманды()

