
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Заявка") Тогда
		фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	// Заполним реквизиты формы значениями из параметров.
	Заявка 			 = Параметры.Заявка;
	ПлатежнаяПозиция = Параметры.ПлатежнаяПозиция;
	
	ЗакрыватьПриВыборе = Ложь;
	
	ЗаполнитьТаблицуОстатков();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаОстатков

&НаКлиенте
Процедура ТаблицаОстатковВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.ТаблицаОстатков.ТекущиеДанные;
	
	ОповеститьОВыборе(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗаполнитьТаблицуОстатков();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет таблицу остатков.
// 
// Параметры:
//  Нет.
// 
&НаСервере 
Процедура ЗаполнитьТаблицуОстатков()
	
	// Получим таблицу остатков по строкам распределения.
	ТаблицаОстатковИсточник = бит_Казначейство.ПолучитьОстаткиПоСтрокамРаспределения(Заявка, ПлатежнаяПозиция);
	
	ТаблицаОстатков.Загрузить(ТаблицаОстатковИсточник);
	
КонецПроцедуры // ЗаполнитьТаблицуОстатков()

#КонецОбласти   