
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДанных.Значение = НачалоПериода;
	ПараметрДанных.Использование = Истина;//ЗначениеЗаполнено(НачалоПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДанных.Значение = КонецДня(КонецПериода);
	ПараметрДанных.Использование = Истина;//ЗначениеЗаполнено(КонецПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	ПараметрДанных.Значение = Организация;
	ПараметрДанных.Использование = ЗначениеЗаполнено(Организация);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ФильтрПустых");
	ПараметрДанных.Значение = ФильтрПустых;
	ПараметрДанных.Использование = Истина//ЗначениеЗаполнено(ФильтрПустых);
КонецПроцедуры
