
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("ПолныеПрава") Тогда 
		Элементы.Настройки.Видимость = Ложь;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(НастройкиМеханизмаИмпортаДанных, "Группа", "ЗагрузкаИнициаторовБОСС");
	
	мОбновление = Ложь;
	Если Параметры.Свойство("мОбновление") Тогда 
		мОбновление = Параметры.мОбновление;
	КонецЕсли;
	
	Если мОбновление Тогда
		Элементы.Загрузка.Видимость=ложь;
		Элементы.НовыеДанные.Видимость=истина;
		ЭтаФорма.Заголовок = "Обновление данных из БОСС";
	Иначе
		Элементы.НовыеДанные.Видимость=ложь;
		ЭтаФорма.Заголовок = "Загрузка данных из БОСС";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзБОССНажатие(Элемент)
	
	ЗагрузитьИзБОССНажатиеНаСервере();
	НайтиПоEmail();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзБОССНажатиеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьИзБОСС();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоEmail() Экспорт
	Адрес = НайтиПоEmailНаСервере();
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда 
		ОткрытьФорму("Обработка.ОК_ЗагрузкаИнициатораБОСС.Форма.ФормаВыбораИнициатора", Новый Структура("Адрес", Адрес),,,,, Новый ОписаниеОповещения("НайтиПоEmailЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоEmailЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат <> Неопределено Тогда 
		Объект.Элемент = Результат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиПоEmailНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_БК_Инициаторы.Ссылка
	|ИЗ
	|	Справочник.бит_БК_Инициаторы КАК бит_БК_Инициаторы
	|ГДЕ
	|	бит_БК_Инициаторы.DomainName В (&Email)";
		
	МассивDomainName = Новый Массив;
	МассивDomainName.Добавить(Объект.EmailПоиска);
	Если Лев(Объект.EmailПоиска,5) <> "OKEY\" Тогда
		МассивDomainName.Добавить("OKEY\" + Объект.EmailПоиска); 
	КонецЕсли;	
	Запрос.УстановитьПараметр("Email", МассивDomainName);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
		
	Если ТЗРезультат.Количество() > 1 Тогда 
		Возврат ПоместитьВоВременноеХранилище(ТЗРезультат, УникальныйИдентификатор);
	ИначеЕсли ТЗРезультат.Количество() = 1 Тогда 
		Объект.Элемент = ТЗРезультат[0].Ссылка;
		Сообщить("Найден инициатор с заданным доменным именем и помещен в реквизит ""Элемент справочника""");
	Иначе 
		Объект.Элемент = Справочники.бит_БК_Инициаторы.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ОсновнаяПанельПриСменеСтраницы_Сервер()
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Настройки Тогда 
		Если Команды.Найти("ОбновитьПодключение") = Неопределено Тогда 
			Команда = Команды.Добавить("ОбновитьПодключение");
			Команда.Действие = "КнопкаОбновитьПодключение";
		КонецЕсли;
		Кнопка = Элементы.Добавить("ОбновитьПодключение", Тип("КнопкаФормы"), КоманднаяПанель);
		Кнопка.ИмяКоманды = "ОбновитьПодключение";
		Кнопка.Заголовок = "Обновить подключение";
	Иначе 
		Кнопка = Элементы.Найти("ОбновитьПодключение");
		Если Кнопка <> Неопределено Тогда 
			Элементы.Удалить(Кнопка);
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОсновнаяПанельПриСменеСтраницы_Сервер();	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбновитьПодключение(Команда)
	КнопкаОбновитьПодключениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КнопкаОбновитьПодключениеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ПодключеноКБазе = Ложь;
	_объект.ПодключениеКБазе();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНажатие(Элемент)
	СохранитьНажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНажатиеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.СохранитьЭлементСправочника();	
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура EmailПоискаПриИзменении(Элемент)
	НайтиПоEmail();
КонецПроцедуры

&НаКлиенте
Процедура ИзмененыеЗаписиНажатие(Элемент)
	// Вставить содержимое обработчика.
	НайтиИзмененныеЗаписи_Вызов_Функции();
	УстановитьФлажки(истина,истина);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельДокументыНаЭкспортУстановитьФлажки(Команда)
	УстановитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельДокументыНаЭкспортСнятьФлажки(Команда)
	УстановитьФлажки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Флаг,ЕслиЕстьОднофамильцУбратьФлажок=ложь)
	Для каждого СтрокаДокумента из Объект.ДанныеДляОбновления Цикл
		Если Элементы.ДанныеДляОбновления.ПроверитьСтроку(СтрокаДокумента.ПолучитьИдентификатор()) Тогда
			СтрокаДокумента.Выгружать = Флаг и ?(ЕслиЕстьОднофамильцУбратьФлажок и СтрокаДокумента.ЕстьОднофамилец,ложь,истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //УстановитьФлажки

&НаСервере
Функция НовыеДанные(Элемент,Поле,новыеданные)	
	
	//ОКЕЙ Землянников К.А.(СофтЛаб) Начало 2019-05-07 (#3344)
	//Если ЗначениеЗаполнено(новыеданные) тогда
	//ОКЕЙ Землянников К.А.(СофтЛаб) Конец 2019-05-07 (#3344)	
	Элемент[Поле]=новыеданные;
	//ОКЕЙ Землянников К.А.(СофтЛаб) Начало 2019-05-07 (#3344)
	//конецесли;
	//ОКЕЙ Землянников К.А.(СофтЛаб) Конец 2019-05-07 (#3344)
	
конецфункции	

&НаКлиенте
Процедура КоманднаяПанель2ЗаписатьИзБОСС(Команда)
	Если Объект.ДанныеДляОбновления.Количество()=0 тогда
		ПоказатьПредупреждение(Неопределено, "Список с обновлениями пуст! Выполните заполнение обновлений");
	иначе	
		КоманднаяПанель2ЗаписатьИзБОССНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КоманднаяПанель2ЗаписатьИзБОССНаСервере()
	Для каждого СтрокаДокумента из Объект.ДанныеДляОбновления Цикл
		Если СтрокаДокумента.Выгружать тогда
			Элемент_=СтрокаДокумента.Элемент.ПолучитьОбъект();
			Попытка
				Элемент_.Заблокировать();
				НовыеДанные(Элемент_,"Email",		СтрокаДокумента.БОСС_Email);
				НовыеДанные(Элемент_,"Руководитель",СтрокаДокумента.БОСС_ManFullName);
				НовыеДанные(Элемент_,"Отдел",		СтрокаДокумента.БОСС_FunctionName);			
				НовыеДанные(Элемент_,"Должность",	СтрокаДокумента.БОСС_Title);						
				//ОКЕЙ Землянников К.А.(СофтЛаб) Начало 2019-05-07 (#3344)
				НовыеДанные(Элемент_,"Наименование",	СтрокаДокумента.FullName);
				//ОКЕЙ Землянников К.А.(СофтЛаб) Конец 2019-05-07 (#3344)
				
				БОСС_UserLogin = СтрокаДокумента.БОСС_UserLogin;
				Если Лев(БОСС_UserLogin,5) <> "OKEY\" Тогда
					БОСС_UserLogin = "OKEY\" + БОСС_UserLogin; 
				КонецЕсли;
		
				НовыеДанные(Элемент_,"DomainName",	БОСС_UserLogin);						
				Элемент_.Записать();
			Исключение
				    сообщить( ОписаниеОшибки());
			конецпопытки
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция НайтиИзмененныеЗаписи_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.НайтиИзмененныеЗаписи();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции
