
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
КонецПроцедуры

//ОКЕЙ Назаренко Д.В. (СофтЛаб) Начало 2021-05-13 (#4139)
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ЗначениеЗаполнено(Объект.Родитель)
		И ПредупредитьПроВидАП(Объект.Ссылка, Объект.Родитель, Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
				
		Пояснение = "У вышестоящей группы НГ <" + Объект.Родитель + "> назначен Вид АП. Вид АП для данной группы необходимо назначить вручную";
		ПоказатьОповещениеПользователя(Объект.Наименование, 
										?(Не ЗначениеЗаполнено(Объект.Ссылка),"",ПолучитьНавигационнуюСсылку(Объект.Ссылка)),
										Пояснение,
										,
										СтатусОповещенияПользователя.Важное);
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредупредитьПроВидАП(НоменклатурнаяГруппа, Родитель, ЭтоНовый)
	
	Если Не ЭтоНовый Тогда
		ЗначениеВидАП = УправлениеСвойствами.ЗначенияСвойств(НоменклатурнаяГруппа, Ложь, Истина, "ВидАП");
		Если ЗначениеВидАП.Количество() > 0
			И ЗначениеЗаполнено(ЗначениеВидАП[0].Значение) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	ЗначениеВидАП = УправлениеСвойствами.ЗначенияСвойств(Родитель, Ложь, Истина, "ВидАП");
	Если ЗначениеВидАП.Количество() > 0
		И ЗначениеЗаполнено(ЗначениеВидАП[0].Значение) Тогда
		Возврат Истина;
	КонецЕсли;	
	
	Возврат Ложь;
КонецФункции

//ОКЕЙ Назаренко Д.В. (СофтЛаб) Конец 2021-05-13 (#4139) 


