//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-10-29 (#3842)
&НаКлиенте
Процедура ок_СоздатьЗаявкиРасходованияДС(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущаяСтрока;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	стрРезультат = ок_СоздатьЗаявкиРасходованияДСНаСервере(ТекущаяСтрока);
	Для Каждого пСозданныйДокумент ИЗ стрРезультат.СозданныеДокументы Цикл 
		
		пТекст = НСтр("ru = 'На основании создан документ %1'");
		пТекст = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(пТекст,пСозданныйДокумент);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(пТекст,пСозданныйДокумент);
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(стрРезультат.Ошибки) Тогда 
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(стрРезультат.Ошибки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ок_СоздатьЗаявкиРасходованияДСНаСервере(Ссылка)
	
	Возврат ОК_ОбщегоНазначения.СоздатьЗаявкиРасходованияДСНаСервере(Ссылка);
	
КонецФункции
//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-10-29 (#3842)