
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Список") 
		И ТипЗнч(Параметры.Список) = Тип("СписокЗначений") Тогда
	
		Список.ЗагрузитьЗначения(Параметры.Список.ВыгрузитьЗначения());
	
	КонецЕсли; 
	
	СпособРасчетаАккруалов	= ОК_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НачислениеАккруалов", "СпособРасчетаАккруалов", 1);
	КоличествоПотоков		= ОК_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("НачислениеАккруалов", "КоличествоПотоков", 5);
	
	Элементы.КоличествоПотоков.Доступность = СпособРасчетаАккруалов = 1
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	МассивЦФО = Новый Массив;
	Для каждого ЭлементСпискаЗначений Из Список Цикл
		Если НЕ ЭлементСпискаЗначений.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		МассивЦФО.Добавить(ЭлементСпискаЗначений.Значение);
	КонецЦикла; 
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("МассивЦФО", МассивЦФО);
	СтруктураПараметров.Вставить("СпособРасчетаАккруалов", СпособРасчетаАккруалов);
	СтруктураПараметров.Вставить("КоличествоПотоков", КоличествоПотоков);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкуТолькоВыделенным(Команда)
	
	Для каждого ЭлементСпискаЗначений Из Список Цикл
		Если НЕ ЭлементСпискаЗначений.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		ЭлементСпискаЗначений.Пометка = Ложь;
	КонецЦикла;
	
	Для каждого ВыделеннаяСтрока Из Элементы.Список.ВыделенныеСтроки Цикл
		
		ЭлементСпискаЗначений = Список.НайтиПоИдентификатору(ВыделеннаяСтрока);
		
		Если ЭлементСпискаЗначений.Пометка Тогда
			Продолжить;
		КонецЕсли; 
		ЭлементСпискаЗначений.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СпособРасчетаАккруаловПриИзменении(Элемент)
	
	Элементы.КоличествоПотоков.Доступность = СпособРасчетаАккруалов = 1;
	
КонецПроцедуры

#КонецОбласти