
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийОбъект") Тогда
		
		ОбрОбъект = ДанныеФормыВЗначение(Параметры.ТекущийОбъект,Тип("ОбработкаОбъект.бит_ЗагрузкаПроформ"));
		
		ЗначениеВДанныеФормы(ОбрОбъект,Объект);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Команда","ОК");
	СтруктураПараметров.Вставить("ТекущийОбъект",Объект);
	
	Закрыть(СтруктураПараметров);
	
КонецПроцедуры

#КонецОбласти


