#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		Возврат;			
	КонецЕсли; 
		
КонецПроцедуры // ПриЗаписи()	

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Пояснение = НСтр("ru = 'Имя не соответствует требованиям к именам переменных.'") ;
	// Именем переменной, объявленной процедуры или функции может быть любая последовательность букв, 
	// цифр и знаков подчеркивания, начинающаяся с буквы или знака подчеркивания. 
	// Вновь создаваемые имена не должны совпадать с зарезервированными словами языка или именами свойств, 
	// непосредственно доступных в текущем контексте. 
	Попытка
		Тест = Новый Структура(Код); 
	Исключение
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"КОРРЕКТНОСТЬ","Имя",,,Пояснение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,"Код","Объект",Отказ);
	КонецПопытки;  
    Возврат; //ОК Довбешка Т. 14.12.2018 (к заданию 3048)
	// В дополнительных измерениях поддерживаются только ссылочные типы.
	ТекстСообщения  = "";
	УказанПравильно = СоставТиповУказанПравильно(ТекстСообщения);
	Если НЕ УказанПравильно Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ТипЗначения", "Объект",Отказ);
	КонецЕсли; 
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоставТиповУказанПравильно(ТекстСообщения)

	УказанПравильно = Истина;
	
	Если НЕ ЭтоНовый() Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИСТИНА КАК Поле1
		|ИЗ
		|	РегистрСведений.бит_НазначениеДополнительныхИзмерений КАК Таблица
		|ГДЕ
		|	Таблица.Аналитика = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
		
			Для каждого ТекЗначение Из ТипЗначения.Типы() Цикл
				Если НЕ ОбщегоНазначения.ЭтоСсылка(ТекЗначение) Тогда
					УказанПравильно = Ложь;					
					Прервать;
				КонецЕсли;	
			КонецЦикла; 
			
			Если НЕ УказанПравильно Тогда
				Пояснение = Нстр("ru = 'Вид аналитики используется в измерениях регистров. "
									 + "Допускаются только ссылочные типы.'");
				ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"КОРРЕКТНОСТЬ",Нстр("ru = 'Тип значения'"),,,Пояснение); 
			КонецЕсли; 
		КонецЕсли; 		
	КонецЕсли; 
	
	Возврат УказанПравильно;

КонецФункции

#КонецОбласти

#КонецЕсли