
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаПодбор(Команда)
	
	РежимОкна  = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;	
	ОткрытьФорму("Справочник.бит_Языки.Форма.ФормаПодбораУправляемая", , ЭтаФорма,,,,,РежимОкна);
	
КонецПроцедуры // КомандаПодбор()

#КонецОбласти

