
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаЗаявкиНаРасходВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура СхемаПлатежныйКалендарьВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");	
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма1","_Форма");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма2","_Форма");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
	
КонецПроцедуры	

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ СВВ {[+](фрагмент добавлен), Сапожников Вадим 24.09.2015 13:04:02
	ИжТиСи_СВД_Сервер.ОК_ВывестиРеквизиты(ЭтаФорма, "Обработка.бит_ПанельФункцийКазначейство.Форма");
	//-- СВВ}
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	ЭтоСемействоЕРП = бит_ОбщегоНазначения.ЭтоСемействоERP();
	
	ПодключитьСхемы(ЭтоСемействоЕРП);
	
	УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью элементов формы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП)
	
	Если ЭтоСемействоЕРП Тогда
				
		Элементы.РегистрСведений_битchr95СтатьиОборотовchr95СтатьиРегл_ФормаСписка.Видимость = Ложь;
		Элементы.Обработка_битchr95РабочееМестоОперативногоПланированияДДС_Форма.Видимость	 = Ложь;
		Элементы.Обработка_битchr95ФормированиеПланируемыхПоступлений_Форма.Видимость  		 = Ложь;
		Элементы.Обработка_битchr95ФормированиеПлатежныхДокументов_Форма.Видимость  		 = Ложь;
		
		Элементы.Отчет_битchr95ПлатежныйКалендарь_Форма.Видимость  		 				   = Ложь;
		Элементы.Отчет_битchr95ПланФактПоЗаявкам_Форма.Видимость  		 				   = Ложь;
		Элементы.Отчет_битchr95ПланФактПоПрогнозамПлатежей_Форма.Видимость  		 	   = Ложь;
		Элементы.Отчет_битchr95ПланФактныйАнализПоступленийДенежныхСредств_Форма.Видимость = Ложь;
		
		Элементы.Отчет_битchr95ОтчетПоПланируемымРасходамДенежныхСредств_Форма.Видимость     = Ложь;
		Элементы.Отчет_битchr95ОтчетПоПланируемымПоступлениямДенежныхСредств_Форма.Видимость = Ложь;
		
		Элементы.Отчет_битchr95НеснижаемыеОстатки_Форма.Видимость 				 = Ложь;
		Элементы.Отчет_битchr95СведенияОбОстаткахДенежныхСредств_Форма.Видимость = Ложь;
		Элементы.Отчет_битchr95СведенияОДвиженииДенежныхСредств_Форма.Видимость  = Ложь;
		
		Элементы.РегистрСведений_битchr95СоответствиеСтатейПоступленияИРасходованияДС_ФормаСписка.Видимость = Ложь;
		
		Элементы.Обработка_битchr95РабочееМестоОперативногоПланированияДДС_Форма1.Видимость = Ложь;
		Элементы.Обработка_битchr95ФормированиеПланируемыхПоступлений_Форма1.Видимость 		= Ложь;
		
		Элементы.Отчет_битchr95ПлатежныйКалендарь_Форма1.Видимость 			= Ложь;
		Элементы.Отчет_битchr95ПланФактПоЗаявкам_Форма1.Видимость 			= Ложь;
		Элементы.Отчет_битchr95ПланФактПоПрогнозамПлатежей_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95ПланФактныйАнализПоступленийДенежныхСредств_Форма1.Видимость   = Ложь;
		Элементы.Отчет_битchr95ОтчетПоПланируемымРасходамДенежныхСредств_Форма1.Видимость	  = Ложь;
		Элементы.Отчет_битchr95ОтчетПоПланируемымПоступлениямДенежныхСредств_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95НеснижаемыеОстатки_Форма1.Видимость 				  = Ложь;
		Элементы.Отчет_битchr95СведенияОбОстаткахДенежныхСредств_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95СведенияОДвиженииДенежныхСредств_Форма1.Видимость  = Ложь;
		
	Иначе
		
		Элементы.Отчет_битchr95кзнchr95ПлатежныйКалендарь_Форма.Видимость  		 				    = Ложь;
		Элементы.Отчет_битchr95кзнchr95ПланФактныйАнализПоЗаявкамНаРасходованиеДС_Форма.Видимость   = Ложь;
		Элементы.Отчет_битchr95кзнchr95ПланФактныйАнализПоПланируемымПоступлениямДС_Форма.Видимость = Ложь;
		Элементы.Отчет_битchr95кзнchr95ОстаткиОборотыПоУправленческимВыпискам_Форма.Видимость 		= Ложь;
		
		Элементы.Отчет_битchr95кзнchr95ПлатежныйКалендарь_Форма1.Видимость  		 				 = Ложь;
		Элементы.Отчет_битchr95кзнchr95ПланФактныйАнализПоЗаявкамНаРасходованиеДС_Форма1.Видимость   = Ложь;
		Элементы.Отчет_битchr95кзнchr95ПланФактныйАнализПоПланируемымПоступлениямДС_Форма1.Видимость = Ложь;
		Элементы.Отчет_битchr95кзнchr95ОстаткиОборотыПоУправленческимВыпискам_Форма1.Видимость 		 = Ложь;
		
	КонецЕсли;
	 	
КонецПроцедуры // УправлениеВидимостьюЭлементов()

// Процедура подключает макеты-схемы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура ПодключитьСхемы(ЭтоСемействоЕРП)
	
	ИмяСхемыЗР = ?(ЭтоСемействоЕРП, "СхемаЗаявкиНаРасход_ЕРП", "СхемаЗаявкиНаРасход");
	ИмяСхемыПК = ?(ЭтоСемействоЕРП, "СхемаПлатежныйКалендарь_ЕРП", "СхемаПлатежныйКалендарь");
		
	// Устанавливаем графические схемы
	СхемаЗаявкиНаРасход = Обработки.бит_ПанельФункций_Казначейство.ПолучитьМакет(ИмяСхемыЗР);
	СхемаПлатежныйКалендарь = Обработки.бит_ПанельФункций_Казначейство.ПолучитьМакет(ИмяСхемыПК);
	
КонецПроцедуры// ПодключитьСхемы()

// +СБ. Широков Николай. 2014-09-17. 
&НаКлиенте
Процедура ОткрытьНастройкиКазначейства(Элемент)

	СБ_КазначействоКлиент.ОткрытьФормуВводаНастроекКазначейства();
	
КонецПроцедуры // -СБ. Широков Николай

// +СБ. Широков Николай. 2014-12-22. 
&НаКлиенте
Процедура ОткрытьПрофилиРазноски(Элемент)

	СБ_КазначействоКлиент.ОткрытьФормуПрофилиРазноски();	
	
КонецПроцедуры // -СБ. Широков Николай

#КонецОбласти
