
&НаКлиенте
Процедура КнопкаЗаполнитьНажатие(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаКон) Тогда
		ПоказатьПредупреждение(,"Требуется заполнить дату ""по""");
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ПоказатьПредупреждение(,"Требуется заполнить организацию");
		Возврат;
	КонецЕсли;
	Если Объект.ОсновныеСредства.Количество() > 0 Тогда
		Оповещение =Новый ОписаниеОповещения("ОбработатьНажатиеЗаполнитьПослеВопроса", ЭтотОбъект,); //ДополнительныеПараметры);
		ПоказатьВопрос(Оповещение, "Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет,,КодВозвратаДиалога.Да);
	Иначе
		ЗаполнитьНажатиеНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеЗаполнитьПослеВопроса(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Объект.ОсновныеСредства.Очистить();
	    ЗаполнитьНажатиеНаСервере();
	КонецЕсли; 

КонецПроцедуры // ОбработатьНажатиеЗаполнитьПослеВопроса()
 


&НаКлиенте
Процедура ВыполнитьНажатие(Элемент)
	
	//Процедура создает документы комплектации из табличной части обработки
	СоздатьДокументыКомплектацииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанель2СнятьФлажки(Команда)
	Для Каждого Строка Из Объект.ОсновныеСредства Цикл
		
		Если Строка.Обрабатывать Тогда
			Строка.Обрабатывать = ЛОЖЬ;
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанель2УстановитьФлажки(Команда)
	Для Каждого Строка Из Объект.ОсновныеСредства Цикл
		Если Строка.БылоДвижение = Истина И Строка.ДокументКомплектация = ПредопределенноеЗначение("Документ.бит_му_КомплектацияОС.ПустаяСсылка") Тогда
			Строка.Обрабатывать = Истина;
		КонецЕсли;
	КонецЦикла;                      
КонецПроцедуры

//1c-izhtc А.В. Пушин (перенесено в СКД
//&НаСервере
//Процедура ИнициализацияТекстаЗапроса()
//	
//	// BIT Amerkulov 08072014 ++	
//	Объект.ПостроительОтчета.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ПОМЕСТИТЬ ВТСтатьи
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""бит_Дополнительный_2_Субконто1_Источник""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""бит_Дополнительный_2_Субконто2_Источник""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""бит_Дополнительный_2_Субконто3_Источник""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение1""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение2""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
//	                          |ИЗ
//	                          |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
//	                          |ГДЕ
//	                          |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение3""
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.ОсновныеСредства
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Источник = &Источник
//	                          |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка.Приемник = &Источник
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВТСтатьи.Значение
//	                          |ПОМЕСТИТЬ ВТСтатьиГруппированные
//	                          |ИЗ
//	                          |	ВТСтатьи КАК ВТСтатьи
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	ВТСтатьи.Значение
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС КАК ОсновноеСредство,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ КАК СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ КАК СубконтоРСБУ,
//	                          |	МАКСИМУМ(ВЫБОР
//	                          |			КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |				ТОГДА ИСТИНА
//	                          |			ИНАЧЕ ЛОЖЬ
//	                          |		КОНЕЦ) КАК БылоДвижениеМСФО,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ПОМЕСТИТЬ ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет12), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_Дополнительный_2Обороты.Субконто1 ССЫЛКА Справочник.ОбъектыСтроительства
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	МАКСИМУМ(ВЫБОР
//	                          |			КОГДА (бит_Дополнительный_2Обороты.СуммаРеглОборотДт <> 0
//	                          |					ИЛИ бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0)
//	                          |					И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |				ТОГДА ИСТИНА
//	                          |			ИНАЧЕ ЛОЖЬ
//	                          |		КОНЕЦ),
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И (АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства
//	                          |					ИЛИ АналитикаРСБУ ССЫЛКА Справочник.ОсновныеСредства)) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет111), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ ССЫЛКА Справочник.ОсновныеСредства
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	МАКСИМУМ(ВЫБОР
//	                          |			КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |					И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |				ТОГДА ИСТИНА
//	                          |			ИНАЧЕ ЛОЖЬ
//	                          |		КОНЕЦ),
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И (АналитикаРСБУ ССЫЛКА Справочник.Номенклатура
//	                          |					ИЛИ АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства)) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет12), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ ССЫЛКА Справочник.Номенклатура
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	ЛОЖЬ,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(&ДатаОстатков, Организация = &Организация) КАК бит_му_КомплектацияОСОстатки
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.ОсновноеСредство,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СчетРСБУ,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СубконтоРСБУ,
//	                          |	МАКСИМУМ(ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.БылоДвижениеМСФО) КАК БылоДвижениеМСФО,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СоставОС
//	                          |ПОМЕСТИТЬ Вр_ГруппировкаПоМСОФДвижениеОбщая
//	                          |ИЗ
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО КАК ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СчетРСБУ,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СубконтоРСБУ,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.ОсновноеСредство,
//	                          |	ВР_ДвиженияПоМСФОГруппировкаПоЕстьДвиженияМСФО.СоставОС
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС КАК ОсновноеСредство,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ КАК СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ КАК СубконтоРСБУ,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ) КАК Проведен,
//	                          |	ДокументыКомплектация.Регистратор КАК ДокументКомплектация,
//	                          |	ВЫБОР
//	                          |		КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ КАК БылоДвижениеМСФО,
//	                          |	бит_Дополнительный_2Обороты.Субконто1,
//	                          |	бит_Дополнительный_2Обороты.Субконто2,
//	                          |	бит_Дополнительный_2.ВидПроводки,
//	                          |	бит_Дополнительный_2.Период,
//	                          |	бит_Дополнительный_2.Регистратор,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС КАК СоставОС
//	                          |ПОМЕСТИТЬ ВР_ДвиженияПоМСФО
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет12), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_Дополнительный_2Обороты.Субконто1 ССЫЛКА Справочник.ОбъектыСтроительства
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_Дополнительный_2.Период,
//	                          |	бит_Дополнительный_2Обороты.Субконто2,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_Дополнительный_2.Регистратор,
//	                          |	бит_Дополнительный_2Обороты.Субконто1,
//	                          |	ДокументыКомплектация.Регистратор,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ),
//	                          |	бит_Дополнительный_2.ВидПроводки,
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	ВЫБОР
//	                          |		КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ),
//	                          |	ДокументыКомплектация.Регистратор,
//	                          |	ВЫБОР
//	                          |		КОГДА (бит_Дополнительный_2Обороты.СуммаРеглОборотДт <> 0
//	                          |				ИЛИ бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0)
//	                          |				И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	бит_Дополнительный_2Обороты.Субконто1,
//	                          |	бит_Дополнительный_2Обороты.Субконто2,
//	                          |	бит_Дополнительный_2.ВидПроводки,
//	                          |	бит_Дополнительный_2.Период,
//	                          |	бит_Дополнительный_2.Регистратор,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И (АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства
//	                          |					ИЛИ АналитикаРСБУ ССЫЛКА Справочник.ОсновныеСредства)) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет111), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ ССЫЛКА Справочник.ОсновныеСредства
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ),
//	                          |	ДокументыКомплектация.Регистратор,
//	                          |	ВЫБОР
//	                          |		КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |				И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	бит_Дополнительный_2Обороты.Субконто1,
//	                          |	бит_Дополнительный_2Обороты.Субконто2,
//	                          |	бит_Дополнительный_2.ВидПроводки,
//	                          |	бит_Дополнительный_2.Период,
//	                          |	бит_Дополнительный_2.Регистратор,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(
//	                          |			&ДатаОстатков,
//	                          |			Организация = &Организация
//	                          |				И (АналитикаРСБУ ССЫЛКА Справочник.Номенклатура
//	                          |					ИЛИ АналитикаРСБУ ССЫЛКА Справочник.ОбъектыСтроительства)) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериода, Запись, Счет В ИЕРАРХИИ (&Счет12), , Организация = &Организация, , ) КАК бит_Дополнительный_2Обороты
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
//	                          |			ПО бит_Дополнительный_2Обороты.НомерСтроки = бит_Дополнительный_2.НомерСтроки
//	                          |				И бит_Дополнительный_2Обороты.Регистратор = бит_Дополнительный_2.Регистратор
//	                          |		ПО (ВЫБОР
//	                          |				КОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ ССЫЛКА Справочник.Номенклатура
//	                          |					ТОГДА бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто1
//	                          |				ИНАЧЕ бит_му_КомплектацияОСОстатки.АналитикаРСБУ = бит_Дополнительный_2Обороты.Субконто2
//	                          |			КОНЕЦ)
//	                          |ГДЕ
//	                          |	(бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ИЛИ бит_Дополнительный_2.ВидПроводки ЕСТЬ NULL )
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	бит_Дополнительный_2Обороты.Субконто1,
//	                          |	ДокументыКомплектация.Регистратор,
//	                          |	бит_Дополнительный_2Обороты.Субконто2,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ),
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_Дополнительный_2.ВидПроводки,
//	                          |	бит_Дополнительный_2.Период,
//	                          |	бит_Дополнительный_2.Регистратор,
//	                          |	ВЫБОР
//	                          |		КОГДА бит_Дополнительный_2Обороты.СуммаРеглОборотКт <> 0
//	                          |				И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	бит_му_КомплектацияОСОстатки.ОС,
//	                          |	бит_му_КомплектацияОСОстатки.СчетРСБУ,
//	                          |	бит_му_КомплектацияОСОстатки.АналитикаРСБУ,
//	                          |	ЕСТЬNULL(ДокументыКомплектация.Проведен, ЛОЖЬ),
//	                          |	ДокументыКомплектация.Регистратор,
//	                          |	ЛОЖЬ,
//	                          |	NULL,
//	                          |	NULL,
//	                          |	NULL,
//	                          |	NULL,
//	                          |	NULL,
//	                          |	бит_му_КомплектацияОСОстатки.СоставОС
//	                          |ИЗ
//	                          |	РегистрНакопления.бит_му_КомплектацияОС.Остатки(&ДатаОстатков, Организация = &Организация) КАК бит_му_КомплектацияОСОстатки
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОС.ОС КАК ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор КАК Регистратор,
//	                          |			ИСТИНА КАК Проведен
//	                          |		ИЗ
//	                          |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОС.Регистратор ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |			И бит_му_КомплектацияОС.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И бит_му_КомплектацияОС.Период <= &КонецПериода
//	                          |			И бит_му_КомплектацияОС.Период >= &НачалоПериода
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОС.ОС,
//	                          |			бит_му_КомплектацияОС.СчетРСБУ,
//	                          |			бит_му_КомплектацияОС.АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОС.Регистратор) КАК ДокументыКомплектация
//	                          |		ПО бит_му_КомплектацияОСОстатки.ОС = ДокументыКомплектация.ОС
//	                          |			И бит_му_КомплектацияОСОстатки.СчетРСБУ = ДокументыКомплектация.СчетРСБУ
//	                          |			И бит_му_КомплектацияОСОстатки.АналитикаРСБУ = ДокументыКомплектация.АналитикаРСБУ
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВР_ДвиженияПоМСФО.ОсновноеСредство КАК ОсновноеСредство,
//	                          |	ВР_ДвиженияПоМСФО.СчетРСБУ,
//	                          |	ВР_ДвиженияПоМСФО.СубконтоРСБУ,
//	                          |	ВР_ДвиженияПоМСФО.Проведен,
//	                          |	ВР_ДвиженияПоМСФО.ДокументКомплектация,
//	                          |	ВР_ДвиженияПоМСФО.БылоДвижениеМСФО,
//	                          |	ВР_ДвиженияПоМСФО.Субконто1,
//	                          |	ВР_ДвиженияПоМСФО.Субконто2,
//	                          |	ВР_ДвиженияПоМСФО.ВидПроводки,
//	                          |	ВР_ДвиженияПоМСФО.Регистратор,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОбороты.Регистратор ЕСТЬ NULL 
//	                          |			ТОГДА ЛОЖЬ
//	                          |		ИНАЧЕ ИСТИНА
//	                          |	КОНЕЦ КАК ДвижениеРСБУ,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОбороты.Регистратор ЕСТЬ NULL 
//	                          |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
//	                          |		ИНАЧЕ ХозрасчетныйОбороты.Период
//	                          |	КОНЕЦ КАК ПериодРСБУ,
//	                          |	ВР_ДвиженияПоМСФО.СоставОС
//	                          |ПОМЕСТИТЬ ВР_С_ДаннымиРСБУ
//	                          |ИЗ
//	                          |	Вр_ГруппировкаПоМСОФДвижениеОбщая КАК Вр_ГруппировкаПоМСОФДвижениеОбщая
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВР_ДвиженияПоМСФО КАК ВР_ДвиженияПоМСФО
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.Обороты(, , Запись, , , Организация = &Организация, , ) КАК ХозрасчетныйОбороты
//	                          |			ПО ВР_ДвиженияПоМСФО.Регистратор = ХозрасчетныйОбороты.Регистратор
//	                          |		ПО Вр_ГруппировкаПоМСОФДвижениеОбщая.ОсновноеСредство = ВР_ДвиженияПоМСФО.ОсновноеСредство
//	                          |			И Вр_ГруппировкаПоМСОФДвижениеОбщая.СчетРСБУ = ВР_ДвиженияПоМСФО.СчетРСБУ
//	                          |			И Вр_ГруппировкаПоМСОФДвижениеОбщая.СубконтоРСБУ = ВР_ДвиженияПоМСФО.СубконтоРСБУ
//	                          |			И Вр_ГруппировкаПоМСОФДвижениеОбщая.БылоДвижениеМСФО = ВР_ДвиженияПоМСФО.БылоДвижениеМСФО
//	                          |			И Вр_ГруппировкаПоМСОФДвижениеОбщая.СоставОС = ВР_ДвиженияПоМСФО.СоставОС
//	                          |
//	                          |СГРУППИРОВАТЬ ПО
//	                          |	ВР_ДвиженияПоМСФО.ОсновноеСредство,
//	                          |	ВР_ДвиженияПоМСФО.СчетРСБУ,
//	                          |	ВР_ДвиженияПоМСФО.СубконтоРСБУ,
//	                          |	ВР_ДвиженияПоМСФО.Проведен,
//	                          |	ВР_ДвиженияПоМСФО.ДокументКомплектация,
//	                          |	ВР_ДвиженияПоМСФО.Субконто1,
//	                          |	ВР_ДвиженияПоМСФО.Субконто2,
//	                          |	ВР_ДвиженияПоМСФО.БылоДвижениеМСФО,
//	                          |	ВР_ДвиженияПоМСФО.ВидПроводки,
//	                          |	ВР_ДвиженияПоМСФО.Регистратор,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОбороты.Регистратор ЕСТЬ NULL 
//	                          |			ТОГДА ЛОЖЬ
//	                          |		ИНАЧЕ ИСТИНА
//	                          |	КОНЕЦ,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОбороты.Регистратор ЕСТЬ NULL 
//	                          |			ТОГДА ДАТАВРЕМЯ(1, 1, 1)
//	                          |		ИНАЧЕ ХозрасчетныйОбороты.Период
//	                          |	КОНЕЦ,
//	                          |	ВР_ДвиженияПоМСФО.СоставОС
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
//	                          |	ВложенныйЗапрос.СчетРСБУ КАК СчетРСБУ,
//	                          |	ВложенныйЗапрос.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |	ВложенныйЗапрос.Проведен,
//	                          |	ВложенныйЗапрос.ДокументКомплектация,
//	                          |	ВложенныйЗапрос.БылоДвижениеМСФО,
//	                          |	ВложенныйЗапрос.Субконто1,
//	                          |	ВложенныйЗапрос.Субконто2,
//	                          |	ВложенныйЗапрос.ВидПроводки,
//	                          |	ВложенныйЗапрос.Регистратор,
//	                          |	ВложенныйЗапрос.ДвижениеРСБУ КАК БылоДвижение,
//	                          |	ВложенныйЗапрос.ПериодРСБУ КАК ПериодПроводкиРСБУ,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОборотыДтКт.СуммаОборот <> 0
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ КАК ВКорреспонденцииСоСчетомУчетаОС,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
//	                          |			ТОГДА ХозрасчетныйОборотыДтКт.СубконтоДт1
//	                          |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.ОсновныеСредства
//	                          |			ТОГДА ХозрасчетныйОборотыДтКт.СубконтоДт2
//	                          |	КОНЕЦ КАК ОсновноеСредствоКорСчет,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
//	                          |				ИЛИ ХозрасчетныйОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.ОсновныеСредства
//	                          |			ТОГДА ВЫБОР
//	                          |					КОГДА ВТСтатьиГруппированные.Значение ЕСТЬ NULL 
//	                          |						ТОГДА ЛОЖЬ
//	                          |					ИНАЧЕ ИСТИНА
//	                          |				КОНЕЦ
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ КАК ИсключениеВТрансляции,
//	                          |	ВложенныйЗапрос.СоставОС
//	                          |ПОМЕСТИТЬ ВР_Итоговая
//	                          |ИЗ
//	                          |	(ВЫБРАТЬ
//	                          |		ВР_С_ДаннымиРСБУ.ОсновноеСредство КАК ОсновноеСредство,
//	                          |		ВР_С_ДаннымиРСБУ.СчетРСБУ КАК СчетРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.Проведен КАК Проведен,
//	                          |		ВР_С_ДаннымиРСБУ.ДокументКомплектация КАК ДокументКомплектация,
//	                          |		ВР_С_ДаннымиРСБУ.БылоДвижениеМСФО КАК БылоДвижениеМСФО,
//	                          |		ВР_С_ДаннымиРСБУ.Субконто1 КАК Субконто1,
//	                          |		ВР_С_ДаннымиРСБУ.Субконто2 КАК Субконто2,
//	                          |		ВР_С_ДаннымиРСБУ.ВидПроводки КАК ВидПроводки,
//	                          |		ВР_С_ДаннымиРСБУ.Регистратор КАК Регистратор,
//	                          |		ВР_С_ДаннымиРСБУ.ДвижениеРСБУ КАК ДвижениеРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.ПериодРСБУ КАК ПериодРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.СоставОС КАК СоставОС
//	                          |	ИЗ
//	                          |		ВР_С_ДаннымиРСБУ КАК ВР_С_ДаннымиРСБУ
//	                          |	ГДЕ
//	                          |		ВР_С_ДаннымиРСБУ.СчетРСБУ В ИЕРАРХИИ(&Счет08)) КАК ВложенныйЗапрос
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(, , Регистратор, СчетДт В ИЕРАРХИИ (&Счет01, &Счет03), , СчетКт В ИЕРАРХИИ (&Счет08), , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиГруппированные КАК ВТСтатьиГруппированные
//	                          |			ПО (ВЫБОР
//	                          |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоДт1 ССЫЛКА Справочник.ОсновныеСредства
//	                          |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоДт1 = ВТСтатьиГруппированные.Значение
//	                          |					КОГДА ХозрасчетныйОборотыДтКт.СубконтоДт2 ССЫЛКА Справочник.ОсновныеСредства
//	                          |						ТОГДА ХозрасчетныйОборотыДтКт.СубконтоДт2 = ВТСтатьиГруппированные.Значение
//	                          |				КОНЕЦ)
//	                          |		ПО ВложенныйЗапрос.СчетРСБУ = ХозрасчетныйОборотыДтКт.СчетКт
//	                          |			И ВложенныйЗапрос.СубконтоРСБУ = ХозрасчетныйОборотыДтКт.СубконтоКт1
//	                          |			И (ВложенныйЗапрос.ДвижениеРСБУ = ИСТИНА)
//	                          |
//	                          |ОБЪЕДИНИТЬ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	ВложенныйЗапрос.ОсновноеСредство,
//	                          |	ВложенныйЗапрос.СчетРСБУ,
//	                          |	ВложенныйЗапрос.СубконтоРСБУ,
//	                          |	ВложенныйЗапрос.Проведен,
//	                          |	ВложенныйЗапрос.ДокументКомплектация,
//	                          |	ВложенныйЗапрос.БылоДвижениеМСФО,
//	                          |	ВложенныйЗапрос.Субконто1,
//	                          |	ВложенныйЗапрос.Субконто2,
//	                          |	ВложенныйЗапрос.ВидПроводки,
//	                          |	ВложенныйЗапрос.Регистратор,
//	                          |	ВложенныйЗапрос.ДвижениеРСБУ,
//	                          |	ВложенныйЗапрос.ПериодРСБУ,
//	                          |	ВЫБОР
//	                          |		КОГДА ХозрасчетныйОборотыДтКт.СуммаОборот <> 0
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка),
//	                          |	ЛОЖЬ,
//	                          |	ВложенныйЗапрос.СоставОС
//	                          |ИЗ
//	                          |	(ВЫБРАТЬ
//	                          |		ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
//	                          |		ВложенныйЗапрос.СчетРСБУ КАК СчетРСБУ,
//	                          |		ВложенныйЗапрос.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |		ВложенныйЗапрос.Проведен КАК Проведен,
//	                          |		ВложенныйЗапрос.ДокументКомплектация КАК ДокументКомплектация,
//	                          |		ВложенныйЗапрос.БылоДвижениеМСФО КАК БылоДвижениеМСФО,
//	                          |		ВложенныйЗапрос.Субконто1 КАК Субконто1,
//	                          |		ВложенныйЗапрос.Субконто2 КАК Субконто2,
//	                          |		ВложенныйЗапрос.ВидПроводки КАК ВидПроводки,
//	                          |		ВложенныйЗапрос.Регистратор КАК Регистратор,
//	                          |		ВложенныйЗапрос.ДвижениеРСБУ КАК ДвижениеРСБУ,
//	                          |		ВложенныйЗапрос.ПериодРСБУ КАК ПериодРСБУ,
//	                          |		ВЫБОР
//	                          |			КОГДА ХозрасчетныйОборотыДтКт.СуммаОборот <> 0
//	                          |				ТОГДА ИСТИНА
//	                          |			ИНАЧЕ ЛОЖЬ
//	                          |		КОНЕЦ КАК Поле1,
//	                          |		ХозрасчетныйОборотыДтКт.Регистратор КАК Регистратор1,
//	                          |		ВложенныйЗапрос.СоставОС КАК СоставОС
//	                          |	ИЗ
//	                          |		(ВЫБРАТЬ
//	                          |			ВР_С_ДаннымиРСБУ.ОсновноеСредство КАК ОсновноеСредство,
//	                          |			ВР_С_ДаннымиРСБУ.СчетРСБУ КАК СчетРСБУ,
//	                          |			ВР_С_ДаннымиРСБУ.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |			ВР_С_ДаннымиРСБУ.Проведен КАК Проведен,
//	                          |			ВР_С_ДаннымиРСБУ.ДокументКомплектация КАК ДокументКомплектация,
//	                          |			ВР_С_ДаннымиРСБУ.БылоДвижениеМСФО КАК БылоДвижениеМСФО,
//	                          |			ВР_С_ДаннымиРСБУ.Субконто1 КАК Субконто1,
//	                          |			ВР_С_ДаннымиРСБУ.Субконто2 КАК Субконто2,
//	                          |			ВР_С_ДаннымиРСБУ.ВидПроводки КАК ВидПроводки,
//	                          |			ВР_С_ДаннымиРСБУ.Регистратор КАК Регистратор,
//	                          |			ВР_С_ДаннымиРСБУ.ДвижениеРСБУ КАК ДвижениеРСБУ,
//	                          |			ВР_С_ДаннымиРСБУ.ПериодРСБУ КАК ПериодРСБУ,
//	                          |			ВР_С_ДаннымиРСБУ.СоставОС КАК СоставОС
//	                          |		ИЗ
//	                          |			ВР_С_ДаннымиРСБУ КАК ВР_С_ДаннымиРСБУ
//	                          |		ГДЕ
//	                          |			ВР_С_ДаннымиРСБУ.СчетРСБУ В ИЕРАРХИИ(&Счет08)
//	                          |			И ВР_С_ДаннымиРСБУ.ДвижениеРСБУ) КАК ВложенныйЗапрос
//	                          |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ДатаОстатков, Регистратор, СчетДт В ИЕРАРХИИ (&Счет01, &Счет03), , СчетКт В ИЕРАРХИИ (&Счет08), , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
//	                          |			ПО ВложенныйЗапрос.СчетРСБУ = ХозрасчетныйОборотыДтКт.СчетКт
//	                          |				И ВложенныйЗапрос.СубконтоРСБУ = ХозрасчетныйОборотыДтКт.СубконтоКт1
//	                          |	ГДЕ
//	                          |		ХозрасчетныйОборотыДтКт.СуммаОборот <> 0) КАК ВложенныйЗапрос
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.Хозрасчетный.ОборотыДтКт(&НачалоПериода, &ДатаОстатков, Регистратор, НЕ СчетДт В ИЕРАРХИИ (&Счет01, &Счет03), , СчетКт В ИЕРАРХИИ (&Счет08, &Счет07), , Организация = &Организация) КАК ХозрасчетныйОборотыДтКт
//	                          |		ПО ВложенныйЗапрос.СчетРСБУ = ХозрасчетныйОборотыДтКт.СчетКт
//	                          |			И ВложенныйЗапрос.СубконтоРСБУ = ХозрасчетныйОборотыДтКт.СубконтоКт1
//	                          |ГДЕ
//	                          |	ХозрасчетныйОборотыДтКт.СуммаОборот <> 0
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	ВложенныйЗапрос.ОсновноеСредство,
//	                          |	ВложенныйЗапрос.СчетРСБУ,
//	                          |	ВложенныйЗапрос.СубконтоРСБУ,
//	                          |	ВложенныйЗапрос.Проведен,
//	                          |	ВложенныйЗапрос.ДокументКомплектация,
//	                          |	ВложенныйЗапрос.БылоДвижениеМСФО,
//	                          |	ВложенныйЗапрос.Субконто1,
//	                          |	ВложенныйЗапрос.Субконто2,
//	                          |	ВложенныйЗапрос.ВидПроводки,
//	                          |	ВложенныйЗапрос.Регистратор,
//	                          |	ВложенныйЗапрос.ДвижениеРСБУ,
//	                          |	ВложенныйЗапрос.ПериодРСБУ,
//	                          |	ЛОЖЬ,
//	                          |	ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка),
//	                          |	ВЫБОР
//	                          |		КОГДА ВТСтатьиГруппированные.Значение ЕСТЬ NULL 
//	                          |			ТОГДА ЛОЖЬ
//	                          |		ИНАЧЕ ИСТИНА
//	                          |	КОНЕЦ,
//	                          |	ВложенныйЗапрос.СоставОС
//	                          |ИЗ
//	                          |	(ВЫБРАТЬ
//	                          |		ВР_С_ДаннымиРСБУ.ОсновноеСредство КАК ОсновноеСредство,
//	                          |		ВР_С_ДаннымиРСБУ.СчетРСБУ КАК СчетРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.Проведен КАК Проведен,
//	                          |		ВР_С_ДаннымиРСБУ.ДокументКомплектация КАК ДокументКомплектация,
//	                          |		ВР_С_ДаннымиРСБУ.БылоДвижениеМСФО КАК БылоДвижениеМСФО,
//	                          |		ВР_С_ДаннымиРСБУ.Субконто1 КАК Субконто1,
//	                          |		ВР_С_ДаннымиРСБУ.Субконто2 КАК Субконто2,
//	                          |		ВР_С_ДаннымиРСБУ.ВидПроводки КАК ВидПроводки,
//	                          |		ВР_С_ДаннымиРСБУ.Регистратор КАК Регистратор,
//	                          |		ВР_С_ДаннымиРСБУ.ДвижениеРСБУ КАК ДвижениеРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.ПериодРСБУ КАК ПериодРСБУ,
//	                          |		ВР_С_ДаннымиРСБУ.СоставОС КАК СоставОС
//	                          |	ИЗ
//	                          |		ВР_С_ДаннымиРСБУ КАК ВР_С_ДаннымиРСБУ
//	                          |	ГДЕ
//	                          |		НЕ ВР_С_ДаннымиРСБУ.СчетРСБУ В ИЕРАРХИИ (&Счет08)) КАК ВложенныйЗапрос
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиГруппированные КАК ВТСтатьиГруппированные
//	                          |		ПО ВложенныйЗапрос.СубконтоРСБУ = ВТСтатьиГруппированные.Значение
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВР_Итоговая.ОсновноеСредство,
//	                          |	ВР_Итоговая.СчетРСБУ,
//	                          |	ВР_Итоговая.СубконтоРСБУ,
//	                          |	ВР_Итоговая.Проведен,
//	                          |	ВР_Итоговая.БылоДвижениеМСФО,
//	                          |	ВР_Итоговая.Субконто1,
//	                          |	ВР_Итоговая.Субконто2,
//	                          |	ВР_Итоговая.ВидПроводки,
//	                          |	ВР_Итоговая.Регистратор,
//	                          |	ВР_Итоговая.БылоДвижение,
//	                          |	ВР_Итоговая.ПериодПроводкиРСБУ,
//	                          |	ВР_Итоговая.ВКорреспонденцииСоСчетомУчетаОС,
//	                          |	ВР_Итоговая.ОсновноеСредствоКорСчет,
//	                          |	ВР_Итоговая.ИсключениеВТрансляции,
//	                          |	ВЫБОР
//	                          |		КОГДА ВР_Итоговая.ДокументКомплектация = НЕОПРЕДЕЛЕНО
//	                          |				ИЛИ ВР_Итоговая.ДокументКомплектация ЕСТЬ NULL 
//	                          |			ТОГДА НеПроведенныеЛевое.Ссылка
//	                          |		ИНАЧЕ ВР_Итоговая.ДокументКомплектация
//	                          |	КОНЕЦ КАК ДокументКомплектация,
//	                          |	ВЫБОР
//	                          |		КОГДА ВР_Итоговая.БылоДвижение
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ КАК Обрабатывать,
//	                          |	ВР_Итоговая.СоставОС
//	                          |ПОМЕСТИТЬ ВТДляОтбораНаБылоДвижение
//	                          |ИЗ
//	                          |	ВР_Итоговая КАК ВР_Итоговая
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка КАК Ссылка,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СчетДтРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СубконтоДт1 КАК АналитикаРСБУ
//	                          |		ИЗ
//	                          |			Документ.бит_му_КомплектацияОС.ОсновныеСредства КАК бит_му_КомплектацияОСОсновныеСредства
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка.Проведен = ЛОЖЬ
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата <= &КонецПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата >= &НачалоПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.ПометкаУдаления = ЛОЖЬ
//	                          |		
//	                          |		ОБЪЕДИНИТЬ ВСЕ
//	                          |		
//	                          |		ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.ОсновноеСредство,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СчетКтРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СубконтоКт1
//	                          |		ИЗ
//	                          |			Документ.бит_му_КомплектацияОС.ОсновныеСредства КАК бит_му_КомплектацияОСОсновныеСредства
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка.Проведен = ЛОЖЬ
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата >= &НачалоПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата <= &КонецПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК НеПроведенныеЛевое
//	                          |		ПО ВР_Итоговая.ОсновноеСредство = НеПроведенныеЛевое.ОсновноеСредство
//	                          |			И ВР_Итоговая.СчетРСБУ = НеПроведенныеЛевое.СчетРСБУ
//	                          |			И ВР_Итоговая.СубконтоРСБУ = НеПроведенныеЛевое.АналитикаРСБУ
//	                          |			И (ВР_Итоговая.ДокументКомплектация = НЕОПРЕДЕЛЕНО
//	                          |				ИЛИ ВР_Итоговая.ДокументКомплектация ЕСТЬ NULL )
//	                          |
//	                          |ОБЪЕДИНИТЬ ВСЕ
//	                          |
//	                          |ВЫБРАТЬ
//	                          |	НеПроведенныеОбъединение.ОсновноеСредство,
//	                          |	НеПроведенныеОбъединение.СчетРСБУ,
//	                          |	НеПроведенныеОбъединение.СубконтоРСБУ,
//	                          |	ЛОЖЬ,
//	                          |	НеПроведенныеОбъединение.БылоДвижениеМСФО,
//	                          |	НеПроведенныеОбъединение.Субконто1,
//	                          |	НеПроведенныеОбъединение.Субконто2,
//	                          |	НеПроведенныеОбъединение.ВидПроводки,
//	                          |	НеПроведенныеОбъединение.Регистратор,
//	                          |	НеПроведенныеОбъединение.БылоДвижение,
//	                          |	NULL,
//	                          |	НеПроведенныеОбъединение.ВКорреспонденцииСоСчетомУчетаОС,
//	                          |	НеПроведенныеОбъединение.ОсновноеСредствоКорСчет,
//	                          |	НеПроведенныеОбъединение.ИсключениеВТрансляции,
//	                          |	НеПроведнныеДокументы.Ссылка,
//	                          |	ВЫБОР
//	                          |		КОГДА НеПроведенныеОбъединение.БылоДвижение
//	                          |			ТОГДА ИСТИНА
//	                          |		ИНАЧЕ ЛОЖЬ
//	                          |	КОНЕЦ,
//	                          |	NULL
//	                          |ИЗ
//	                          |	(ВЫБРАТЬ
//	                          |		ВР_Итоговая.ОсновноеСредство КАК ОсновноеСредство,
//	                          |		ВР_Итоговая.СчетРСБУ КАК СчетРСБУ,
//	                          |		ВР_Итоговая.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |		ВР_Итоговая.Проведен КАК Проведен,
//	                          |		ВР_Итоговая.ДокументКомплектация КАК ДокументКомплектация,
//	                          |		ВР_Итоговая.БылоДвижениеМСФО КАК БылоДвижениеМСФО,
//	                          |		ВР_Итоговая.Субконто1 КАК Субконто1,
//	                          |		ВР_Итоговая.Субконто2 КАК Субконто2,
//	                          |		ВР_Итоговая.ВидПроводки КАК ВидПроводки,
//	                          |		ВР_Итоговая.Регистратор КАК Регистратор,
//	                          |		ВР_Итоговая.БылоДвижение КАК БылоДвижение,
//	                          |		ВР_Итоговая.ПериодПроводкиРСБУ КАК ПериодПроводкиРСБУ,
//	                          |		ВР_Итоговая.ВКорреспонденцииСоСчетомУчетаОС КАК ВКорреспонденцииСоСчетомУчетаОС,
//	                          |		ВР_Итоговая.ОсновноеСредствоКорСчет КАК ОсновноеСредствоКорСчет,
//	                          |		ВР_Итоговая.ИсключениеВТрансляции КАК ИсключениеВТрансляции,
//	                          |		ВЫБОР
//	                          |			КОГДА ВР_Итоговая.ДокументКомплектация ССЫЛКА Документ.бит_му_КомплектацияОС
//	                          |				ТОГДА 1
//	                          |			ИНАЧЕ 2
//	                          |		КОНЕЦ КАК Поле1
//	                          |	ИЗ
//	                          |		ВР_Итоговая КАК ВР_Итоговая) КАК НеПроведенныеОбъединение
//	                          |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка КАК Ссылка,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СчетДтРСБУ КАК СчетРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СубконтоДт1 КАК АналитикаРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.ОсновноеСредство КАК ОсновноеСредство
//	                          |		ИЗ
//	                          |			Документ.бит_му_КомплектацияОС.ОсновныеСредства КАК бит_му_КомплектацияОСОсновныеСредства
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка.Проведен = ЛОЖЬ
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Номер >= &НачалоПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Номер <= &КонецПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.ПометкаУдаления = ЛОЖЬ
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СчетДтРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СубконтоДт1,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.ОсновноеСредство
//	                          |		
//	                          |		ОБЪЕДИНИТЬ ВСЕ
//	                          |		
//	                          |		ВЫБРАТЬ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СчетКтРСБУ,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.СубконтоКт1,
//	                          |			бит_му_КомплектацияОСОсновныеСредства.ОсновноеСредство
//	                          |		ИЗ
//	                          |			Документ.бит_му_КомплектацияОС.ОсновныеСредства КАК бит_му_КомплектацияОСОсновныеСредства
//	                          |		ГДЕ
//	                          |			бит_му_КомплектацияОСОсновныеСредства.Ссылка.Проведен = ЛОЖЬ
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата >= &НачалоПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.Дата <= &КонецПериода
//	                          |			И бит_му_КомплектацияОСОсновныеСредства.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК НеПроведнныеДокументы
//	                          |		ПО НеПроведенныеОбъединение.ОсновноеСредство = НеПроведнныеДокументы.ОсновноеСредство
//	                          |			И НеПроведенныеОбъединение.СчетРСБУ = НеПроведнныеДокументы.СчетРСБУ
//	                          |			И НеПроведенныеОбъединение.СубконтоРСБУ = НеПроведнныеДокументы.АналитикаРСБУ
//	                          |			И (НеПроведенныеОбъединение.Поле1 = 1)
//	                          |;
//	                          |
//	                          |////////////////////////////////////////////////////////////////////////////////
//	                          |ВЫБРАТЬ
//	                          |	ВТДляОтбораНаБылоДвижение.ОсновноеСредство КАК ОсновноеСредство,
//	                          |	ВТДляОтбораНаБылоДвижение.СчетРСБУ КАК СчетРСБУ,
//	                          |	ВТДляОтбораНаБылоДвижение.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |	ВТДляОтбораНаБылоДвижение.Проведен,
//	                          |	ВТДляОтбораНаБылоДвижение.БылоДвижениеМСФО,
//	                          |	ВТДляОтбораНаБылоДвижение.Субконто1,
//	                          |	ВТДляОтбораНаБылоДвижение.Субконто2,
//	                          |	ВТДляОтбораНаБылоДвижение.ВидПроводки,
//	                          |	ВТДляОтбораНаБылоДвижение.Регистратор,
//	                          |	ВТДляОтбораНаБылоДвижение.БылоДвижение,
//	                          |	ВТДляОтбораНаБылоДвижение.ПериодПроводкиРСБУ,
//	                          |	ВТДляОтбораНаБылоДвижение.ВКорреспонденцииСоСчетомУчетаОС,
//	                          |	ВТДляОтбораНаБылоДвижение.ОсновноеСредствоКорСчет,
//	                          |	ВТДляОтбораНаБылоДвижение.ИсключениеВТрансляции,
//	                          |	ВТДляОтбораНаБылоДвижение.ДокументКомплектация,
//	                          |	ВЫБОР
//	                          |		КОГДА ВТДляОтбораНаБылоДвижение.Обрабатывать = ИСТИНА
//	                          |			ТОГДА ВЫБОР
//	                          |					КОГДА НЕ ВТДляОтбораНаБылоДвижение.ДокументКомплектация = ЗНАЧЕНИЕ(Документ.бит_му_КомплектацияОС.ПустаяСсылка)
//	                          |						ТОГДА ЛОЖЬ
//	                          |					ИНАЧЕ ИСТИНА
//	                          |				КОНЕЦ
//	                          |		ИНАЧЕ ВТДляОтбораНаБылоДвижение.Обрабатывать
//	                          |	КОНЕЦ КАК Обрабатывать,
//	                          |	ВТДляОтбораНаБылоДвижение.СоставОС
//	                          |ИЗ
//	                          |	ВТДляОтбораНаБылоДвижение КАК ВТДляОтбораНаБылоДвижение
//	                          |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
//	                          |			ВТДляОтбораНаБылоДвижение.ОсновноеСредство КАК ОсновноеСредство,
//	                          |			ВТДляОтбораНаБылоДвижение.СчетРСБУ КАК СчетРСБУ,
//	                          |			ВТДляОтбораНаБылоДвижение.СубконтоРСБУ КАК СубконтоРСБУ,
//	                          |			ВТДляОтбораНаБылоДвижение.БылоДвижение КАК БылоДвижение
//	                          |		ИЗ
//	                          |			ВТДляОтбораНаБылоДвижение КАК ВТДляОтбораНаБылоДвижение
//	                          |		ГДЕ
//	                          |			ВТДляОтбораНаБылоДвижение.БылоДвижение = ИСТИНА
//	                          |		
//	                          |		СГРУППИРОВАТЬ ПО
//	                          |			ВТДляОтбораНаБылоДвижение.ОсновноеСредство,
//	                          |			ВТДляОтбораНаБылоДвижение.СчетРСБУ,
//	                          |			ВТДляОтбораНаБылоДвижение.СубконтоРСБУ,
//	                          |			ВТДляОтбораНаБылоДвижение.БылоДвижение) КАК БылоДвижениеДА
//	                          |		ПО ВТДляОтбораНаБылоДвижение.ОсновноеСредство = БылоДвижениеДА.ОсновноеСредство
//	                          |			И ВТДляОтбораНаБылоДвижение.СчетРСБУ = БылоДвижениеДА.СчетРСБУ
//	                          |			И ВТДляОтбораНаБылоДвижение.СубконтоРСБУ = БылоДвижениеДА.СубконтоРСБУ
//	                          |			И (ВТДляОтбораНаБылоДвижение.БылоДвижение = ЛОЖЬ)
//	                          |ГДЕ
//	                          |	БылоДвижениеДА.ОсновноеСредство ЕСТЬ NULL 
//	                          |{ГДЕ
//	                          |	ВТДляОтбораНаБылоДвижение.БылоДвижение}
//	                          |
//	                          |УПОРЯДОЧИТЬ ПО
//	                          |	ОсновноеСредство,
//	                          |	СчетРСБУ,
//	                          |	СубконтоРСБУ
//	                          |АВТОУПОРЯДОЧИВАНИЕ";
//							  
//	// BIT Amerkulov 08072014 -- 
//							  
//	УстановитьПоляОтбора();
//							   
//КонецПроцедуры
//1c-izhtc А.В. Пушин )

//&НаСервере
//Процедура УстановитьПоляОтбора()
//	
//	бит_РаботаСДиалогами.ДобавитьЭлементОтбораПостроителя(Объект.ПостроительОтчета,"БылоДвижение");
//	
//	ЭлементОтбора = Объект.ПостроительОтчета.Отбор.Найти("БылоДвижение");
//	
//	ЭлементОтбора.Значение      = ИСТИНА;
//	ЭлементОтбора.Использование = ЛОЖЬ;
//	
//КонецПроцедуры            

&НаКлиенте
Процедура ТабличноеПолеОсновныеСредстваПередНачаломИзменения(Элемент, Отказ)
	
	Если Элементы.ОсновныеСредства.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если Элемент.ТекущийЭлемент.Имя = "ТабличноеПолеОсновныеСредстваОбрабатывать" Тогда
		Если НЕ Элемент.ТекущиеДанные.БылоДвижение Тогда
			ПоказатьПредупреждение(,"Значение колонки ""Обрабатывать"" изменить нельзя, т.к. для данной строки не было движений", 6, "Предупреждение");
			Отказ = Истина;
		ИначеЕсли НЕ Элемент.ТекущиеДанные.ДокументКомплектация = ПредопределенноеЗначение("Документ.бит_му_КомплектацияОС.ПустаяСсылка") Тогда
			ПоказатьПредупреждение(,"Значение колонки ""Обрабатывать"" изменить нельзя, т.к. для данной строки заполнено значение документа комплектации", 6, "Предупреждение");
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПечатьНажатие_Сервер()
	
	ТабДок = Новый ТабличныйДокумент;
	
	НашМакет =Обработки.бит_му_АнализОттранслированныхПроводокОС.ПолучитьМакет("Макет");
	
	ШапкаДокументаОбласть = НашМакет.ПолучитьОбласть("ШапкаДокумента");
	
	ШапкаДокументаОбласть.Параметры.Организация = Объект.Организация;
	ШапкаДокументаОбласть.Параметры.Период      = Строка(Формат(Объект.ДатаНач, "ДЛФ=Д"))+ " - " + Строка(Формат(Объект.ДатаКон, "ДЛФ=Д"));
	ШапкаДокументаОбласть.Параметры.Настройки   = СокрЛП(Объект.ПостроительОтчета.Настройки.Отбор);
	
	ТабДок.Вывести(ШапкаДокументаОбласть);
	
	ШапкаТаблицыОбласть = НашМакет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.ПовторятьПриПечатиСтроки = ТабДок.Вывести(ШапкаТаблицыОбласть);
	
	ТаблицаОбласть = НашМакет.ПолучитьОбласть("Таблица");
	
	Для Каждого ОсновноеСредство ИЗ Объект.ОсновныеСредства Цикл
		ТаблицаОбласть.Параметры.Номер = ОсновноеСредство.НомерСтроки;
		ТаблицаОбласть.Параметры.Обрабатывать = ОсновноеСредство.Обрабатывать;
		ТаблицаОбласть.Параметры.ОС = ОсновноеСредство.ОсновноеСредство;
		ТаблицаОбласть.Параметры.СчетРСБУ = ОсновноеСредство.СчетРСБУ;
		ТаблицаОбласть.Параметры.СубкРСБУ = ОсновноеСредство.СубконтоРСБУ;
		ТаблицаОбласть.Параметры.ДвижРСБУ = ОсновноеСредство.БылоДвижение;
		ТаблицаОбласть.Параметры.Корреспонденция = ОсновноеСредство.ВКорреспонденцииСоСчетомУчетаОС;
		ТаблицаОбласть.Параметры.КорОС = ОсновноеСредство.ОсновноеСредствоКорСчет;
		ТаблицаОбласть.Параметры.Комплектация = ОсновноеСредство.ДокументКомплектация;
		ТаблицаОбласть.Параметры.Проведен = ОсновноеСредство.Проведен;
		ТаблицаОбласть.Параметры.Исключение = ОсновноеСредство.ИсключениеВТрансляции;
		ТаблицаОбласть.Параметры.Комментарий = ОсновноеСредство.Комментарий;
		ТабДок.Вывести(ТаблицаОбласть);
	КонецЦикла;
	
	ПодвалДокументаОбласть = НашМакет.ПолучитьОбласть("ПодвалДокумента");
	ПодвалДокументаОбласть.Параметры.ФИО = Пользователи.ТекущийПользователь().ПолноеНаименование();
	ТабДок.Вывести(ПодвалДокументаОбласть);
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	//бит_МеханизмыТиповых.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, "Обработка прпр", НепосредственнаяПечать);
	
	Возврат ТабДок;
КонецФункции


&НаКлиенте
Процедура ПечатьНажатие(Элемент)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//ТабДок = ПечатьНажатие_Сервер();
	//////бит_МеханизмыТиповых.НапечататьДокумент(ТабДок, КоличествоЭкземпляров, НаПринтер, "Обработка прпр", НепосредственнаяПечать);
	//// Получим ключ уникальности открываемой формы.
	//КлючУникальности = Строка(Новый УникальныйИдентификатор);
	////Массив Объектов
	//МассивСсылок = Новый Массив;
	////Параметры печати
	//ПараметрыПечати = Новый Структура;
	//ПараметрыПечати.Вставить("ПечатныйДокумент", ТабДок);
	//ПараметрыПечати.Вставить("КоличествоЭкземпляров", КоличествоЭкземпляров);
	//ПараметрыПечати.Вставить("НаПринтер", НаПринтер);
	//ПараметрыПечати.Вставить("Заголовок", "Обработка прпр");
	//ПараметрыПечати.Вставить("НепосредственнаяПечать", НепосредственнаяПечать);

	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("ИмяКоллекции"	 	 , "Обработки");	//ИмяКоллекции);
	//ПараметрыФормы.Вставить("ИмяОбъекта"	 	 , "бит_му_АнализОттранслированныхПроводокОС");	//ИмяОбъекта);
	//ПараметрыФормы.Вставить("ИмяМакета"		 	 , "Макет");	//ИмяМакета);
	//ПараметрыФормы.Вставить("ПредставлениеМакета", "Анализ оттранслированных проводок по вводу в эксплуатацию ОС");	//ПредставлениеМакета);
	//ПараметрыФормы.Вставить("МассивСсылок" 	 	 , МассивСсылок);
	//ПараметрыФормы.Вставить("ПараметрыПечати"	 , ПараметрыПечати);
	//
	//// Откроем форму печати документов.
	//ФормаПечати = ПолучитьФорму("ОбщаяФорма.бит_ФормаПечатиУправляемая", ПараметрыФормы, ЭтаФорма, КлючУникальности);
	//ФормаПечати.Открыть();
	
	ТабДок = ПечатьНажатие_Сервер();
	ИдентификаторПечатнойФормы = "АнализОттранслированныхПроводокОС";
	НазваниеПечатнойФормы = НСтр("ru='Анализ оттранслированных проводок по вводу в эксплуатацию ОС");
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент     = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОсновныеСредстваПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОсновныеСредстваПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Копирование = Истина Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКомпоновкиДанных = Обработки.бит_му_АнализОттранслированныхПроводокОС.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	АдресСхемыКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных,  УникальныйИдентификатор);
	Объект.ПостроительОтчета.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанных));
	Объект.ПостроительОтчета.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	
	Объект.БылоДвижениеРСБУ = Истина;
	// Вызов механизма справочной информации.
    //бит_си_ОбщегоНазначения.УстановитьПодменюСИ(ЭтаФорма,ЭтаФорма);
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	
	//ИнициализацияТекстаЗапроса();

КонецПроцедуры

// Процедура - обработчик события ""Нажатие"" кнопки ""ОткрытьСИ"" коммандной панели ""ДействияФормы"". 
// Открывает справку по данной форме.
//
//&НаКлиенте
//Процедура бит_си_ДействияФормыОткрытьСИ(Команда)
//	
//	бит_си_ОбщегоНазначения.ОткрытьСИ(Команда);
//	
//КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНажатиеНаСервере()
	
	 
	ПараметрыГраницы = Новый Массив(2);
	ПараметрыГраницы[0] = КонецДня(Объект.ДатаКон);
	ПараметрыГраницы[1] = ВидГраницы.Включая;
	Граница = Новый(Тип("Граница"),ПараметрыГраницы);
	
	//Инициализируем настроеки СКД
	НастройкиКомпановщика = Объект.ПостроительОтчета.Настройки;
	ПараметрыНастройки = НастройкиКомпановщика.ПараметрыДанных;
	
	//Устанавливаем Параметры СКД
	//Параметр "Источник"
	//ПостроительОтчета.Параметры.Вставить("Источник", Справочники.бит_ОбъектыСистемы.НайтиПоКоду("000001024"));
	//ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Источник"));
	//ЗначениеПараметра.Значение = Справочники.бит_ОбъектыСистемы.НайтиПоКоду("000001024");
	
		
	//Параметр "НачалоПериода1"
	//ПостроительОтчета.Параметры.Вставить("НачалоПериода1", ДобавитьМесяц(ДатаНач,-1));
	ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("НачалоПериода1"));
	ЗначениеПараметра.Значение = ДобавитьМесяц(Объект.ДатаНач,-1);
	
	//Параметр "ДатаОстатков"
	//ПостроительОтчета.Параметры.Вставить("ДатаОстатков",Граница);
	//ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДатаОстатков"));
	//ЗначениеПараметра.Значение = КонецДня(Объект.ДатаКон);	//Граница;

	//Параметр "Период"
	ПериодСКД = Новый СтандартныйПериод;
	ПериодСКД.ДатаНачала = НачалоДня(Объект.ДатаНач);
	ПериодСКД.ДатаОкончания = КонецДня(Объект.ДатаКон);
	//ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
	ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОбработки"));
	ЗначениеПараметра.Значение = ПериодСКД;
	
	//установлено в СКД
	//ПостроительОтчета.Параметры.Вставить("НачалоПериода", ДатаНач);
	//ПостроительОтчета.Параметры.Вставить("КонецПериода", КонецДня(ДатаКон));
	//ПостроительОтчета.Параметры.Вставить("Счет01",ПланыСчетов.Хозрасчетный.ОсновныеСредства);
	//ПостроительОтчета.Параметры.Вставить("Счет03",ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
	//ПостроительОтчета.Параметры.Вставить("Счет08",ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
	
	//Параметр "БылоДвижениеРСБУ"
	//ПостроительОтчета.Параметры.Вставить("БылоДвижениеРСБУ",БылоДвижениеРСБУ);
	ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("БылоДвижениеРСБУ"));
	ЗначениеПараметра.Значение = Объект.БылоДвижениеРСБУ;
	
	//Параметр "Организация"
	//ПостроительОтчета.Параметры.Вставить("Организация",Организация);
	ЗначениеПараметра = ПараметрыНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	ЗначениеПараметра.Значение = Объект.Организация;
	
		
	// BIT Amerkulov 08072014 ++
	//Установлено в СКД
	//ПостроительОтчета.Параметры.Вставить("Счет111", ПланыСчетов.бит_Дополнительный_2.ОС);
	//ПостроительОтчета.Параметры.Вставить("Счет12", ПланыСчетов.бит_Дополнительный_2.НезавершенноеСтроительство);
	//ПостроительОтчета.Параметры.Вставить("Счет07",ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
	//Параметр "СписокСчетовМСФО"
	//ПостроительОтчета.Параметры.Вставить("СписокСчетовМСФО", СписокМСФО);
	
	//СписокМСФО = Новый Массив;
	//СписокМСФО.Добавить(ПланыСчетов.бит_Дополнительный_2.ОС);
	//СписокМСФО.Добавить(ПланыСчетов.бит_Дополнительный_2.НезавершенноеСтроительство);
	//ЗначениеПараметра = ПараметаНастройки.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокСчетовМСФО"));
	//ЗначениеПараметра.Значение = СписокМСФО;
	// BIT Amerkulov 08072014 -- 
	
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	Если ТипЗНЧ(СхемаКомпоновкиДанных) = Тип("Неопределено") Тогда
	    СхемаКомпоновкиДанных = Обработки.бит_му_АнализОттранслированныхПроводокОС.ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	КонецЕсли;
	
	//получаем компоновщик макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Объект.ПостроительОтчета.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	//Получаем процессор компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,Истина);
	
	//Определим и получим результат
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	
	Для Каждого Строка Из ТаблицаРезультат Цикл
		НоваяСтрока = Объект.ОсновныеСредства.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура СоздатьДокументыКомплектацииНаСервере()
	ЗапросМассиваОС = Новый Запрос;
	ЗапросМассиваОС.Текст = "ВЫБРАТЬ
	                        |	ВнешняяТаблицаОбработки.ОсновноеСредство
	                        |ПОМЕСТИТЬ ВТВТ
	                        |ИЗ
	                        |	&ТаблицаОбработки КАК ВнешняяТаблицаОбработки
	                        |ГДЕ
	                        |	ВнешняяТаблицаОбработки.Обрабатывать = ИСТИНА
	                        |;
	                        |
	                        |////////////////////////////////////////////////////////////////////////////////
	                        |ВЫБРАТЬ
	                        |	ВТВТ.ОсновноеСредство
	                        |ИЗ
	                        |	ВТВТ КАК ВТВТ
	                        |
	                        |СГРУППИРОВАТЬ ПО
	                        |	ВТВТ.ОсновноеСредство";
							
	ЗапросМассиваОС.УстановитьПараметр("ТаблицаОбработки", Объект.ОсновныеСредства.Выгрузить());							
	ТаблицаМассиваОС= ЗапросМассиваОС.Выполнить().Выгрузить();
	МассивОС = ТаблицаМассиваОС.ВыгрузитьКолонку("ОсновноеСредство");
	
	Если МассивОС.Количество() = 0 Тогда
		//Предупреждение("Не выбрано ни одной строки", 6);
		Сообщить("Не выбрано ни одной строки",СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	Для Каждого ОС ИЗ МассивОС Цикл
		
		ОСICLL = ?(ОС.БИТ_ГруппаОСУУ = Справочники.бит_му_КлассыОсновныхСредств.ICLL, Истина, Ложь);
				
		ЗапросКСтрокамОсновногоСредства = Новый Запрос;
		ЗапросКСтрокамОсновногоСредства.Текст = "ВЫБРАТЬ
		                                        |	ВнешняяТаблицаОбработки.ОсновноеСредство,
		                                        |	ВнешняяТаблицаОбработки.СчетРСБУ,
		                                        |	ВнешняяТаблицаОбработки.СубконтоРСБУ
		                                        |ПОМЕСТИТЬ ВТВТ
		                                        |ИЗ
		                                        |	&ТаблицаОбработки КАК ВнешняяТаблицаОбработки
		                                        |ГДЕ
		                                        |	ВнешняяТаблицаОбработки.Обрабатывать = ИСТИНА
		                                        |	И ВнешняяТаблицаОбработки.ОсновноеСредство = &ОС
		                                        |;
		                                        |
		                                        |////////////////////////////////////////////////////////////////////////////////
		                                        |ВЫБРАТЬ
		                                        |	ВТВТ.ОсновноеСредство,
		                                        |	ВТВТ.СчетРСБУ,
		                                        |	ВТВТ.СубконтоРСБУ
		                                        |ИЗ
		                                        |	ВТВТ КАК ВТВТ
		                                        |
		                                        |СГРУППИРОВАТЬ ПО
		                                        |	ВТВТ.ОсновноеСредство,
		                                        |	ВТВТ.СчетРСБУ,
		                                        |	ВТВТ.СубконтоРСБУ";
							
		ЗапросКСтрокамОсновногоСредства.УстановитьПараметр("ТаблицаОбработки", Объект.ОсновныеСредства.Выгрузить());
		ЗапросКСтрокамОсновногоСредства.УстановитьПараметр("ОС", ОС);
		СтрокиСОсновнымСредством = ЗапросКСтрокамОсновногоСредства.Выполнить().Выгрузить();
		
		НовыйКомплектация = Документы.бит_му_КомплектацияОС.СоздатьДокумент();
		НовыйКомплектация.Дата = КонецДня(Объект.ДатаКон);
		НовыйКомплектация.Организация = Объект.Организация;
		Если НЕ ОСICLL Тогда
			НовыйКомплектация.ОсновноеСредство = ОС;
		Иначе
			НовыйКомплектация.ОсновноеСредствоICLL = ОС;
		КонецЕсли;
		
		Для Каждого СтрокаОС ИЗ СтрокиСОсновнымСредством Цикл
			ЗапросПоСчетуИАналитике = Новый Запрос;
			ЗапросПоСчетуИАналитике.Текст = "ВЫБРАТЬ
			                                |	ХозрасчетныйОбороты.Регистратор,
			                                |	ХозрасчетныйОбороты.Счет,
			                                |	ХозрасчетныйОбороты.СуммаОборотДт,
			                                |	ХозрасчетныйОбороты.СуммаОборотКт,
			                                |	ХозрасчетныйОбороты.Субконто1,
			                                |	ХозрасчетныйОбороты.Субконто2,
			                                |	ХозрасчетныйОбороты.Субконто3,
			                                |	ВЫБОР
			                                |		КОГДА ХозрасчетныйОбороты.СуммаОборотКт = 0
			                                |				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет01, &Счет03, &Счет08)
			                                |			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
			                                |		ИНАЧЕ ХозрасчетныйОбороты.КорСчет
			                                |	КОНЕЦ КАК КорСчет,
			                                |	ВЫБОР
			                                |		КОГДА ХозрасчетныйОбороты.СуммаОборотКт = 0
			                                |				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет01, &Счет03, &Счет08)
			                                |			ТОГДА НЕОПРЕДЕЛЕНО
			                                |		ИНАЧЕ ХозрасчетныйОбороты.КорСубконто1
			                                |	КОНЕЦ КАК КорСубконто1,
			                                |	ВЫБОР
			                                |		КОГДА ХозрасчетныйОбороты.СуммаОборотКт = 0
			                                |				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет01, &Счет03, &Счет08)
			                                |			ТОГДА НЕОПРЕДЕЛЕНО
			                                |		ИНАЧЕ ХозрасчетныйОбороты.КорСубконто2
			                                |	КОНЕЦ КАК КорСубконто2,
			                                |	ВЫБОР
			                                |		КОГДА ХозрасчетныйОбороты.СуммаОборотКт = 0
			                                |				И НЕ ХозрасчетныйОбороты.КорСчет В ИЕРАРХИИ (&Счет01, &Счет03, &Счет08)
			                                |			ТОГДА НЕОПРЕДЕЛЕНО
			                                |		ИНАЧЕ ХозрасчетныйОбороты.КорСубконто3
			                                |	КОНЕЦ КАК КорСубконто3
			                                |ИЗ
			                                |	РегистрБухгалтерии.Хозрасчетный.Обороты(
			                                |			&ДатаНач,
			                                |			&ДатаКон,
			                                |			Запись,
			                                |			Счет = &Счет,
			                                |			,
			                                |			Организация = &Организация
			                                |				И (Субконто1 = &Субконто
			                                |					ИЛИ Субконто2 = &Субконто
			                                |					ИЛИ Субконто3 = &Субконто),
			                                |			,
			                                |			) КАК ХозрасчетныйОбороты
			                                |ГДЕ
			                                |	НЕ(ХозрасчетныйОбороты.Счет В ИЕРАРХИИ (&Счет08)
			                                |				И ХозрасчетныйОбороты.СуммаОборотКт = 0)";
			ЗапросПоСчетуИАналитике.УстановитьПараметр("ДатаНач"    , ДобавитьМесяц(Объект.ДатаНач,-1));											
			//ЗапросПоСчетуИАналитике.УстановитьПараметр("ДатаНач"    , );											
			ЗапросПоСчетуИАналитике.УстановитьПараметр("ДатаКон"    , ДобавитьМесяц(КонецДня(Объект.ДатаКон),1));
			
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Субконто"   , СтрокаОС.СубконтоРСБУ);
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Счет"       , СтрокаОС.СчетРСБУ);
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Организация", Объект.Организация);
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Счет01",ПланыСчетов.Хозрасчетный.ОсновныеСредства);
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Счет03",ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
			ЗапросПоСчетуИАналитике.УстановитьПараметр("Счет08",ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы);
			
			Выборка = ЗапросПоСчетуИАналитике.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				НоваяСтрокаКомплектации = НовыйКомплектация.ОсновныеСредства.Добавить();
				НоваяСтрокаКомплектации.ОсновноеСредство = ОС;
				НоваяСтрокаКомплектации.ДокументРСБУ = Выборка.Регистратор;
				
				Если НЕ Выборка.СуммаОборотДт = 0 Тогда
					
					НоваяСтрокаКомплектации.Сумма = Выборка.СуммаОборотДт;
					НоваяСтрокаКомплектации.СчетДтРСБУ = Выборка.Счет;
					НоваяСтрокаКомплектации.СубконтоДт1 = Выборка.Субконто1;
					НоваяСтрокаКомплектации.СубконтоДт2 = Выборка.Субконто2;
					НоваяСтрокаКомплектации.СубконтоДт3 = Выборка.Субконто3;
					НоваяСтрокаКомплектации.СчетКтРСБУ  = Выборка.КорСчет;
					НоваяСтрокаКомплектации.СубконтоКт1 = Выборка.КорСубконто1;
					НоваяСтрокаКомплектации.СубконтоКт2 = Выборка.КорСубконто2;
					НоваяСтрокаКомплектации.СубконтоКт3 = Выборка.КорСубконто3;
					
					
				ИначеЕсли НЕ Выборка.СуммаОборотКт = 0 Тогда
					
					НоваяСтрокаКомплектации.Сумма = Выборка.СуммаОборотКт;
					НоваяСтрокаКомплектации.СчетКтРСБУ  = Выборка.Счет;
					НоваяСтрокаКомплектации.СубконтоКт1 = Выборка.Субконто1;
					НоваяСтрокаКомплектации.СубконтоКт2 = Выборка.Субконто2;
					НоваяСтрокаКомплектации.СубконтоКт3 = Выборка.Субконто3;
					НоваяСтрокаКомплектации.СчетДтРСБУ  = Выборка.КорСчет;
					НоваяСтрокаКомплектации.СубконтоДт1 = Выборка.КорСубконто1;
					НоваяСтрокаКомплектации.СубконтоДт2 = Выборка.КорСубконто2;
					НоваяСтрокаКомплектации.СубконтоДт3 = Выборка.КорСубконто3;

					
				КонецЕсли;
				
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ
				               |	бит_му_КомплектацияОС.СоставОС
				               |ИЗ
				               |	РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
				               |ГДЕ
				               |	бит_му_КомплектацияОС.ОС = &ОС
				               |	И бит_му_КомплектацияОС.СчетРСБУ = &СчетРСБУ
				               |	И бит_му_КомплектацияОС.АналитикаРСБУ = &АналитикаРСБУ
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	бит_му_КомплектацияОС.СоставОС";
				Запрос.УстановитьПараметр("ОС", СтрокаОС.ОсновноеСредство);				
				Запрос.УстановитьПараметр("СчетРСБУ", СтрокаОС.СчетРСБУ);
				Запрос.УстановитьПараметр("АналитикаРСБУ",СтрокаОС.СубконтоРСБУ);
				Таблица = Запрос.Выполнить().Выгрузить();
				Если Таблица.Количество() = 1 Тогда
					НоваяСтрокаКомплектации.СоставОСМСФОСтарый = Таблица[0].СоставОС;
				КонецЕсли;
								
				Если НоваяСтрокаКомплектации.СчетДтРСБУ = ПланыСчетов.Хозрасчетный.ОсновныеСредства
					ИЛИ НоваяСтрокаКомплектации.СчетДтРСБУ = ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ
					ИЛИ НоваяСтрокаКомплектации.СчетДтРСБУ = ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы
					ИЛИ НоваяСтрокаКомплектации.СчетДтРСБУ.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ОсновныеСредства)
					ИЛИ НоваяСтрокаКомплектации.СчетДтРСБУ.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ)
					ИЛИ НоваяСтрокаКомплектации.СчетДтРСБУ.ПринадлежитЭлементу(ПланыСчетов.Хозрасчетный.ВложенияВоВнеоборотныеАктивы) Тогда
					
				НоваяСтрокаКомплектации.СоставОСМСФОНовый = Справочники.бит_му_СоставОС.ВНА_РСБУ;	
					
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
		НовыйКомплектация.Комментарий = "Документ создан автоматически на основании обработки ""Анализ оттранслированных ОС""";
		НовыйКомплектация.Записать(РежимЗаписиДокумента.Запись);		
		Сообщить("Создан документ №"+НовыйКомплектация.Номер);
		
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ПанельЗакладокПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Элементы.кнВыполнить.Видимость = НЕ(ТекущаяСтраница.Имя = "СтраницаНастройки");
	Элементы.кнПечать.Видимость = НЕ(ТекущаяСтраница.Имя = "СтраницаНастройки");

КонецПроцедуры

&НаКлиенте
Процедура ТабличноеПолеОсновныеСредстваОбрабатыватьПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Модифицированность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПостроительОтчетаНастройкиОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Модифицированность = Ложь;
КонецПроцедуры


КоличествоЭкземпляров  = 1;
НаПринтер              = ЛОЖЬ;
НепосредственнаяПечать = ЛОЖЬ;

