
#Область ОбработчикиСобытий

// Процедура - обработчик команды "ОткрытьОтчетГрафикиДоговоров".
// 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	мДоговорКонтрагента = бит_ДоговораСервер.НайтиДоговорКонтрагентаПоПроектуДоговора(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("КлючВарианта", "Общий");
	
	ФормаОтчета = ПолучитьФорму("Отчет.бит_ГрафикиДоговоров.Форма"
				,ПараметрыФормы
				,ПараметрыВыполненияКоманды.Источник
				,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
				,ПараметрыВыполненияКоманды.Окно);
	
	КомпоновщикНастроек   = ФормаОтчета.Отчет.КомпоновщикНастроек;
	НастройкиКомпоновщика = ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек);
	
	НастройкиКомпоновщика.Отбор.Элементы.Очистить();
	
	ФормаОтчета.Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновщика);
	
	ФормаОтчета.Отчет.ПроектДоговора = ПараметрКоманды;
	ФормаОтчета.Отчет.Регистратор 	 = Неопределено;
	
	ФормаОтчета.СкомпоноватьРезультат();
	
	ФормаОтчета.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция получает настройки компоновщика настроек.
//
&НаСервере
Функция ПолучитьНастройкиКомпоновщика(КомпоновщикНастроек)
	
	Возврат КомпоновщикНастроек.ПолучитьНастройки();
	
КонецФункции

#КонецОбласти


