
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = ТекущаяДатаСеанса();
	КонецПериода = ТекущаяДатаСеанса();
	ЗагружаемаяСтавка = "MosPrime1";
	ВидСтавки = Справочники.бит_му_ВидыДополнительныхСтавок.СБ_MosPrimeRateOneMonth;
	Элементы.ЗагружаемаяСтавка.Заголовок = Справочники.бит_му_ВидыДополнительныхСтавок.СБ_MosPrimeRateOneMonth.Наименование;
	Элементы.ЗагружаемаяСтавка1.Заголовок = Справочники.бит_му_ВидыДополнительныхСтавок.СБ_MosPrimeRateThreeMonths.Наименование;
	
	ОбновитьДанныеРегистра();
	
КонецПроцедуры
	
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Процедура-обработчик события "Нажатие" кнопки "КнопкаВыбораПериода"
//
&НаКлиенте
Процедура ВыбПериодНажатие(Элемент)
	
	НастройкаПериода = Новый СтандартныйПериод(НачалоПериода, ?(КонецПериода='0001-01-01', КонецПериода, КонецДня(КонецПериода)));
	НастройкаПериода.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = НастройкаПериода;
	Диалог.Показать(Новый ОписаниеОповещения("ВыбПериодНажатиеЗавершение", ЭтотОбъект, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбПериодНажатиеЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    Если Период <> Неопределено Тогда
        НачалоПериода = Диалог.Период.ДатаНачала;
        КонецПериода = Диалог.Период.ДатаОкончания;
    КонецЕсли;
    ОбновитьДанныеРегистра();

КонецПроцедуры // ВыбПериодНажатие()

// Процедура-обработчик события "ПриИзменении" поля "НачалоПериода"
//
&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	ОбновитьДанныеРегистра();
	
КонецПроцедуры // НачалоПериодаПриИзменении()

// Процедура-обработчик события "ПриИзменении" поля "КонецПериода"
//
&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	ОбновитьДанныеРегистра();
	
КонецПроцедуры // КонецПериодаПриИзменении()

// Процедура-обработчик события "ПриИзменении" поля "ЗагружаемаяСтавка"
//
&НаКлиенте
Процедура ЗагружаемаяСтавкаПриИзменении(Элемент)
	
	Если ЗагружаемаяСтавка = "MosPrime1" Тогда
		ВидСтавки = ПредопределенноеЗначение("Справочник.бит_му_ВидыДополнительныхСтавок.СБ_MosPrimeRateOneMonth");
	ИначеЕсли ЗагружаемаяСтавка = "MosPrime3" Тогда
		ВидСтавки = ПредопределенноеЗначение("Справочник.бит_му_ВидыДополнительныхСтавок.СБ_MosPrimeRateThreeMonths");
	КонецЕсли;	
		
	ОбновитьДанныеРегистра();
	
КонецПроцедуры
 // ЗагружаемаяСтавкаПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ ДанныеРегистра

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Процедура-обработчик события "Нажатие" кнопки "Загрузить"
//
&НаКлиенте
Процедура КнопкаЗагрузитьНажатие(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда
		Сообщить("Не указано начало периода!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(КонецПериода) Тогда
		Сообщить("Не указан конец периода!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если НачалоПериода > КонецПериода Тогда
		Сообщить("Конец периода должен быть больше начала периода!", СтатусСообщения.Важное);
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузкаДанных_Вызов_Функции(ВидСтавки, НачалоПериода, КонецПериода);
	Элементы.ДанныеРегистра.Обновить();
	
КонецПроцедуры // КнопкаЗагрузитьНажатие()

&НаСервере
Функция ЗагрузкаДанных_Вызов_Функции(ВидСтавки, НачалоПериода, КонецПериода)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузкаДанных(ВидСтавки, НачалоПериода, КонецПериода);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОПОВЕЩЕНИЙ

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура производит установку отбора по периоду и виду ставки в табличном поле "Данные регистра"
//
&НаСервере
Процедура ОбновитьДанныеРегистра()	
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДанныеРегистра, "ВидСтавки");
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ДанныеРегистра, "Период");
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДанныеРегистра, "ВидСтавки", ВидСтавки);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДанныеРегистра, "Период", НачалоПериода, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ДанныеРегистра, "Период", КонецПериода, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно);
	
КонецПроцедуры // ОбновитьДанныеРегистра()

