#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли; 	
	
	бит_ук_СлужебныйСервер.РегистрацияНачалоСобытия(Отказ, ЭтотОбъект.ДополнительныеСвойства);
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	Для каждого СтрокаТаблицы Из НастройкиПодключений Цикл
	
		Если НЕ СтрокаТаблицы.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
		
			Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.НастройкаПодключения) Тогда
				
				Отказ = Истина;
				ТекстСообщения = НСтр("ru = 'В строке № %1% табличной части ""%2%"" не указана настройка подключения для вида ИБ ""%3%""!'");
				ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения
				                                                                               ,СтрокаТаблицы.НомерСтроки
																							   ,"Настройки подключений"
																							   ,СтрокаТаблицы.ВидИнформационнойБазы);
																							   
				бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);																			   
			
			КонецЕсли; 
		
		КонецЕсли; 
	
	КонецЦикла; // НастройкиПодключений
	          	
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияПриЗаписи(Отказ, ЭтотОбъект.ДополнительныеСвойства, Метаданные().ПолноеИмя());
		
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
