
&НаКлиенте
Процедура СсылкаRetrieverНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные <> Неопределено
		И СтрДлина(ТекущиеДанные.СсылкаRetriever) > 0 Тогда 
	
		ЗапуститьПриложение(ТекущиеДанные.СсылкаRetriever);
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "СсылкаRetriever" Тогда 
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		Если ТекущиеДанные <> Неопределено
			И СтрДлина(ТекущиеДанные.СсылкаRetriever) > 0 Тогда 
			
			СтандартнаяОбработка = Ложь;
			ЗапуститьПриложение(ТекущиеДанные.СсылкаRetriever);
		
		КонецЕсли;
	
	КонецЕсли;
	
КонецПроцедуры
