
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
			
		мТипыДокументов = РеквизитФормыВЗначение("СписокТиповДокументов");
		
		НаборЗаписей = РегистрыБухгалтерии.бит_Дополнительный_2.СоздатьНаборЗаписей();
		ВсеСсылки = НаборЗаписей.Отбор.Регистратор.ТипЗначения.Типы();

		
		Для Каждого Строка из ВсеСсылки Цикл 
			
			СтрокаТипов = мТипыДокументов.Добавить();
			СтрокаТипов.ТипДокументов = Строка;
			
		КонецЦикла;
		
	    ЗначениеВРеквизитФормы(мТипыДокументов,"СписокТиповДокументов");

	
КонецПроцедуры

&НаКлиенте
Процедура СписокТиповДокументовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекДанные = Элементы.СписокТиповДокументов.ТекущиеДанные;
	Выбор = ТекДанные.ТипДокументов;
	ЭтаФорма.Закрыть(Выбор);

КонецПроцедуры
