
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОбновитьОбъектыСистемы(Команда)
	
	ТекстСостояние =  НСтр("ru = 'Выполняется обновление объектов системы...'");
	Состояние(ТекстСостояние);
	
	ОбновитьОбъектыСистемы();
	
КонецПроцедуры // КомандаОбновитьОбъектыСистемы()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет обновление объектов системы.
// 
&НаСервере
Процедура ОбновитьОбъектыСистемы()

	бит_УправлениеОбъектамиСистемы.ОбновитьОбъектыСистемы();
	ТекстСообщения =  НСтр("ru = 'Объекты системы обновлены.'");
	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);

КонецПроцедуры // ОбновитьОбъектыСистемы()

#КонецОбласти

