
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);

	ЭтоСемействоЕРП = бит_ОбщегоНазначения.ЭтоСемействоERP();
	
	ПодключитьСхемы(ЭтоСемействоЕРП);
	
	УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СхемаОсновныеСредстваВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура СхемаНМАВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура СхемаФинансоваяАрендаВыбор(Элемент)
	ИмяЭлемента = Элемент.ТекущийЭлемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Элемент)

	ИмяЭлемента = Элемент.Имя;
	// Для дублирующихся элементов убираем номер из имени.
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_ФормаСписка1","_ФормаСписка");	
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма1","_Форма");
	ИмяЭлемента = СтрЗаменить(ИмяЭлемента, "_Форма2","_Форма");
	бит_РаботаСДиалогамиКлиент.ОткрытьФормуПоИмени(ИмяЭлемента, Новый Структура("ПреобразоватьИзИмени",Истина));
	
КонецПроцедуры	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью элементов формы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура УправлениеВидимостьюЭлементов(ЭтоСемействоЕРП)
	
	Если ЭтоСемействоЕРП Тогда
		
		Элементы.Справочник_ОсновныеСредства_ФормаСписка.Видимость  = Ложь;
		Элементы.Справочник_ОсновныеСредства_ФормаСписка1.Видимость = Ложь;
		
	Иначе
		
		Элементы.Справочник_ОбъектыЭксплуатации_ФормаСписка.Видимость  = Ложь;
		Элементы.Справочник_ОбъектыЭксплуатации_ФормаСписка1.Видимость = Ложь;
		
	КонецЕсли; 	 
	
КонецПроцедуры // УправлениеВидимостьюЭлементов()

// Процедура подключает макеты-схемы.
// 
// Параметры:
//  ЭтоСемействоЕРП - Булево
//
&НаСервере
Процедура ПодключитьСхемы(ЭтоСемействоЕРП)
	
	СхемаОсновныеСредства = Обработки.бит_ПанельФункций_ВНА.ПолучитьМакет("СхемаОсновныеСредства");
	СхемаНМА 			  = Обработки.бит_ПанельФункций_ВНА.ПолучитьМакет("СхемаНМА");
	СхемаФинансоваяАренда = Обработки.бит_ПанельФункций_ВНА.ПолучитьМакет("СхемаФинансоваяАренда");
	
КонецПроцедуры// ПодключитьСхемы()

#КонецОбласти
