#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений;
	Для каждого ЗначениеПеречисления Из Перечисления.бит_ТипыПроизвольныхОтчетов Цикл
		Если ЗначениеПеречисления = Перечисления.бит_ТипыПроизвольныхОтчетов.ОтчетностьМСФО 
		   И Не бит_ОбщегоНазначения.ЕстьОбъектыМСФО() Тогда
			Продолжить;	
		КонецЕсли;
		ДанныеВыбора.Добавить(ЗначениеПеречисления);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли