
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Родитель = ПредопределенноеЗначение("Справочник.бит_СтатусыОбъектов.СостоянияЗадач") 
		ИЛИ Родитель = ПредопределенноеЗначение("Справочник.бит_СтатусыОбъектов.СостоянияПроцессов") Тогда
		
		// Состояния задач и процессов фиксированы
		ТекстСообщения =  НСтр("ru = 'Изменение состава группы ""%1%"" запрещено.'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения, Родитель);
		Отказ = Истина;
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
КонецПроцедуры // СписокПередНачаломДобавления()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьШрифтАвто(Команда)
	
	УстановитьШрифтАвтоНаСервере();
		
КонецПроцедуры // УстановитьШрифтАвто()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьШрифтАвтоНаСервере()
	
	Справочники.бит_СтатусыОбъектов.УстановитьШрифтАвто(); 
	
КонецПроцедуры // УстановитьШрифтАвтоНаСервере()

#КонецОбласти
 