
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не РольДоступна("ПолныеПрава") Тогда 
		Элементы.Настройки.Видимость = Ложь;
	КонецЕсли;
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(НастройкиМеханизмаИмпортаДанных, "Группа", "ЗагрузкаИнициаторовGlobal");
	
	мОбновление = Ложь;
	Если Параметры.Свойство("мОбновление") Тогда 
		мОбновление = Параметры.мОбновление;
	КонецЕсли;
	
//ОК Калинин М. 21082012 Разделение функционала 	
	если мОбновление тогда
		Элементы.Загрузка.Видимость=ложь;
		Элементы.НовыеДанные.Видимость=истина;
		ЭтаФорма.Заголовок="Обновление данных из Global";
	иначе
		Элементы.НовыеДанные.Видимость=ложь;
		ЭтаФорма.Заголовок="Загрузка данных из Global";
	конецесли;
//ОК Калинин М.

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзGlobalНажатие(Элемент)
	
	//ОК Довбешка Т. деперсонификации почты
	Если лев(Объект.EmailПоиска,5) <> "OKEY\" Тогда
		Объект.EmailПоиска = "OKEY\" + Объект.EmailПоиска; 
	КонецЕсли;
	//ОК
	ЗагрузитьИзGlobalНажатиеНаСервере();
	НайтиПоEmail();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзGlobalНажатиеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьИзGlobal();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоEmail() Экспорт
	Адрес = НайтиПоEmailНаСервере();
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда 
		ОткрытьФорму("Обработка.ОК_ЗагрузкаИнициатораGlobal.Форма.ФормаВыбораИнициатора", Новый Структура("Адрес", Адрес),,,,, Новый ОписаниеОповещения("НайтиПоEmailЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоEmailЗавершение(Результат, ДополнительныеПараметры) Экспорт
    
	Если Результат <> Неопределено Тогда 
		Объект.Элемент = Результат;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиПоEmailНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	бит_БК_Инициаторы.Ссылка
	|ИЗ
	|	Справочник.бит_БК_Инициаторы КАК бит_БК_Инициаторы
	|ГДЕ
	//|	бит_БК_Инициаторы.Email = &Email";
	//ОК Довбешка Т. деперсонификации почты
	|	бит_БК_Инициаторы.DomainName = &Email";
	//ОК
	
	Запрос.УстановитьПараметр("Email", Объект.EmailПоиска);
	
	ТЗРезультат = Запрос.Выполнить().Выгрузить();
	
	Если ТЗРезультат.Количество() > 1 Тогда 
		Возврат ПоместитьВоВременноеХранилище(ТЗРезультат, УникальныйИдентификатор);
	ИначеЕсли ТЗРезультат.Количество() = 1 Тогда 
		Объект.Элемент = ТЗРезультат[0].Ссылка;
		//Сообщить("Найден инициатор с заданным Email и помещен в реквизит ""Элемент справочника""");
		//ОК Довбешка Т. деперсонификации почты
		Сообщить("Найден инициатор с заданным доменным именем и помещен в реквизит ""Элемент справочника""");
		//ОК
	Иначе 
		Объект.Элемент = Справочники.бит_БК_Инициаторы.ПустаяСсылка();
	КонецЕсли; 
	
КонецФункции

&НаСервере
Функция ОсновнаяПанельПриСменеСтраницы_Сервер()
	Если Элементы.ОсновнаяПанель.ТекущаяСтраница = Элементы.Настройки Тогда 
		Если Команды.Найти("ОбновитьПодключение") = Неопределено Тогда 
			Команда = Команды.Добавить("ОбновитьПодключение");
			Команда.Действие = "КнопкаОбновитьПодключение";
		КонецЕсли;
		Кнопка = Элементы.Добавить("ОбновитьПодключение", Тип("КнопкаФормы"), КоманднаяПанель);
		Кнопка.ИмяКоманды = "ОбновитьПодключение";
		Кнопка.Заголовок = "Обновить подключение";
	Иначе 
		Кнопка = Элементы.Найти("ОбновитьПодключение");
		Если Кнопка <> Неопределено Тогда 
			Элементы.Удалить(Кнопка);
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОсновнаяПанельПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ОсновнаяПанельПриСменеСтраницы_Сервер();	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаОбновитьПодключение(Команда)
	КнопкаОбновитьПодключениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КнопкаОбновитьПодключениеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ПодключеноКБазе = Ложь;
	_объект.ПодключениеКБазе();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНажатие(Элемент)
	СохранитьНажатиеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СохранитьНажатиеНаСервере()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.СохранитьЭлементСправочника();	
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецПроцедуры

&НаКлиенте
Процедура EmailПоискаПриИзменении(Элемент)
	НайтиПоEmail();
КонецПроцедуры

//ОК Калинин М. 21082012 функционал обновления данных из Global
&НаКлиенте
Процедура ИзмененыеЗаписиНажатие(Элемент)
	// Вставить содержимое обработчика.
	НайтиИзмененныеЗаписи_Вызов_Функции();
	УстановитьФлажки(истина,истина);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельДокументыНаЭкспортУстановитьФлажки(Команда)
	УстановитьФлажки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельДокументыНаЭкспортСнятьФлажки(Команда)
	УстановитьФлажки(Ложь);
КонецПроцедуры

//Процедура установки/снятия флажков
//
&НаКлиенте
Процедура УстановитьФлажки(Флаг,ЕслиЕстьОднофамильцУбратьФлажок=ложь)
	Для каждого СтрокаДокумента из Объект.ДанныеДляОбновления Цикл
		Если Элементы.ДанныеДляОбновления.ПроверитьСтроку(СтрокаДокумента.ПолучитьИдентификатор()) Тогда
			СтрокаДокумента.Выгружать = Флаг и ?(ЕслиЕстьОднофамильцУбратьФлажок и СтрокаДокумента.ЕстьОднофамилец,ложь,истина);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры //УстановитьФлажки

&НаСервере
Функция НовыеДанные(Элемент,Поле,новыеданные)	
	Если ЗначениеЗаполнено(новыеданные) тогда
		Элемент[Поле]=новыеданные;
	конецесли;	
конецфункции	

&НаКлиенте
Процедура КоманднаяПанель2ЗаписатьИзGLobal(Команда)
	Если Объект.ДанныеДляОбновления.Количество()=0 тогда
		ПоказатьПредупреждение(Неопределено, "Список с обновлениями пуст! Выполните заполнение обновлений");
	иначе	
		КоманднаяПанель2ЗаписатьИзGLobalНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КоманднаяПанель2ЗаписатьИзGLobalНаСервере()
	Для каждого СтрокаДокумента из Объект.ДанныеДляОбновления Цикл
		Если СтрокаДокумента.Выгружать тогда
			Элемент_=СтрокаДокумента.Элемент.ПолучитьОбъект();
			Попытка
				Элемент_.Заблокировать();
				НовыеДанные(Элемент_,"Email",		СтрокаДокумента.Global_Email);
				НовыеДанные(Элемент_,"Руководитель",СтрокаДокумента.Global_ManFullName);
				НовыеДанные(Элемент_,"Отдел",		СтрокаДокумента.Global_FunctionName);			
				НовыеДанные(Элемент_,"Должность",	СтрокаДокумента.Global_Title);						
				НовыеДанные(Элемент_,"DomainName",	СтрокаДокумента.Global_UserLogin);						
				Элемент_.Записать();
			Исключение
				    сообщить( ОписаниеОшибки());
			конецпопытки
		КонецЕсли;
	КонецЦикла;
КонецФункции

&НаСервере
Функция НайтиИзмененныеЗаписи_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.НайтиИзмененныеЗаписи();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции
//ОК Калинин М. 21082012 
