
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ложь Тогда
		Элементы.ГруппаОсновная.ТолькоПросмотр = Истина;
		Элементы.ГруппаИнформация.Видимость    = Истина;
		
		Сведения = бит_ОбщегоНазначения.ПолучитьСведенияОПрограмме();
		Элементы.ИнформационнаяНадпись.Заголовок = "В решении «" + Сведения.Синоним_1С + "» данный регистр недоступен для редактирования. Вносите информацию в регистр «Собственные контрагенты».";
	КонецЕсли;
	
	ЗаполнитьКэшЗначений();
	
// +СБ. Широков Николай. 2014-09-03. ТЗ "Казначейство" 2.2.4.2. 
	СБ_РаботаСФормамиОбъекты.бит_СобственныеКонтрагентыФормаЗаписиПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
// -СБ. Широков Николай 

КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбъектНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.ВидСвязи) Тогда
		
		СтандартнаяОбработка = Ложь;
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ТекущийЭлемент" , Запись.Объект);
		СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
		СтруктураПараметров.Вставить("РежимВыбора", Истина);
		Элемент.ВыбиратьТип = Ложь;
	
		Если Запись.ВидСвязи = фКэшЗначений.Перечисления.бит_ВидыСобственныхКонтрагентов.Организация Тогда
			ОткрытьФорму("Справочник.Организации.ФормаВыбора", СтруктураПараметров, Элемент);
		ИначеЕсли Запись.ВидСвязи = фКэшЗначений.Перечисления.бит_ВидыСобственныхКонтрагентов.ФизЛицо Тогда
	    	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаВыбора", СтруктураПараметров, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		КонецЕсли;		
		
	Иначе
		Элемент.ВыбиратьТип = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОбъектНачалоВыбора()

&НаКлиенте
Процедура ОбъектПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Запись.Объект) И Не ЗначениеЗаполнено(Запись.ВидСвязи) Тогда
		Если ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.Организации") Тогда
			Запись.ВидСвязи = фКэшЗначений.Перечисления.бит_ВидыСобственныхКонтрагентов.Организация;
		ИначеЕсли ТипЗнч(Запись.Объект) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Запись.ВидСвязи = фКэшЗначений.Перечисления.бит_ВидыСобственныхКонтрагентов.ФизЛицо;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбъектПриИзменении()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура заполняет  кэш значений.
//
&НаСервере
Процедура ЗаполнитьКэшЗначений()

	фКэшЗначений = Новый Структура;
	
	КэшПеречислений = Новый Структура;
	КэшПеречислений.Вставить("бит_ВидыСобственныхКонтрагентов", бит_ОбщегоНазначения.КэшироватьЗначенияПеречисления(Перечисления.бит_ВидыСобственныхКонтрагентов));
	
	фКэшЗначений.Вставить("Перечисления", КэшПеречислений);

КонецПроцедуры // ЗаполнитьКэшЗначений()

#КонецОбласти
