
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_ЦФО_Подразделения;
	
	// Вызов механизма защиты
	
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли;

	МассивТипов = Метаданные.РегистрыСведений.бит_ЦФО_Подразделения.Измерения.Подразделение.Тип.Типы();
	СписокРез = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	Для каждого Элемент Из СписокРез Цикл   	
		СписокТиповПодразделение.Добавить(Элемент.Значение, Элемент.Представление); 	
	КонецЦикла; 
	              	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	                                                   ,Элемент
	                                                   ,Запись
	                                                   ,"Подразделение"
													   ,СписокТиповПодразделение
													   ,СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры

#КонецОбласти

