
//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-01-22 (#3969)
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
	
		Возврат;
	
	КонецЕсли; 
	
	ВыполнитьПроверкуЗадвоения(Отказ);
	
КонецПроцедуры

Процедура ВыполнитьПроверкуЗадвоения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	рс_МесяцыНачисления.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(рс_МесяцыНачисления.Ссылка) КАК ПредставлениеМесяца
		|ИЗ
		|	Справочник.рс_МесяцыНачисления КАК рс_МесяцыНачисления
		|ГДЕ
		|	рс_МесяцыНачисления.Ссылка <> &Ссылка
		|	И рс_МесяцыНачисления.Дата = &Дата";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("В справочнике уже создан месяц """ + ВыборкаДетальныеЗаписи.ПредставлениеМесяца + """", ВыборкаДетальныеЗаписи.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры
//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-01-22 (#3969)