
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	СтрВозврата = бит_мто.ПроверитьВозможностьСозданияДокумента(ПараметрКоманды);
	
	Если НЕ СтрВозврата.Возможно Тогда
		
		Если ЗначениеЗаполнено(СтрВозврата.ТекстСообщения) Тогда
		
			ТекстСообщения = СтрВозврата.ТекстСообщения;
			
		Иначе	
			ТекстСообщения =  НСтр("ru = 'Превышен остаток по номенклатуре!'");
		КонецЕсли; 
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		Возврат;
		
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ДокументОснование", ПараметрКоманды);
	
	Если СтрВозврата.Возможно Тогда
	
		ОткрытьФорму("Документ.бит_мто_ЗаявкаНаЗакупку.ФормаОбъекта"
		              , ПараметрыФормы
					  , ПараметрыВыполненияКоманды.Источник
					  , ПараметрыВыполненияКоманды.Уникальность
					  , ПараметрыВыполненияКоманды.Окно);
		
	КонецЕсли;				  
					  
КонецПроцедуры

#КонецОбласти


