#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;
	КонецЕсли;
	
    СтруктураИзмерений = Новый Структура;
    СтруктураИзмерений.Вставить("ИмяРегистра"          , "бит_ЦФО_Подразделения");
    СтруктураИзмерений.Вставить("ИмяИзмерения_Объект"  , "ЦФО");
    СтруктураИзмерений.Вставить("ИмяИзмерения_Значения", "Подразделение");
    
    // Проверим уникальность набора записей.
    бит_Бюджетирование.ПроверитьУникальностьСопоставленныхЗначений_ОбъектамВНабореЗаписей(ЭтотОбъект, СтруктураИзмерений, Отказ);
    
КонецПроцедуры

#КонецОбласти

#КонецЕсли
