#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПриЗаписи(Отказ, Замещение)
	
	Для каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.Пользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь") Тогда
			
			// Сбросим кэш настроек текущего пользователя, т.к. он стал неактуальным.
			бит_ОбщиеПеременныеСервер.ЗначениеПеременнойУстановить("бит_ЗначенияНастроекПользователей", Новый Соответствие, ИСТИНА);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
