
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
  	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Обработчик команды "Компилировать все комплекты" формы списка.
// 
&НаКлиенте
Процедура КомпилироватьВсеКомплекты(Команда)
	
	бит_МеханизмХозяйственныхОперацийСервер.ИнтерпретироватьВсеКомплекты();
	
КонецПроцедуры // КомпилироватьВсеКомплекты()

#КонецОбласти


