

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	ПроверитьЗаполнение();
	
	ПараметрНачалоПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрНачалоПериода.Значение = ДатаС;
	ПараметрНачалоПериода.Использование = Истина;
	
	ПараметрКонецПериода = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрКонецПериода.Значение = КонецДня(ДатаПо);
	ПараметрКонецПериода.Использование = Истина;
	
	ПараметрОрганизацияЗаказчик = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияЗаказчик");
	ПараметрОрганизацияЗаказчик.Значение = ОрганизацияЗаказчик;
	ПараметрОрганизацияЗаказчик.Использование = Истина;
	
	ПараметрОрганизацияПодрядчик = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияПодрядчик");
	ПараметрОрганизацияПодрядчик.Значение = ОрганизацияПодрядчик;
	ПараметрОрганизацияПодрядчик.Использование = Истина;
	
	ПараметрПериметрКонсолидации = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ПериметрКонсолидации");
	Если СоздатьДляПериметра = ЛОЖЬ Тогда
		ПараметрПериметрКонсолидации.Значение = Справочники.бит_му_ПериметрыКонсолидации.ПустаяСсылка();
	Иначе
		ПараметрПериметрКонсолидации.Значение = ПериметрКонсолидации;
	КонецЕсли;
	ПараметрПериметрКонсолидации.Использование = Истина;
	
	НашНаборДанных = СхемаКомпоновкиДанных.НаборыДанных.Найти("НаборДанных1");
	
	Если НЕ ЗначениеЗаполнено(ОбъектОС) Тогда
		
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "= &Объект", "<> 2");
		НашНаборДанных.Запрос = СтрЗаменить(НашНаборДанных.Запрос, "ИНАЧЕ ЛОЖЬ", "ИНАЧЕ ИСТИНА");
		
	Иначе
		
		ПараметрОбъект = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Объект");
		ПараметрОбъект.Значение = ОбъектОС;
		ПараметрОбъект.Использование = Истина;
		
	КонецЕсли;
	
	ПараметрСчетВыручки = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетВыручки");
	ПараметрСчетВыручки.Значение = СчетВыручки;
	ПараметрСчетВыручки.Использование = Истина;
		
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СоздатьДляПериметра И НЕ ЗначениеЗаполнено(ПериметрКонсолидации) Тогда
		Отказ = Истина;
		Сообщить("Заполните периметр консолидации", СтатусСообщения.Важное);
	ИначеЕсли НЕ СоздатьДляПериметра И НЕ (ЗначениеЗаполнено(ОрганизацияЗаказчик) И ЗначениеЗаполнено(ОрганизацияПодрядчик)) Тогда
		Отказ = Истина;
		Сообщить("Заполните организации", СтатусСообщения.Важное);
	КонецЕсли;
	
КонецПроцедуры

