#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПервоначальноеЗаполнение() Экспорт

	МассивИмен = Новый Массив;
	МассивИмен.Добавить("КомиссияЗаВыдачу");
	МассивИмен.Добавить("КомиссияЗаНеиспользованныйЛимит");
	МассивИмен.Добавить("ПогашениеОсновногоДолга");
	МассивИмен.Добавить("Проценты");
	
	Для Каждого ИмяЭлемента Из МассивИмен Цикл
		
		ЭлементСправочника = Справочники.бит_СоставляющиеПлатежейПоФинДоговорам[ИмяЭлемента];
		
		Если ЗначениеЗаполнено(ЭлементСправочника.ТипПлатежаПоФинДоговору) Тогда
			Продолжить;			
		КонецЕсли;
		
		ОбъектСправочника = ЭлементСправочника.ПолучитьОбъект();
		Если ИмяЭлемента = "КомиссияЗаВыдачу" Тогда
			ОбъектСправочника.ТипПлатежаПоФинДоговору = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Комиссия;
		ИначеЕсли ИмяЭлемента = "КомиссияЗаНеиспользованныйЛимит" Тогда
			ОбъектСправочника.ТипПлатежаПоФинДоговору = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.КомиссияЗаНеиспользованныйЛимит;
		ИначеЕсли ИмяЭлемента = "ПогашениеОсновногоДолга" Тогда
			ОбъектСправочника.ТипПлатежаПоФинДоговору = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.ОсновнойДолг;
		ИначеЕсли ИмяЭлемента = "Проценты" Тогда	
			ОбъектСправочника.ТипПлатежаПоФинДоговору = Перечисления.бит_ТипыПлатежейПоФинансовымДоговорам.Проценты;
		КонецЕсли;
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектСправочника);
	КонецЦикла;

КонецПроцедуры
 
#КонецОбласти

#КонецЕсли