
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	НеЗаданВладелец = Не Параметры.Отбор.Свойство("Владелец") 
		ИЛИ Не ЗначениеЗаполнено(Параметры.Отбор.Владелец);

КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если НеЗаданВладелец Тогда
		ПоказатьПредупреждение( , НСтр("ru='Справочник используется при вводе данных'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
