
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = Новый СписокЗначений(); 
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ЗаСчет);
	ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.Изменение);
	
	// ++ БП
	Если Параметры.Свойство("ВидОперации") Тогда
		Если Параметры.ВидОперации = Перечисления.бит_ВидыОперацийКорректировкаКонтрольныхЗначений.КонтрольЗаявок Тогда
			ДанныеВыбора.Добавить(Перечисления.бит_ВидыКорректировокКонтрольныхЗначений.ВозвратЛимита);
		КонецЕсли; 
	КонецЕсли; 
	// -- БП 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли