
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		
		ОткрытьФорму("Отчет.бит_ДвиженияДокумента.Форма"
					,Новый Структура("Документ, ПоказыватьДокумент", ПараметрКоманды, Ложь)
					,ПараметрыВыполненияКоманды.Источник
					,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
					,ПараметрыВыполненияКоманды.Окно);
	Иначе
		
		Форма = ПолучитьФорму("Отчет.бит_ДвиженияДокумента.Форма",, Новый УникальныйИдентификатор);
		Форма.Документ = ПараметрКоманды;
		
		Форма.Открыть();
		Форма.СформироватьИВывестиОтчет();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти