
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
//ОК Ванюков К. +// C ограниченными правами вылетало по ошибке // 2013-01-30
	//ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументрс_АккруалБезIDЗагрузитьИзExcel.Видимость = Ложь;
	Если ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.Найти("ФормаДокументрс_АккруалБезIDЗагрузитьИзExcel") <> Неопределено Тогда 
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаДокументрс_АккруалБезIDЗагрузитьИзExcel.Видимость = Ложь;
	КонецЕсли;
//ОК Ванюков К. -	
КонецПроцедуры
