
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ОсновныеСредства") Тогда
		ДатаСведений = ПараметрыВыполненияКоманды.Источник.ДатаСведений;
	Иначе
		ДатаСведений = ТекущаяДата();
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("ТекущийОбъект, ДатаСведений", ПараметрКоманды, ДатаСведений);
	
	ОткрытьФорму("Обработка.бит_СведенияПоМСФО.Форма.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти
