
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПерепроведение(Команда)
	
	ВыполнитьПерепроведениеНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПерепроведениеНаСервере()
	
	МассивДокументы = Новый Массив;
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	СтруктураПоиск.Вставить("ВидОперации", Перечисления.рс_ВидыОперацийРаспределениеРасходовОфисов.НаМагазины);
	МассивДокументы.Добавить(НайтиДокумент(СтруктураПоиск));
	
	СтруктураПоиск.Вставить("ВидОперации", Перечисления.рс_ВидыОперацийРаспределениеРасходовОфисов.НаТЦ);
	МассивДокументы.Добавить(НайтиДокумент(СтруктураПоиск));
	
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	СтруктураПоиск.Вставить("ВидОперации", Перечисления.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов);
	МассивДокументы.Добавить(НайтиДокумент(СтруктураПоиск));
	
	СтруктураПоиск.Вставить("ВидОперации", Перечисления.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ОбработкаТоваровВнутренняя);
	МассивДокументы.Добавить(НайтиДокумент(СтруктураПоиск));
	
	Для Каждого ДокументСсылка Из МассивДокументы Цикл
		
		Если НЕ ЗначениеЗаполнено(ДокументСсылка) Тогда
			Продолжить;
		КонецЕсли;
		
		ПерепроведениеДокумента(ДокументСсылка);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовОфисовНаМагазины(Команда)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаМагазины"));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	
	Если ДокументСсылка = Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.рс_РаспределениеРасходовОфисов.ФормаОбъекта", , ЭтаФорма); 
		// Rarus-spb byse 2012.12.28 {
		Форма.Объект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		// Rarus-spb byse 2012.12.28}
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПоиск);
		Форма.Открыть();

	Иначе
		ПерепроведениеДокумента(ДокументСсылка);
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуПериода(Период)
	Возврат Период.Дата;
КонецФункции
 
&НаСервере
Процедура ПерепроведениеДокумента(ДокументСсылка)
		
		Попытка
			ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
			// Rarus-spb byse 2012.12.28 {
			ДокументОбъект.Дата = КонецМесяца(Объект.Период.Дата);			
			// Rarus-spb byse 2012.12.28}
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Сообщить("Документ " + ДокументОбъект + " перепроведен.");	
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеРасходовОфисовНаТЦ(Команда)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаТЦ"));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	
	Если ДокументСсылка = Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.рс_РаспределениеРасходовОфисов.ФормаОбъекта", , ЭтаФорма); 
		// Rarus-spb byse 2012.12.28 {
		Форма.Объект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		// Rarus-spb byse 2012.12.28}
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПоиск);
		Форма.Открыть();

	Иначе
		
		ПерепроведениеДокумента(ДокументСсылка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов(Команда)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов"));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	
	Если ДокументСсылка = Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.рс_РаспределениеДоходовИРасходовЛогистики.ФормаОбъекта", , ЭтаФорма); 
		// Rarus-spb byse 2012.12.28 {
		Форма.Объект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		// Rarus-spb byse 2012.12.28}
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПоиск);
		Форма.Открыть();

	Иначе
		
		ПерепроведениеДокумента(ДокументСсылка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура РаспределениеЗатратНаОбработкуТоваров(Команда)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ОбработкаТоваровВнутренняя"));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	
	Если ДокументСсылка = Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.рс_РаспределениеДоходовИРасходовЛогистики.ФормаОбъекта", , ЭтаФорма); 
		// Rarus-spb byse 2012.12.28 {
		Форма.Объект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		// Rarus-spb byse 2012.12.28}
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПоиск);
		Форма.Открыть();

	Иначе
		
		ПерепроведениеДокумента(ДокументСсылка);
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРасчетаРаспределениеРасходовОфисовНаМагазины(Команда)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//СтруктураПоиск = Новый Структура;
	//СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	//СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаМагазины"));
	//СтруктураПоиск.Вставить("Организация", Объект.Организация);
	//СтруктураПоиск.Вставить("Период", Объект.Период);
	//
	//ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	//
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ДокументСсылка);
	//
	//бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	//										,"рс_РаспределениеРасходовОфисов"
	//										,"ПротоколРасчета"
	//										,"Протокол расчета"
	//										,МассивСсылок
	//										,ЭтаФорма);
	
	РаспределениеРасходовОфисовПечать("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаМагазины",
		"рс_РаспределениеРасходовОфисов");
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРасчетаРаспределениеРасходовОфисовНаТЦ(Команда)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//СтруктураПоиск = Новый Структура;
	//СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	//СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаТЦ"));
	//СтруктураПоиск.Вставить("Организация", Объект.Организация);
	//СтруктураПоиск.Вставить("Период", Объект.Период);
	//
	//ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	//
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ДокументСсылка);
	//
	//бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	//										,"рс_РаспределениеРасходовОфисов"
	//										,"ПротоколРасчета"
	//										,"Протокол расчета"
	//										,МассивСсылок
	//										,ЭтаФорма);
	
	РаспределениеРасходовОфисовПечать("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаТЦ",
		"рс_РаспределениеРасходовОфисов");
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРасчетаРаспределениеЗатратНаОбработкуТоваров(Команда)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//СтруктураПоиск = Новый Структура;
	//СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	//СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ОбработкаТоваровВнутренняя"));
	//СтруктураПоиск.Вставить("Организация", Объект.Организация);
	//СтруктураПоиск.Вставить("Период", Объект.Период);
	//
	//ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	//
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ДокументСсылка);
	//
	//бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	//										,"рс_РаспределениеДоходовИРасходовЛогистики"
	//										,"ПротоколРасчета"
	//										,"Протокол расчета"
	//										,МассивСсылок
	//										,ЭтаФорма);
	
	РаспределениеРасходовОфисовПечать("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ОбработкаТоваровВнутренняя", 
		"рс_РаспределениеДоходовИРасходовЛогистики");
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры

&НаКлиенте
Процедура ПротоколРасчетаКомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов(Команда)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//СтруктураПоиск = Новый Структура;
	//СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	//СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов"));
	//СтруктураПоиск.Вставить("Организация", Объект.Организация);
	//СтруктураПоиск.Вставить("Период", Объект.Период);
	//
	//ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	//
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ДокументСсылка);
	//
	//бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	//										,"рс_РаспределениеДоходовИРасходовЛогистики"
	//										,"ПротоколРасчета"
	//										,"Протокол расчета"
	//										,МассивСсылок
	//										,ЭтаФорма);
	
	РаспределениеРасходовОфисовПечать("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов",
		"рс_РаспределениеДоходовИРасходовЛогистики");
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеРасходовОфисов");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаМагазины"));
	ЭтаФорма.Элементы.ПротоколРасчетаРаспределениеРасходовОфисовНаМагазины.Доступность = (НайтиДокумент(СтруктураПоиск) <> Неопределено);
	
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеРасходовОфисов.НаТЦ"));
	ЭтаФорма.Элементы.ПротоколРасчетаРаспределениеРасходовОфисовНаТЦ.Доступность = (НайтиДокумент(СтруктураПоиск) <> Неопределено);
	
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.КомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов"));
	ЭтаФорма.Элементы.ПротоколРасчетаКомпенсацияЛогистическихЗатратЗаСчетВнутреннихДоходов.Доступность = (НайтиДокумент(СтруктураПоиск) <> Неопределено);
	
	// BIT AMerkulov 03-08-2015 ++	
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ДоставкаТоваровВнутренняя"));
	ЭтаФорма.Элементы.ПротоколРасчетаРаспределениеЗатратНаДоставкуТоваров.Доступность = (НайтиДокумент(СтруктураПоиск) <> Неопределено);	
	// BIT AMerkulov 03-08-2015 --	
	
	
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ОбработкаТоваровВнутренняя"));
	ЭтаФорма.Элементы.ПротоколРасчетаРаспределениеЗатратНаОбработкуТоваров.Доступность = (НайтиДокумент(СтруктураПоиск) <> Неопределено);
	
КонецПроцедуры

&НаСервере
Функция НайтиДокумент(СтруктураПоиск)
	
	Если НЕ ЗначениеЗаполнено(СтруктураПоиск.ВидОперации) ИЛИ НЕ ЗначениеЗаполнено(СтруктураПоиск.Организация) ИЛИ НЕ ЗначениеЗаполнено(СтруктураПоиск.Период) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.Ссылка
	|ИЗ
	|	Документ.%ВидДокумента% КАК Документы
	|ГДЕ
	|	Документы.ПометкаУдаления = ЛОЖЬ
	|	И Документы.ВидОперации = &ВидОперации
	|	И Документы.Организация = &Организация
	|	И Документы.Период = &Период";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "%ВидДокумента%", СтруктураПоиск.ВидДокумента);
	
	Запрос.УстановитьПараметр("ВидОперации", СтруктураПоиск.ВидОперации);
	Запрос.УстановитьПараметр("Организация", СтруктураПоиск.Организация);
	Запрос.УстановитьПараметр("Период", СтруктураПоиск.Период);
	
	
	ТаблицаЗапрос = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗапрос.Количество() > 0 Тогда
		Возврат(ТаблицаЗапрос[0].Ссылка);
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Организация = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("ОсновнаяОрганизация");

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	рс_МесяцыНачисления.Ссылка
	|ИЗ
	|	Справочник.рс_МесяцыНачисления КАК рс_МесяцыНачисления
	|ГДЕ
	|	рс_МесяцыНачисления.Дата = &Дата";
	Запрос.УстановитьПараметр("Дата", НачалоМесяца(ТекущаяДата()));
	ТаблицаЗапрос = Запрос.Выполнить().Выгрузить();
	Если ТаблицаЗапрос.Количество() > 0 Тогда
		Объект.Период = ТаблицаЗапрос[0].Ссылка;
	КонецЕсли;
	
КонецПроцедуры

//1С-ИжТиСи Фонарев 14.04.2020(
&НаКлиенте
Процедура РаспределениеРасходовОфисовПечать(ВидОперации, ИмяРегистра)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", ИмяРегистра);
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение(ВидОперации));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);

	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ДокументСсылка);

	ТабДок = Новый ТабличныйДокумент;

	ИдентификаторПечатнойФормы = "ПротоколРасчета";
	НазваниеПечатнойФормы = НСтр("ru='Протокол расчета'");
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторПечатнойФормы);
	ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы);
	ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы;
	ПечатнаяФорма.ТабличныйДокумент     = ТабДок;
	ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы;
	
	РаспределениеРасходовОфисовПечатьНаСервере(МассивСсылок, КоллекцияПечатныхФорм, ПечатнаяФорма, ИмяРегистра);
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

&НаСервере
Процедура РаспределениеРасходовОфисовПечатьНаСервере(МассивСсылок, КоллекцияПечатныхФорм, ПечатнаяФорма, ИмяРегистра)
	
	ЗаполнитьЗначенияСвойств(КоллекцияПечатныхФорм, ПечатнаяФорма);
	ТЗКоллекцияПечатныхФорм = ПрограммныйИнтерфейсСервиса.МассивСтруктурВТаблицуЗначений(КоллекцияПечатныхФорм);
	Если ИмяРегистра = "рс_РаспределениеРасходовОфисов" Тогда
		Документы.рс_РаспределениеРасходовОфисов.Печать(МассивСсылок, Неопределено, ТЗКоллекцияПечатныхФорм, Неопределено, Неопределено);
	Иначе
		Документы.рс_РаспределениеДоходовИРасходовЛогистики.Печать(МассивСсылок, Неопределено, ТЗКоллекцияПечатныхФорм, Неопределено, Неопределено);
	КонецЕсли;
	КоллекцияПечатныхФорм = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗКоллекцияПечатныхФорм);
	
КонецПроцедуры
//1С-ИжТиСи Фонарев 14.04.2020)

// BIT AMerkulov 03-08-2015 ++	
&НаКлиенте
Процедура РаспределениеЗатратНаДоставкуТоваров(Команда)
	
	СтруктураПоиск = Новый Структура;
	СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ДоставкаТоваровВнутренняя"));
	СтруктураПоиск.Вставить("Организация", Объект.Организация);
	СтруктураПоиск.Вставить("Период", Объект.Период);
	
	ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	
	Если ДокументСсылка = Неопределено Тогда
		
		Форма = ПолучитьФорму("Документ.рс_РаспределениеДоходовИРасходовЛогистики.ФормаОбъекта", , ЭтаФорма); 
		Форма.Объект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		ЗаполнитьЗначенияСвойств(Форма.Объект, СтруктураПоиск);
		Форма.Открыть();

	Иначе
		
		ОбновитьДокументНаСервере(ДокументСсылка);	
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбновитьДокументНаСервере(ДокументСсылка)
	
	Попытка
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
		ДокументОбъект.Дата = КонецМесяца(ПолучитьДатуПериода(Объект.Период));			
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Сообщить("Документ " + ДокументОбъект + " перепроведен.");	
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;	
	
КонецПроцедуры


&НаКлиенте
Процедура ПротоколРасчетаРаспределениеЗатратНаДоставкуТоваров(Команда)
	
	//1С-ИжТиСи Фонарев 14.04.2020(
	//СтруктураПоиск = Новый Структура;
	//СтруктураПоиск.Вставить("ВидДокумента", "рс_РаспределениеДоходовИРасходовЛогистики");
	//СтруктураПоиск.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ДоставкаТоваровВнутренняя"));
	//СтруктураПоиск.Вставить("Организация", Объект.Организация);
	//СтруктураПоиск.Вставить("Период", Объект.Период);
	//
	//ДокументСсылка = НайтиДокумент(СтруктураПоиск);
	//
	//МассивСсылок = Новый Массив;
	//МассивСсылок.Добавить(ДокументСсылка);
	//
	//бит_ПечатьКлиент.ОбработатьКомандуПечати("Документы"
	//										,"рс_РаспределениеДоходовИРасходовЛогистики"
	//										,"ПротоколРасчета"
	//										,"Протокол расчета"
	//										,МассивСсылок
	//										,ЭтаФорма);
	
	РаспределениеРасходовОфисовПечать("Перечисление.рс_ВидыОперацийРаспределениеДоходовИРасходовЛогистики.ДоставкаТоваровВнутренняя",
		"рс_РаспределениеДоходовИРасходовЛогистики");
	//1С-ИжТиСи Фонарев 14.04.2020)
	
КонецПроцедуры
// BIT AMerkulov 03-08-2015 --	



