
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Свойство("ОтображениеСписка") Тогда 
		Элементы.Список.Отображение = Параметры.ОтображениеСписка;
	ИначеЕсли Параметры.Свойство("ОтображениеСпискаСтрокой") Тогда 
		Если Параметры.ОтображениеСпискаСтрокой = "Список" Тогда
			Элементы.Список.Отображение = ОтображениеТаблицы.Список;
		ИначеЕсли Параметры.ОтображениеСпискаСтрокой = "ИерархическийСписок" Тогда
			Элементы.Список.Отображение = ОтображениеТаблицы.ИерархическийСписок;
		ИначеЕсли Параметры.ОтображениеСпискаСтрокой = "Дерево" Тогда
			Элементы.Список.Отображение = ОтображениеТаблицы.Дерево;
		КонецЕсли; 
	КонецЕсли;
	
	// ОКЕЙ Сафронов А.А. (СофтЛаб) Начало 2021-10-19 (#4390)
	Если Параметры.Свойство("ДатаПроекта") Тогда 
		ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(Список.Отбор, "Отбор проект по умолчанию", ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
				"ок_ПроектПоУмолчанию", ВидСравненияКомпоновкиДанных.Равно, Ложь);
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ГруппаОтбора,
				"ок_Период", ВидСравненияКомпоновкиДанных.Равно, НачалоГода(Параметры.ДатаПроекта));
	КонецЕсли;	
	// ОКЕЙ Сафронов А.А. (СофтЛаб) Конец 2021-10-19 (#4390)
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти
