#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_вго_СоответствиеОперацийВГО;
	
	// Вызов механизма защиты
    	
	
	бит_РаботаСДиалогамиСервер.ФормаЗаписиРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);

	Если Отказ Тогда
		Возврат;	
	КонецЕсли;
		
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОперацияПоставщикаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_вго_ВидыОперацийВГО.ОперацияПоставщика");
	
	Если ЗначениеЗаполнено(Запись.ОперацияПокупателя) Тогда
		
		ДанныеПоОперации = ПолучитьДанныеПоОперацииВГО(Запись.ОперацияПокупателя);
		ЭтоГруппа 	= ДанныеПоОперации.ЭтоГруппа;
		ТипОперации = ДанныеПоОперации.ТипОперации;
		Элементы.ОперацияПоставщика.ВыборГруппИЭлементов = ?(ЭтоГруппа, ГруппыИЭлементы.Группы, ГруппыИЭлементы.Элементы);	
		         		
	Иначе
		
		Элементы.ОперацияПоставщика.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		ТипОперации = Неопределено;
		
	КонецЕсли;
	
	ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ВидОперации, ТипОперации);
		
КонецПроцедуры // ОперацияПоставщикаНачалоВыбора()

&НаКлиенте
Процедура ОперацияПокупателяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ВидОперации = ПредопределенноеЗначение("Перечисление.бит_вго_ВидыОперацийВГО.ОперацияПокупателя");
	
	Если ЗначениеЗаполнено(Запись.ОперацияПоставщика) Тогда
		
		ДанныеПоОперации = ПолучитьДанныеПоОперацииВГО(Запись.ОперацияПоставщика);
		ЭтоГруппа 	= ДанныеПоОперации.ЭтоГруппа;
		ТипОперации = ДанныеПоОперации.ТипОперации;
 	    Элементы.ОперацияПокупателя.ВыборГруппИЭлементов = ?(ЭтоГруппа, ГруппыИЭлементы.Группы, ГруппыИЭлементы.Элементы);	
				
	Иначе
		
		Элементы.ОперацияПокупателя.ВыборГруппИЭлементов = ГруппыИЭлементы.ГруппыИЭлементы;
		ТипОперации = Неопределено;
		
	КонецЕсли;
	
	ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ВидОперации, ТипОперации);
	
КонецПроцедуры // ОперацияПокупателяНачалоВыбора()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыбратьОперациюВГО(Элемент, СтандартнаяОбработка, ВидОперации, ТипОперации)
	
	МассивВыбора = Новый Массив;
	МассивВыбора.Добавить(Новый ПараметрВыбора("Отбор.ВидОперации", ВидОперации));
	Если ТипОперации <> Неопределено Тогда
		МассивВыбора.Добавить(Новый ПараметрВыбора("Отбор.ТипОперации", ТипОперации));
	КонецЕсли;

	Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивВыбора);
	
КонецПроцедуры // ВыбратьОперациюВГО()

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоОперацииВГО(ТекОперация)

	Результат = Новый Структура;
	Результат.Вставить("ЭтоГруппа"	, ТекОперация.ЭтоГруппа);
	Результат.Вставить("ТипОперации", ТекОперация.ТипОперации);

	Возврат Результат;
	
КонецФункции // ПолучитьДанныеПоОперацииВГО()

#КонецОбласти

