
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-07-27 (#4097)
	//СхемаКомпоновкиОбъектыСтроительства = ПолучитьМакет("КорневыеРодителиОбъектовСтроительства");
	//КомпоновщикНастроекОбъектыСтроительства = Новый КомпоновщикНастроекКомпоновкиДанных;
	//КомпоновщикНастроекОбъектыСтроительства.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиОбъектыСтроительства));
	//
	//КомпоновщикНастроекОбъектыСтроительства.ЗагрузитьНастройки(СхемаКомпоновкиОбъектыСтроительства.НастройкиПоУмолчанию);
	//
	//КомпоновщикМакетаОбъектыСтроительства = Новый КомпоновщикМакетаКомпоновкиДанных;
	//
	//МакетОбъектыСтроительства = КомпоновщикМакетаОбъектыСтроительства.Выполнить(СхемаКомпоновкиОбъектыСтроительства, КомпоновщикНастроекОбъектыСтроительства.ПолучитьНастройки(), , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	//
	//
	//ПроцессорКомпоновкиОбъектыСтроительства = Новый ПроцессорКомпоновкиДанных;
	//
	//ПроцессорКомпоновкиОбъектыСтроительства.Инициализировать(МакетОбъектыСтроительства);
	//
	//ТаблицаОбъектовСтроительства = Новый ТаблицаЗначений;
	//
	//ПроцессорВыводаОбъектыСтроительства = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	//
	//ПроцессорВыводаОбъектыСтроительства.УстановитьОбъект(ТаблицаОбъектовСтроительства);
	//
	//ПроцессорВыводаОбъектыСтроительства.Вывести(ПроцессорКомпоновкиОбъектыСтроительства, Истина);
	
	ТаблицаОбъектовСтроительства = ПолучитьТаблицуОбъектовСтроительства();
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-07-27 (#4097)	
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	Макет = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	ПроцессорКомпоновки.Инициализировать(Макет, Новый Структура("НаборДанныхОбъект", ТаблицаОбъектовСтроительства), ДанныеРасшифровки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки, Истина);
	
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-07-27 (#4097)
Функция ПолучитьТаблицуОбъектовСтроительства()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ОбъектыСтроительства.Ссылка КАК Объект,
		|//УровниИераррхии
		|ИЗ
		|	Справочник.ОбъектыСтроительства КАК ОбъектыСтроительства";
	
	ВсегоУровнейИерархии = Метаданные.Справочники.ОбъектыСтроительства.КоличествоУровней + 1;
	
	ДополнитьЗапросПоУровнямИерархии(Запрос, ВсегоУровнейИерархии);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
	ТипОбъектыСтроительстваСсылка = Новый ОписаниеТипов("СправочникСсылка.ОбъектыСтроительства");
	
	ТаблицаНоменклатурныхГрупп = Новый ТаблицаЗначений;
	ТаблицаНоменклатурныхГрупп.Колонки.Добавить("Объект", ТипОбъектыСтроительстваСсылка);
	ТаблицаНоменклатурныхГрупп.Колонки.Добавить("ВерхнеуровневыйОбъект", ТипОбъектыСтроительстваСсылка);
			
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		НоваяСтрока = ТаблицаНоменклатурныхГрупп.Добавить();
		НоваяСтрока.Объект = ВыборкаДетальныеЗаписи.Объект;
		
		МаксимальныйУровеньИерархии = ВсегоУровнейИерархии;
		
		Пока МаксимальныйУровеньИерархии > 0 Цикл
			
			ИмяПоля = "Родитель" + МаксимальныйУровеньИерархии; 
			
			Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи[ИмяПоля]) Тогда
				НоваяСтрока.ВерхнеуровневыйОбъект = ВыборкаДетальныеЗаписи[ИмяПоля];
				Прервать;
			КонецЕсли;
			
			МаксимальныйУровеньИерархии = МаксимальныйУровеньИерархии - 1;
			
		КонецЦикла;
				
	КонецЦикла;
	
	Возврат ТаблицаНоменклатурныхГрупп;
	
КонецФункции // ПолучитьТаблицуНоменклатурныхГрупп()

Функция ДополнитьЗапросПоУровнямИерархии(Запрос, УровнейИерархии)

	МассивПодстрокЗапроса = Новый Массив;
	МассивРодителей = Новый Массив;
	
	Для СчетчикУровней = 1 По УровнейИерархии Цикл
		
		МассивРодителей.Добавить("Родитель");
		
		СтрокаРодителей = СтрСоединить(МассивРодителей, ".");
		
		ОчереднойРодитель = СтрШаблон("ОбъектыСтроительства.%1%2", СтрокаРодителей, " КАК Родитель" + Формат(СчетчикУровней, "ЧГ=0"));
		
		Если СчетчикУровней <> УровнейИерархии  Тогда
			ОчереднойРодитель = ОчереднойРодитель  + ","
		КонецЕсли;
		
		МассивПодстрокЗапроса.Добавить(ОчереднойРодитель);
		
	КонецЦикла;
	
	УровниИераррхии = СтрСоединить(МассивПодстрокЗапроса, Символы.ПС); 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//УровниИераррхии", УровниИераррхии);

КонецФункции // ДополнитьЗапросПоУровнямИерархии()
//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-07-27 (#4097)

#КонецОбласти