#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс
	
// Функция определяет данный вид ИБ описывает внешнюю базу или нет.
//
// Параметры:
//  ВидИБ	 - ПеречислениеСсылка.бит_мпд_ВидыИнформационныхБаз - вид информационной базы.
// 
// Возвращаемое значение:
//  Внешняя -Булево - внешняя база.
//
Функция ЭтоВнешняяБаза(ВидИБ) Экспорт
    
    Внешняя = ВидИБ.РасположениеДанных = Перечисления.бит_мпд_ВидыРасположенияДанных.ВнешняяИнформационнаяБаза;
    
    Возврат Внешняя;
    
КонецФункции // ЭтоВнешняяБаза()
    
#КонецОбласти

#КонецЕсли	
