
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьСуммуКакВБухгалтерскомУчете	= Ложь;
	РаспределитьПоровну 					= Истина;
	РаспределитьПропорционально 			= Ложь;
	УстановитьОдноЗначение 					= Ложь;
	
	Параметры.Свойство("КоличествоСтрок", КоличествоСтрок);
	Параметры.Свойство("ОбщаяСуммаСтрок", ОбщаяСуммаСтрок);
	
	Сумма_РаспределитьПоровну 			= ОбщаяСуммаСтрок;
	Сумма_РаспределитьПропорционально	= ОбщаяСуммаСтрок;
	Сумма_УстановитьОдноЗначение		= ОбщаяСуммаСтрок;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПользовательскуюИнформацию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура УстановитьСуммуКакВБухгалтерскомУчетеПриИзменении(Элемент)
	
	УстановитьСуммуКакВБухгалтерскомУчете 	= Истина;
	РаспределитьПоровну 					= Ложь;
	РаспределитьПропорционально 			= Ложь;
	УстановитьОдноЗначение 					= Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПоровнуПриИзменении(Элемент)
	
	УстановитьСуммуКакВБухгалтерскомУчете 	= Ложь;
	РаспределитьПоровну 					= Истина;
	РаспределитьПропорционально 			= Ложь;
	УстановитьОдноЗначение 					= Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьПропорциональноПриИзменении(Элемент)
	
	УстановитьСуммуКакВБухгалтерскомУчете 	= Ложь;
	РаспределитьПоровну 					= Ложь;
	РаспределитьПропорционально 			= Истина;
	УстановитьОдноЗначение 					= Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОдноЗначениеПриИзменении(Элемент)
	
	УстановитьСуммуКакВБухгалтерскомУчете 	= Ложь;
	РаспределитьПоровну 					= Ложь;
	РаспределитьПропорционально 			= Ложь;
	УстановитьОдноЗначение 					= Истина;
	
	УправлениеФормой();
	
КонецПроцедуры


&НаКлиенте
Процедура Сумма_РаспределитьПоровнуПриИзменении(Элемент)
	
	ЗаполнитьПользовательскуюИнформацию();
	
КонецПроцедуры

&НаКлиенте
Процедура Сумма_УстановитьОдноЗначениеПриИзменении(Элемент)
	
	ЗаполнитьПользовательскуюИнформацию();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВнестиСумму(Команда)
	
	СтруктураВозврата = Новый Структура();
	СтруктураВозврата.Вставить("ЭтоКоэффициент", 						Ложь);
	СтруктураВозврата.Вставить("УстановитьСуммуКакВБухгалтерскомУчете", УстановитьСуммуКакВБухгалтерскомУчете);
	СтруктураВозврата.Вставить("ВозвращаемоеЗначение", 					0);
	
	Если РаспределитьПоровну Тогда
		
		СтруктураВозврата.ВозвращаемоеЗначение = Сумма_РаспределитьПоровну / КоличествоСтрок;
	
	ИначеЕсли РаспределитьПропорционально Тогда
		
		СтруктураВозврата.ЭтоКоэффициент = Истина;
		СтруктураВозврата.ВозвращаемоеЗначение = ?(ОбщаяСуммаСтрок = 0, 0, Сумма_РаспределитьПропорционально / ОбщаяСуммаСтрок);
		
	Иначе
		
		СтруктураВозврата.ВозвращаемоеЗначение = Сумма_УстановитьОдноЗначение;
		
	КонецЕсли; 
	
	Закрыть(СтруктураВозврата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура УправлениеФормой()
	
	Элементы.Сумма_РаспределитьПоровну.Доступность 			= РаспределитьПоровну;
	Элементы.Сумма_РаспределитьПропорционально.Доступность 	= РаспределитьПропорционально;
	Элементы.Сумма_УстановитьОдноЗначение.Доступность 		= УстановитьОдноЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПользовательскуюИнформацию()
	
	Элементы.ДекорацияРаспределитьПоровнуФормула.Заголовок			= " / " + Формат(КоличествоСтрок, "ЧЦ=15; ЧДЦ=0; ЧН=0; ЧГ=0") + " = " + Формат(Сумма_РаспределитьПоровну / КоличествоСтрок, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0");
	//Элементы.ДекорацияРаспределитьПропорциональноФормула.Заголовок 	= " / " + Формат(ОбщаяСуммаСтрок, "ЧЦ=15; ЧДЦ=2; ЧН=0; ЧГ=0") + " = " + Формат(?(ОбщаяСуммаСтрок = 0, 0, Сумма_РаспределитьПропорционально / ОбщаяСуммаСтрок), "ЧЦ=10; ЧДЦ=5; ЧН=0; ЧГ=0");
	
КонецПроцедуры

#КонецОбласти 
