
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы
	
&НаКлиенте
Процедура СоздатьДокументНазначениеСоответствияАналитик(Команда)
	
	МассивСтрок = Элементы.Список.ВыделенныеСтроки;
	
	Для каждого ТекСсылка Из МассивСтрок Цикл
	
		 Если ЗначениеЗаполнено(ТекСсылка) И НЕ ПроверитьЭтоГруппа(ТекСсылка) Тогда
		 
		 	// Создаем новую форму документа.
			бит_РаботаСДиалогамиКлиент.ОткрытьНовуюФормуДокументаНазначениеСоответствияАналитик(ТекСсылка);
			
			Прервать;
		 
		 КонецЕсли; 
	
	КонецЦикла; 
	
КонецПроцедуры // СоздатьДокументНазначениеСоответствияАналитик()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция проверяет является ли выбранный элемент группой.
//
// Параметры:
//  ТекСсылка - СправочникСсылка.бит_НастройкиПротоколовРасхожденийБюджета.
//
// Возвращаемое значение:
//  Булево.
//
&НаСервереБезКонтекста
Функция ПроверитьЭтоГруппа(ТекСсылка)

	флЭтоГруппа = ТекСсылка.ЭтоГруппа;

	Возврат флЭтоГруппа;
	
КонецФункции // ПроверитьЭтоГруппа()

#КонецОбласти
