
// Процедура - обработчик команды.
// 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение Тогда
		
		ОткрытьФорму("Обработка.бит_ПрикреплениеФайлов.Форма"
					,Новый Структура("Объект, ПоказыватьОбъект", ПараметрКоманды, Ложь)
					,ПараметрыВыполненияКоманды.Источник
					,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
					,ПараметрыВыполненияКоманды.Окно);
	Иначе
		
		Форма = ПолучитьФорму("Обработка.бит_ПрикреплениеФайлов.Форма",, Новый УникальныйИдентификатор);
		Форма.Объект = ПараметрКоманды;
		
		Форма.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
			
