
&НаКлиенте
Процедура СоздатьНедостающиеНастройки(Команда)
	
	Попытка
		
		СоздатьНедостающие();
		
	Исключение
		
		Сообщить("Не удалось создать настройки по причине внутренней ошибки:
		|" + ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		
	КонецПопытки;					
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНедостающие()
	
	МассивДоНастроек = Объект.ТЧНедостающиеНастройки;
	
	НаборНастроек = РегистрыСведений.бит_му_Настройки.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Группа.Установить("Обработка по сворачиванию задолженностей поставщиков товара");
	НаборНастроек.Прочитать();
	
	ТаблицаИмеющихсяНастроек = НаборНастроек.Выгрузить();
	
	Для Каждого ДобавляемаяНастройка Из МассивДоНастроек Цикл
		
		НайденнаяСтрока = ТаблицаИмеющихсяНастроек.Найти(ДобавляемаяНастройка.ИмяНастройки, "ИмяНастройки");
		
		Если НЕ НайденнаяСтрока = Неопределено Тогда
			НайденнаяСтрока.Значение = ДобавляемаяНастройка.Значение;
		Иначе
			НоваяСтрока = ТаблицаИмеющихсяНастроек.Добавить();
			НоваяСтрока.Группа = "Обработка по сворачиванию задолженностей поставщиков товара";
			НоваяСтрока.ИмяНастройки = ДобавляемаяНастройка.ИмяНастройки;
			НоваяСтрока.Значение = ДобавляемаяНастройка.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборНастроек.Загрузить(ТаблицаИмеющихсяНастроек);
	НаборНастроек.Записать();
	
КонецПроцедуры