
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Ссылка", ПараметрКоманды);
	ПараметрыФормы.Вставить("Отбор", Новый Структура("Объект", ПараметрКоманды));
	ПараметрыФормы.Вставить("ТолькоПросмотр", ПараметрыВыполненияКоманды.Источник.Модифицированность);

	ОткрытьФорму("ОбщаяФорма.бит_РедактированиеДополнительныхАналитик", ПараметрыФормы, 
		ПараметрыВыполненияКоманды.Источник, ПараметрКоманды, 
		ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
	
#КонецОбласти 
