
Перем ГруппаНастроек Экспорт;

Процедура РучнаяТрансляцияЗагруженныхДанныхИзАксапты() Экспорт
	
	Если не ПроверитьГраницыПериодов() Тогда Возврат; КонецЕсли;
	
	МассивОчередей	= СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Очередность, ";");
	
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-25 (#4205)
	ЗначениеНастройки_ВыполнятьПовторнуюТрансляцию = ТрансляцияТолькоНеоттранслированных И ОК_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("Трансляция", "ВыполнятьПовторнуюТрансляцию", Истина);
	ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Соединение = "		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДополнительныеАналитики КАК ДополнительныеАналитики
															|		ПО (ДополнительныеАналитики.Объект = бит_ок_ОперацияАксапты.Ссылка)
															|			И (ДополнительныеАналитики.Аналитика = &ВыполнитьПовторнуюТрансляцию)
															|		ЛЕВОЕ СОЕДИНЕНИЕ @Регистр@ КАК @РегистрСиноним@";
	ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Отбор = "И (@РегистрСиноним@.Регистратор ЕСТЬ NULL
													|		ИЛИ ДополнительныеАналитики.ЗначениеАналитики = Истина)";
	
	МассивОбработанныхДокументов = Новый Массив;
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-25 (#4205)
	
	Для Каждого ТекущаяОчередь из МассивОчередей Цикл 
		Если ОК_ОбщегоНазначения.ПроверитьСтрокаВЧисло(ТекущаяОчередь) Тогда 
			ИндОчередность	= Число(ТекущаяОчередь);
		Иначе 
			Сообщение	= "Очередь " + ТекущаяОчередь + " не удается привести к числу, она исключается из трансляции";
			ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);
			СделатьЗаписьЖР(Сообщение);
			Продолжить;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Если ИндОчередность = 5 Тогда //ДДС
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	бит_Дополнительный_2.Регистратор КАК Объект,
			|	ЛОЖЬ КАК Обработано,
			|	ВЫБОР
			|		КОГДА (бит_Дополнительный_2.СчетДт В ИЕРАРХИИ (&Группа9)
			|				ИЛИ бит_Дополнительный_2.СчетКт В ИЕРАРХИИ (&Группа9))
			|				И бит_Дополнительный_2.ВидПроводки = ЗНАЧЕНИЕ(Перечисление.бит_КонтрольПериодов_ВидыПроводок.ПустаяСсылка)
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексСчет9,
			|	ВЫБОР
			|		КОГДА (бит_Дополнительный_2.СчетДт В ИЕРАРХИИ (&СчетСортировки)
			|					ИЛИ бит_Дополнительный_2.СчетКт В ИЕРАРХИИ (&СчетСортировки))
			|			ТОГДА 1
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК ИндексСчет
			|ПОМЕСТИТЬ ВТОбщая
			|ИЗ
			|	РегистрБухгалтерии.бит_Дополнительный_2 КАК бит_Дополнительный_2
			|ГДЕ
			|	бит_Дополнительный_2.Период МЕЖДУ &ДатаНач И &ДатаКон
			|	И бит_Дополнительный_2.Организация = &Организация
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТОбщая.Объект,
			|	ВТОбщая.Обработано,
			|	МАКСИМУМ(ВТОбщая.ИндексСчет) КАК ИндексСчет,
			|	МАКСИМУМ(ВТОбщая.ИндексСчет9) КАК ИндексСчет9
			|ПОМЕСТИТЬ ВТГруппировка
			|ИЗ
			|	ВТОбщая КАК ВТОбщая
			|
			|СГРУППИРОВАТЬ ПО
			|	ВТОбщая.Объект,
			|	ВТОбщая.Обработано
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-06-03 (#4205)
			//|ВЫБРАТЬ
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-06-03 (#4205)
			|	ВТГруппировка.Объект,
			|	ВТГруппировка.Обработано
			|ИЗ
			|	ВТГруппировка КАК ВТГруппировка
			|ГДЕ
			|	ВТГруппировка.ИндексСчет = 1
			|	И ВТГруппировка.ИндексСчет9 <> 1";
			Запрос.УстановитьПараметр("Организация", Организация);	
			Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодС));
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодПо));
			Запрос.УстановитьПараметр("Группа9", ПланыСчетов.бит_Дополнительный_2.СчетаУчетаДДС);
			Запрос.УстановитьПараметр("СчетСортировки", ПланыСчетов.бит_Дополнительный_2.ДенежныеСредстваИэквиваленты);
					
			ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
					
		ИначеЕсли НЕ ТрансляцияТолькоНеоттранслированных Тогда
		
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-06-03 (#4205)
			//Запрос.Текст = "ВЫБРАТЬ
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-06-03 (#4205)
               |	бит_ок_ОперацияАксапты.Ссылка КАК Объект,
               |	ЛОЖЬ КАК Обработано
               |ИЗ
               |	Документ.бит_ок_ОперацияАксапты12 КАК бит_ок_ОперацияАксапты
               |ГДЕ
               |	бит_ок_ОперацияАксапты.Дата МЕЖДУ &ДатаНач И &ДатаКон
               |	И бит_ок_ОперацияАксапты.ПометкаУдаления = ЛОЖЬ
               |	И бит_ок_ОперацияАксапты.Организация = &Организация";
			
			Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодС));
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодПо));
			Запрос.УстановитьПараметр("Организация", Организация);
			ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
			
		//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-04-12 (#4129)
		ИначеЕсли ИндОчередность = 10
			ИЛИ ИндОчередность = 11 Тогда
			
			ЗапросПриемника = Новый Запрос;
			ЗапросПриемника.Текст = "ВЫБРАТЬ
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник  КАК Приемник
			|ИЗ
			|	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних КАК бит_НазначениеПравилТрансляцииСрезПоследних
			|ГДЕ
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Очередность = &Очередность
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник";
			
			ЗапросПриемника.УстановитьПараметр("Очередность", ИндОчередность);
			ВыборкаПриемника = ЗапросПриемника.Выполнить().Выбрать();
			Если ВыборкаПриемника.Следующий() Тогда
				Приемник = ВыборкаПриемника.Приемник.ИмяОбъектаПолное;
				ПриемникСиноним = ВыборкаПриемника.Приемник.ИмяОбъекта;
			КонецЕсли;
			
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-06-03 (#4205)
			//Запрос.Текст = "ВЫБРАТЬ
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-06-03 (#4205)
			|	бит_ок_ОперацияАксапты.Ссылка КАК Объект,
			|	ЛОЖЬ КАК Обработано
			|ИЗ
			|	Документ.бит_ок_ОперацияАксапты12 КАК бит_ок_ОперацияАксапты
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДополнительныеДанныеПоОперациямАксапты КАК бит_ДополнительныеДанныеПоОперациямАксапты
			|		ПО бит_ДополнительныеДанныеПоОперациямАксапты.Документ = бит_ок_ОперацияАксапты.Ссылка
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-10-11 (#4193)
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ДополнительныеДанныеПоОперациямАксапты КАК бит_ДополнительныеДанныеПоОперациямАксаптыДокументаЗакупки
			|		ПО (бит_ДополнительныеДанныеПоОперациямАксаптыДокументаЗакупки.Документ = бит_ок_ОперацияАксапты.ВаучерДокументаЗакупкиСсылка)
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-10-11 (#4193)
			|		ЛЕВОЕ СОЕДИНЕНИЕ @Регистр@ КАК @РегистрСиноним@
			|		ПО (@РегистрСиноним@.Регистратор = бит_ок_ОперацияАксапты.Ссылка)
			|ГДЕ
			|	бит_ок_ОперацияАксапты.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И бит_ок_ОперацияАксапты.ПометкаУдаления = ЛОЖЬ
			|	И бит_ок_ОперацияАксапты.Организация = &Организация
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-10-11 (#4193)
			|	И НЕ (бит_ок_ОперацияАксапты.DocType = ""250""
			|		И НЕ бит_ДополнительныеДанныеПоОперациямАксаптыДокументаЗакупки.Документ ЕСТЬ NULL)
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-10-11 (#4193)
			|   И @РегистрСиноним@.Регистратор ЕСТЬ NULL
			|
			|УПОРЯДОЧИТЬ ПО
			|	Объект";
			
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-25 (#4205)
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛЕВОЕ СОЕДИНЕНИЕ @Регистр@ КАК @РегистрСиноним@", ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Соединение);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И @РегистрСиноним@.Регистратор ЕСТЬ NULL", ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Отбор);
			Запрос.УстановитьПараметр("ВыполнитьПовторнуюТрансляцию", ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.ок_ВыполнитьПовторнуюТрансляцию"));
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-25 (#4205)
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "@Регистр@", Приемник); 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "@РегистрСиноним@", ПриемникСиноним); 
			Запрос.УстановитьПараметр("ДатаНач", 			НачалоДня(ПериодС));
			Запрос.УстановитьПараметр("ДатаКон", 			КонецДня(ПериодПо));
			Запрос.УстановитьПараметр("Организация", 		Организация);
			
			ТаблицаДокументов = Запрос.Выполнить().Выгрузить();
			
		//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-04-12 (#4129)
			
		Иначе
			
			ЗапросПриемника = Новый Запрос;
			ЗапросПриемника.Текст = "ВЫБРАТЬ
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник  КАК Приемник
			|ИЗ
			|	РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних КАК бит_НазначениеПравилТрансляцииСрезПоследних
			|ГДЕ
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Очередность = &Очередность
			|
			|СГРУППИРОВАТЬ ПО
			|	бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции.Приемник";
			
			ЗапросПриемника.УстановитьПараметр("Очередность", ИндОчередность);
			ВыборкаПриемника = ЗапросПриемника.Выполнить().Выбрать();
			Если ВыборкаПриемника.Следующий() Тогда
				Приемник = ВыборкаПриемника.Приемник.ИмяОбъектаПолное;
				ПриемникСиноним = ВыборкаПриемника.Приемник.ИмяОбъекта;
			КонецЕсли;
			
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-06-03 (#4205)
			//Запрос.Текст = "ВЫБРАТЬ
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-06-03 (#4205)
			|	бит_ок_ОперацияАксапты.Ссылка КАК Объект,
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-04-12 (#4129)
			//|	@РегистрСиноним@.Регистратор
			|	ЛОЖЬ КАК Обработано
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-04-12 (#4129)
			|ИЗ
			|	Документ.бит_ок_ОперацияАксапты12 КАК бит_ок_ОперацияАксапты
			|		ЛЕВОЕ СОЕДИНЕНИЕ @Регистр@ КАК @РегистрСиноним@
			|		ПО (@РегистрСиноним@.Регистратор = бит_ок_ОперацияАксапты.Ссылка)
			|ГДЕ
			|	бит_ок_ОперацияАксапты.Дата МЕЖДУ &ДатаНач И &ДатаКон
			|	И бит_ок_ОперацияАксапты.ПометкаУдаления = ЛОЖЬ
			|	И бит_ок_ОперацияАксапты.Организация = &Организация
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-04-12 (#4129)
			|   И @РегистрСиноним@.Регистратор ЕСТЬ NULL
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-04-12 (#4129)
			|
			|УПОРЯДОЧИТЬ ПО
			|	Объект";
			
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-25 (#4205)
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЛЕВОЕ СОЕДИНЕНИЕ @Регистр@ КАК @РегистрСиноним@", ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Соединение);
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И @РегистрСиноним@.Регистратор ЕСТЬ NULL", ТекстЗапроса_ВыполнятьПовторнуюТрансляцию_Отбор);
			Запрос.УстановитьПараметр("ВыполнитьПовторнуюТрансляцию", ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.ок_ВыполнитьПовторнуюТрансляцию"));
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-25 (#4205)
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "@Регистр@", Приемник); 
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "@РегистрСиноним@", ПриемникСиноним); 
			Запрос.УстановитьПараметр("ДатаНач", НачалоДня(ПериодС));
			Запрос.УстановитьПараметр("ДатаКон", КонецДня(ПериодПо));
			Запрос.УстановитьПараметр("Организация", Организация);
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-04-12 (#4129)
			//Запрос.УстановитьПараметр("парамРегистратор", Документы.бит_ок_ОперацияАксапты12.ПустаяСсылка());					   
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-04-12 (#4129)
			
			ТаблицаДокументов = Запрос.Выполнить().Выгрузить();  
			
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-04-12 (#4129)
			//НайденныеСтроки = ТаблицаДокументов.НайтиСтроки(Новый Структура("Регистратор", Null));
			//
			//ТаблицаДокументов = Новый ТаблицаЗначений;
			//ТаблицаДокументов.Колонки.Добавить("Объект");
			//ТаблицаДокументов.Колонки.Добавить("Обработано");
			//Для Каждого Строка Из НайденныеСтроки Цикл
			//	НоваяСтрока = ТаблицаДокументов.Добавить();
			//	НоваяСтрока.Объект 		= Строка.Объект;
			//	НоваяСтрока.Обработано 	= ЛОЖЬ;
			//КонецЦикла;
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-04-12 (#4129)
			
		КонецЕсли;
		
		// сформировать общую таблицу документов для трансляции
		Сообщение	= "Документов для обработки  " + ТаблицаДокументов.Количество();
		ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);
		СделатьЗаписьЖР(Сообщение);
		
		Сообщение	= "Начало трансляций с очередностью: " + ИндОчередность;
		ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);	
		СделатьЗаписьЖР(Сообщение);
		
		//Разбиваем таблицу документов на массив таблиц	с количеством элементов равным количеству потоков 
		МассивПартий = Новый Массив;
		Для Итер = 1 по КоличествоПотоков Цикл
			МассивПартий.Добавить(ТаблицаДокументов.СкопироватьКолонки());
		КонецЦикла;
		
		КолВоВПартии = Окр(ТаблицаДокументов.Количество() / КоличествоПотоков);
		
		КолВоВТекущейПартии = КолВоВПартии;
		Итер = 0;
		Для каждого Стр из ТаблицаДокументов Цикл
			НовСтр = МассивПартий[Итер].Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр, Стр);
			
			КолВоВТекущейПартии = КолВоВТекущейПартии - 1;
			Если КолВоВТекущейПартии <= 0 И (Итер+1)<КоличествоПотоков Тогда
				Итер = Итер + 1;
				КолВоВТекущейПартии = КолВоВПартии;
			КонецЕсли;
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-06-03 (#4205)
			Если МассивОбработанныхДокументов.Найти(Стр.Объект) = Неопределено Тогда
				МассивОбработанныхДокументов.Добавить(Стр.Объект);
			КонецЕсли; 
			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-06-03 (#4205)
		КонецЦикла;
		
		МассивФЗ		= Новый Массив;
		НомерПотока 	= 1;
		Для Каждого Таб из МассивПартий Цикл
			
			МассивПараметров = Новый Массив(4);
			МассивПараметров[0] = Таб;
			МассивПараметров[1] = НомерПотока;
			МассивПараметров[2] = ИндОчередность;
			МассивПараметров[3] = Ложь;
			
			Ключ = Новый УникальныйИдентификатор;
			
			МассивФЗ.Добавить(ФоновыеЗадания.Выполнить("бит_МодульРегламентныхЗаданий.ФоноваяТрансляция", МассивПараметров, Ключ, "Фоновая трансляция. Поток №" + НомерПотока));
			
			НомерПотока = НомерПотока + 1;
			
		КонецЦикла;
		
		Сообщение = "Стартовало " + КоличествоПотоков + " потоков.";
		ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);
		СделатьЗаписьЖР(Сообщение);
		
		//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-25 (#4205)
		//Если НЕ ТрансляцияТолькоНеоттранслированных Тогда
		//	Прервать;
		//КонецЕсли;
		//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-25 (#4205)
		
		ФоновыеЗадания.ОжидатьЗавершения(МассивФЗ);
		
	КонецЦикла;	

	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-05-26 (#4205)
	Для каждого ТекущийДокумент Из МассивОбработанныхДокументов Цикл
		бит_ОбщегоНазначения.ДобавитьЗначениеАналитики(ТекущийДокумент, ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.ок_ВыполнитьПовторнуюТрансляцию"), Ложь, Ложь);
	КонецЦикла; 
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-05-26 (#4205)
	
	Если ТрансляцияТолькоНеоттранслированных Тогда
		
		Сообщение = НСтр("ru = 'Завершена автоматическая трансляция загруженных данных из Аксапты 12.'"); 
		ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);
		СделатьЗаписьЖР(Сообщение);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РучнаяРасТрансляцияЗагруженныхДанныхИзАксапты(УникальныйИдентификатор, АдресФормы, КолВоДокументов) Экспорт
	
	Если Не ПроверитьГраницыПериодов() Тогда Возврат; КонецЕсли;
	
	// Получим массив документов для выполнения отмены трансляции.
	ЗапросРастранслируемыхДокументов = Новый Запрос;
	ЗапросРастранслируемыхДокументов.Текст = "ВЫБРАТЬ
		|	бит_ок_ОперацияАксапты.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.бит_ок_ОперацияАксапты12 КАК бит_ок_ОперацияАксапты
		|ГДЕ
		|	бит_ок_ОперацияАксапты.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|	И бит_ок_ОперацияАксапты.ПометкаУдаления <> ИСТИНА
		|{ГДЕ
		|	(бит_ок_ОперацияАксапты.Организация = &Организация) КАК Поле2}";
	
	ЗапросРастранслируемыхДокументов.УстановитьПараметр("ДатаНач", 		НачалоДня(ПериодС));										 										 
	ЗапросРастранслируемыхДокументов.УстановитьПараметр("ДатаКон", 		НачалоДня(ПериодПо));
	ЗапросРастранслируемыхДокументов.УстановитьПараметр("Организация", 	Организация);
	
	ТаблицаДокументов 	= ЗапросРастранслируемыхДокументов.Выполнить().Выгрузить();
	МассивДокументов 	= ТаблицаДокументов.ВыгрузитьКолонку("Ссылка");
	
	КолВоДокументов  	= МассивДокументов.Количество();
	
	Если КолВоДокументов = 0 Тогда
		Сообщение = "Не указаны документы для отмены трансляции движений!";
		бит_ОбщегоНазначения.бит_Сообщить(Сообщение, СтатусСообщения.Внимание);
		СделатьЗаписьЖР(Сообщение);
		Возврат;
	КонецЕсли;
	
	АдресФормы = ПоместитьВоВременноеХранилище(МассивДокументов,УникальныйИдентификатор);
	
КонецПроцедуры	

Функция ОтменитьТрансляцию(ДокументСсылка, РегистрыПриемники, Позиция)
	
	ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Строка(Позиция) + ") По документу: " + Строка(ДокументСсылка));
	
	МетаданныеДокумента = ДокументСсылка.Метаданные();
	
	ДействиеВыполнено = Истина;
	
	Для Каждого ТекРегистр Из РегистрыПриемники Цикл
		
		Если ТекРегистр.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии Тогда
			МенеджерРегистра = бит_ОбщегоНазначения.ПолучитьМенеджер("РегистрыБухгалтерии");
			ПредставлеРегистра = "движения регистра бухгалтерии";
			
		ИначеЕсли ТекРегистр.ВидОбъекта = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления Тогда
			МенеджерРегистра = бит_ОбщегоНазначения.ПолучитьМенеджер("РегистрыНакопления");
			ПредставлеРегистра = "движения регистра накопления";
			
		Иначе
			МенеджерРегистра = Неопределено;
		КонецЕсли;
		
		Если МенеджерРегистра = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДляОчистки = МенеджерРегистра[ТекРегистр.ИмяОбъекта].СоздатьНаборЗаписей();
		НаборДляОчистки.Отбор.Регистратор.Установить(ДокументСсылка);
		НаборДляОчистки.Прочитать();
		
		Если НаборДляОчистки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		НаборДляОчистки.Очистить();
		
		// Запишем очищенный набор записей.
		флВыполненаЗапись = бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборДляОчистки);
		Если Не флВыполненаЗапись Тогда
			
			Если ДействиеВыполнено Тогда
				ДействиеВыполнено = Ложь;
			КонецЕсли;
			
			// Не успешная запись.
			Сообщить("	- не отменены " + ПредставлеРегистра + ": """ + ТекРегистр.Наименование + """.");
			
		Иначе
			// Успешная запись.
			Сообщить("	- отменены " + ПредставлеРегистра + ": """ + ТекРегистр.Наименование + """.");
			
			Если МетаданныеДокумента.Движения.Содержит(Метаданные.РегистрыСведений.бит_СоответствиеЗаписейТрансляции) Тогда
				
				// очистим соответствие номеров движений
				НаборСоответствие = РегистрыСведений.бит_СоответствиеЗаписейТрансляции.СоздатьНаборЗаписей();
				НаборСоответствие.Отбор.Регистратор.Установить(ДокументСсылка);
				НаборСоответствие.Прочитать();
				
				бит_МеханизмТрансляции.ОчиститьСоответствиеДвижений(НаборСоответствие,,ТекРегистр);
				
				бит_ОбщегоНазначения.ЗаписатьНаборЗаписейРегистра(НаборСоответствие);			
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ДействиеВыполнено;
	
КонецФункции // ОтменитьТрансляцию()

Процедура ЗаполнитьНастройки() Экспорт 
	
	Запрос = Новый Запрос;
	
	//Проверка наличия групп в регистре, если их нет, то добавляются
	
	Запрос.Текст = "ВЫБРАТЬ
	|	""ГруппаНастроек"" КАК Группа,
	|	""ОчередностьПравил"" КАК ИмяНастройки,
	|	""1"" КАК Значение
	|ПОМЕСТИТЬ ВТ_ПроверяемыеНастройки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ГруппаНастроек"",
	|	""КоличествоПотоков"",
	|	10
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	""ГруппаНастроек"",
	|	""ТолькоНеОттранслированные"",
	|	Истина
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Группа,
	|	ИмяНастройки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПроверяемыеНастройки.Группа,
	|	ВТ_ПроверяемыеНастройки.ИмяНастройки,
	|	ВТ_ПроверяемыеНастройки.Значение
	|ИЗ
	|	ВТ_ПроверяемыеНастройки КАК ВТ_ПроверяемыеНастройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК бит_ок_НастройкиМеханизмаИмпортаДанных
	|		ПО ВТ_ПроверяемыеНастройки.Группа = бит_ок_НастройкиМеханизмаИмпортаДанных.Группа
	|			И ВТ_ПроверяемыеНастройки.ИмяНастройки = бит_ок_НастройкиМеханизмаИмпортаДанных.ИмяНастройки
	|ГДЕ
	|	бит_ок_НастройкиМеханизмаИмпортаДанных.ИмяНастройки ЕСТЬ NULL ";
	
	Запрос.Текст	= СтрЗаменить(Запрос.Текст, "ГруппаНастроек", ГруппаНастроек);
	ТЗНастройки 	= Запрос.Выполнить().Выгрузить();
	
	НачатьТранзакцию();
	Для Каждого СтрокаНастроек из ТЗНастройки Цикл 
		ДобавляемаяНастройка				= РегистрыСведений.бит_ок_НастройкиМеханизмаИмпортаДанных.СоздатьМенеджерЗаписи();
		ДобавляемаяНастройка.Группа			= СтрокаНастроек.Группа;
		ДобавляемаяНастройка.ИмяНастройки	= СтрокаНастроек.ИмяНастройки;
		ДобавляемаяНастройка.Значение		= СтрокаНастроек.Значение;
		ДобавляемаяНастройка.Записать(Истина);
	КонецЦикла;
	ЗафиксироватьТранзакцию();
	
	
	Запрос.Текст = "ВЫБРАТЬ
	|	бит_ок_НастройкиМеханизмаИмпортаДанных.Группа,
	|	бит_ок_НастройкиМеханизмаИмпортаДанных.ИмяНастройки,
	|	бит_ок_НастройкиМеханизмаИмпортаДанных.Значение
	|ИЗ
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК бит_ок_НастройкиМеханизмаИмпортаДанных
	|ГДЕ
	|	бит_ок_НастройкиМеханизмаИмпортаДанных.Группа В(&СписокНастроек)";
	
	СписокНастроек = Новый Массив;
	СписокНастроек.Добавить(ГруппаНастроек);
	СписокНастроек.Добавить("ПараметрыЗагрузкиАксапты12");
	СписокНастроек.Добавить("Организации");
	Запрос.УстановитьПараметр("СписокНастроек", СписокНастроек);
	
	ТЗНастройки = Запрос.Выполнить().Выгрузить();
	
	Очередность			= ТЗНастройки.Найти("ОчередностьПравил").Значение;
	КоличествоПотоков	= ТЗНастройки.Найти("КоличествоПотоков").Значение;
	ТрансляцияТолькоНеоттранслированных = ТЗНастройки.Найти("ТолькоНеОттранслированные").Значение;
	
	Отказ = Ложь;
	
	ОпределитьНастройку(ТЗНастройки, "Организация ОКЕЙ", Организация);
	ОпределитьНастройку(ТЗНастройки, "Начало Периода", ПериодС);
	ОпределитьНастройку(ТЗНастройки, "Конец Периода", ПериодПо);
	
КонецПроцедуры

Процедура ОпределитьНастройку(ТЗНастройки, ИмяНастройки, Параметр)
	
	НайденнаяСтрока	= ТЗНастройки.Найти(ИмяНастройки);
	Если НайденнаяСтрока = Неопределено Тогда 
		
		Сообщение = "В Настройках механизма импорта данных не найдена настройка " + ИмяНастройки;
		ОК_ОбщегоНазначения.ВыводСтатусаСообщения(, Сообщение);		
		СделатьЗаписьЖР(Сообщение);
		Отказ = Истина;
		
	Иначе
		Параметр = НайденнаяСтрока.Значение;
	КонецЕсли;
	
КонецПроцедуры

Процедура СделатьЗаписьЖР(Сообщение)

	#Если Сервер Тогда
		ЗаписьЖурналаРегистрации("Трансляция загруженных данных из Аксапты 12. Обработка" 
		,УровеньЖурналаРегистрации.Информация 
		,
		,
		,Сообщение);
	#КонецЕсли 

КонецПроцедуры

Функция ПроверитьГраницыПериодов()

	// Получить Границу запрета изменения данных
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	ГраницыЗапретаИзмененияДанных.ДатаЗапрета КАК ГраницаЗапретаИзменений
		|ИЗ
		|	РегистрСведений.ДатыЗапретаИзменения КАК ГраницыЗапретаИзмененияДанных
		|ГДЕ
		|	ГраницыЗапретаИзмененияДанных.Объект = &Организация
		|	И ГраницыЗапретаИзмененияДанных.Раздел = &Раздел";
	
	Запрос.УстановитьПараметр("Раздел", ДатыЗапретаИзмененияБП.РазделБухгалтерскийУчет().Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	ЗапросВыполнить = Запрос.Выполнить();
	Если ЗапросВыполнить.Пустой() Тогда
		Граница = Неопределено;
	Иначе
		Граница = Запрос.Выполнить().Выгрузить()[0].ГраницаЗапретаИзменений;
	КонецЕсли;
	
 	Если ПериодС <> Неопределено И Граница <> Неопределено Тогда
		Если ПериодС < Граница Тогда
			Сообщение = "Дата запрета редактирования " + Граница + ", позже периода загрузки, начинающегося с " + ПериодС; 
			ОК_ОбщегоНазначения.ВыводСтатусаСообщения(,Сообщение);
			СделатьЗаписьЖР(Сообщение);
			Возврат Ложь;
		КонецЕсли;	
	КонецЕсли;

	Возврат Истина;
	
КонецФункции // ПроверитьГраницыПериодов()


ГруппаНастроек	= "РегламентнаяТрансляцияОперацийАксапты12";
ЗаполнитьНастройки();