
	
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьКоманд(Отказ);
	
	МетаРегистрБюдж       = Метаданные.РегистрыБухгалтерии.бит_Бюджетирование;
	ПараметрыФормыОтчетов = Новый Структура("РФ_РегистрБухгалтерии", бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(МетаРегистрБюдж));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОткрытьОтчетАнализСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_АнализСубконто_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетАнализСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_АнализСчета_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетКарточкаСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_КарточкаСубконто_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетКарточкаСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_КарточкаСчета_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотноСальдоваяВедомость_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотноСальдоваяВедомость_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотноСальдоваяВедомостьПоСчету_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотноСальдоваяВедомостьПоСчету_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура бит_ОборотыМеждуСубконто_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотыМеждуСубконто_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
				 
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОборотыСчета_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОборотыСчета_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
				 
КонецПроцедуры

&НаКлиенте
Процедура бит_ОткрытьОтчетОтчетПоПроводкам_Бюджетирование(Команда)
	
	ОткрытьФорму("Отчет.бит_ОтчетПоПроводкам_Бюджетирование.Форма", ПараметрыФормыОтчетов, ЭтотОбъект, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьКоманд(Отказ)
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.РегистрыБухгалтерии.бит_Бюджетирование) Тогда
		ВызватьИсключение НСтр("ru = 'Недостаточно прав доступа.'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
