
&НаКлиенте
Процедура Выбрать(Команда)
	
	//ВладелецФормыОбъект = ДанныеФормыВЗначение(Этаформа.ВладелецФормы.Объект, Тип("ДокументОбъект.бит_му_ПоступлениеТоваровУслугПоКЗ"));
	ВладелецФормыОбъект = Этаформа.ВладелецФормы.Объект;
	
	Если НЕ (ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_ПринятиеКУчетуОС") ИЛИ ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_МодернизацияОС"))  Тогда
		ТЧСвязанныхДокументов = ВладелецФормыОбъект.бит_ДокументыСобственныхКонтрагентов;
	Иначе
		ТЧСвязанныхДокументов = ВладелецФормыОбъект.бит_ДокументыПоступления;
	КонецЕсли;
	
	Если ТЧСвязанныхДокументов.Количество() > 0 Тогда
		Ответ = Вопрос("В табличной части уже имеются связанные документы. Очистить?", РежимДиалогаВопрос.ДаНет);
		Если Ответ = КодВозвратаДиалога.Да Тогда
			ТЧСвязанныхДокументов.Очистить();
		КонецЕсли;
	КонецЕсли;
	
	Для Каждого ДокументСтрока ИЗ ТаблицаДокументов Цикл
		Если ДокументСтрока.Выбрать Тогда
			
			Ключ = ?(НЕ (ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_ПринятиеКУчетуОС") или ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_МодернизацияОС")), "ДокументРеализацииПередачи", "ДокументПоступления");
			ПараметрыОтбора = Новый Структура(Ключ, ДокументСтрока.Документ);
			ИмеющаясяСтрока = ТЧСвязанныхДокументов.НайтиСтроки(ПараметрыОтбора);
			
			Если НЕ ИмеющаясяСтрока.Количество() = 0 Тогда
				Для Каждого СтрокаДляУдаления ИЗ ИмеющаясяСтрока Цикл
					ТЧСвязанныхДокументов.Удалить(СтрокаДляУдаления);
				КонецЦикла;
			КонецЕсли;
			
			НоваяСтрокаТЧ = ТЧСвязанныхДокументов.Добавить();
			Если НЕ (ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_ПринятиеКУчетуОС") или ТипЗнч(Этаформа.ВладелецФормы.Объект.Ссылка) = Тип("ДокументСсылка.бит_му_МодернизацияОС")) Тогда
				НоваяСтрокаТЧ.ДокументРеализацииПередачи      = ДокументСтрока.Документ;
				НоваяСтрокаТЧ.ДатаДокументаРеализацииПередачи = ИнтеграцияС1СДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ДокументСтрока.Документ, "Дата");
				НоваяСтрокаТЧ.бит_Сумма= ДокументСтрока.СуммаДокумента; 			
				НоваяСтрокаТЧ.бит_СуммаБезНДС= ДокументСтрока.СуммаБезНДС; 
			Иначе
				НоваяСтрокаТЧ.ДокументПоступления      = ДокументСтрока.Документ;
				НоваяСтрокаТЧ.ДатаДокументаПоступления = ИнтеграцияС1СДокументооборотВызовСервера.ЗначениеРеквизитаОбъекта(ДокументСтрока.Документ, "Дата");
				НоваяСтрокаТЧ.бит_Сумма                = ДокументСтрока.СуммаДокумента; 			 
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла; 
		
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//УстановитьЗначениеТаблицыНаСервере(Этаформа.ВладелецФормы.ТЗТаблицаДокументов); // 1c-izhtc spawn 12.08.15
	
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначениеТаблицыНаСервере(Табличка)
	
	ЗначениеВДанныеФормы(Табличка, ТаблицаДокументов);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АдресТЗТаблицаДокументов") Тогда 
		УстановитьЗначениеТаблицыНаСервере(ПолучитьИзВременногоХранилища(Параметры.АдресТЗТаблицаДокументов));	
	КонецЕсли;
КонецПроцедуры

 