
//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-11-05 (#ПроектИнтеграцияАксапта12)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()

	//Количество субконто
	КоличествоСубконтоАксапта = ОК_ОбщегоНазначения.ПолучитьЗначениеУниверсальнойНастройки("Аксапта 12", "Количество субконто Аксапта", 6);
	
	Элементы.ТипСубконто7.ТолькоПросмотр = КоличествоСубконтоАксапта <= 6;
	Элементы.ТипСубконто8.ТолькоПросмотр = КоличествоСубконтоАксапта <= 7;
	Элементы.ТипСубконто9.ТолькоПросмотр = КоличествоСубконтоАксапта <= 8;
	Элементы.ТипСубконто10.ТолькоПросмотр = КоличествоСубконтоАксапта <= 9;
	Элементы.ТипСубконто11.ТолькоПросмотр = КоличествоСубконтоАксапта <= 10;
	Элементы.ТипСубконто12.ТолькоПросмотр = КоличествоСубконтоАксапта <= 11;
	
КонецПроцедуры
//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-11-05 (#ПроектИнтеграцияАксапта12)	

