
#Область ОбработчикиКомандФормы

// Процедура - действие команды "КомандаОткрытьИсториюИзменения".
// 
&НаКлиенте
Процедура КомандаОткрытьИсториюИзменения(Команда)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если НЕ ТекущаяСтрока = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Задача", ТекущаяСтрока.Ссылка);
		ОткрытьФорму("РегистрСведений.бит_ИсторияИзмененияСтатусовОбъектов.Форма.ФормаИсторияСостоянийЗадач",ПараметрыФормы, ЭтаФорма);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
