#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем ТаблицаДвиженийМСФО;

#КонецОбласти

#Область СлужебныйПрограммныйИнтефейс

#КонецОбласти

#Область ПроцедурыИФункцииОбщегоНазначения

// Процедура заполняет шапку документа.
// 
Процедура ЗаполнитьШапкуДокумента()
	
	ТекущийПользователь = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
	
	// Заполнить реквизиты значениями по умолчанию.
	бит_ОбщегоНазначения.ЗаполнитьШапкуДокумента(ЭтотОбъект,ТекущийПользователь);
												
КонецПроцедуры // ЗаполнитьШапкуДокумента()

Функция ПолучитьТекстЗапросаПоНачислениямИУдержаниям_НеМСФО()
	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ок_ОперацияБОСС.Ссылка.Дата КАК Период,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация КАК Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации КАК ВидОперации,
		|	ок_ОперацияБОСС.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт КАК СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт КАК СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	0 КАК Сумма,
		|	ок_ОперацияБОСС.Сумма КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|	И НЕ &СторнируемыеДокументыОтсутствуют
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ок_ОперацияБОСССторнируемыеДокументы.Ссылка.Дата,
		|	ок_ОборотыБОСС.ПериодНачисления,
		|	ок_ОборотыБОСС.Организация,
		|	ок_ОборотыБОСС.ВидОперации,
		|	ок_ОборотыБОСС.ВидДвиженияМСФО,
		|	ок_ОборотыБОСС.ДатаСторноМСФО,
		|	ок_ОборотыБОСС.СчетДт,
		|	ок_ОборотыБОСС.СубконтоБОССДт1,
		|	ок_ОборотыБОСС.СубконтоБОССДт2,
		|	ок_ОборотыБОСС.СубконтоБОССДт3,
		|	ок_ОборотыБОСС.СубконтоБОССДт4,
		|	ок_ОборотыБОСС.СубконтоБОССДт5,
		|	ок_ОборотыБОСС.Субконто1СДт1,
		|	ок_ОборотыБОСС.Субконто1СДт2,
		|	ок_ОборотыБОСС.Субконто1СДт3,
		|	ок_ОборотыБОСС.Субконто1СДт4,
		|	ок_ОборотыБОСС.Субконто1СДт5,
		|	ок_ОборотыБОСС.СчетКт,
		|	ок_ОборотыБОСС.СубконтоБОССКт1,
		|	ок_ОборотыБОСС.СубконтоБОССКт2,
		|	ок_ОборотыБОСС.СубконтоБОССКт3,
		|	ок_ОборотыБОСС.СубконтоБОССКт4,
		|	ок_ОборотыБОСС.СубконтоБОССКт5,
		|	ок_ОборотыБОСС.Субконто1СКт1,
		|	ок_ОборотыБОСС.Субконто1СКт2,
		|	ок_ОборотыБОСС.Субконто1СКт3,
		|	ок_ОборотыБОСС.Субконто1СКт4,
		|	ок_ОборотыБОСС.Субконто1СКт5,
		|	0,
		|	СУММА(-1 * ок_ОборотыБОСС.Сумма),
		|	ВЫРАЗИТЬ(ок_ОборотыБОСС.Содержание КАК СТРОКА(200))
		|ИЗ
		|	Документ.ок_ОперацияБОСС.СторнируемыеДокументы КАК ок_ОперацияБОСССторнируемыеДокументы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ок_ОборотыБОСС КАК ок_ОборотыБОСС
		|		ПО ок_ОперацияБОСССторнируемыеДокументы.ДокументОснование = ок_ОборотыБОСС.Регистратор
		|ГДЕ
		|	ок_ОперацияБОСССторнируемыеДокументы.Ссылка = &ОперацияБОСС
		|	И ок_ОборотыБОСС.Сумма <> 0
		|	И НЕ &СторнируемыеДокументыОтсутствуют
		|
		|СГРУППИРОВАТЬ ПО
		|	ок_ОборотыБОСС.Субконто1СКт2,
		|	ок_ОборотыБОСС.СубконтоБОССДт5,
		|	ок_ОборотыБОСС.СубконтоБОССДт1,
		|	ок_ОборотыБОСС.Субконто1СДт1,
		|	ок_ОборотыБОСС.Субконто1СДт5,
		|	ок_ОборотыБОСС.СубконтоБОССДт4,
		|	ок_ОборотыБОСС.СубконтоБОССКт1,
		|	ок_ОборотыБОСС.СчетКт,
		|	ок_ОборотыБОСС.Субконто1СДт4,
		|	ок_ОборотыБОСС.Организация,
		|	ок_ОборотыБОСС.СубконтоБОССКт2,
		|	ок_ОборотыБОСС.СубконтоБОССКт5,
		|	ок_ОборотыБОСС.СчетДт,
		|	ок_ОборотыБОСС.ВидОперации,
		|	ок_ОборотыБОСС.Субконто1СДт3,
		|	ок_ОборотыБОСС.ДатаСторноМСФО,
		|	ок_ОборотыБОСС.СубконтоБОССДт2,
		|	ок_ОборотыБОСС.Субконто1СДт2,
		|	ок_ОборотыБОСС.ПериодНачисления,
		|	ок_ОборотыБОСС.СубконтоБОССДт3,
		|	ок_ОборотыБОСС.СубконтоБОССКт3,
		|	ок_ОборотыБОСС.СубконтоБОССКт4,
		|	ок_ОборотыБОСС.Субконто1СКт1,
		|	ок_ОборотыБОСС.Субконто1СКт4,
		|	ок_ОперацияБОСССторнируемыеДокументы.Ссылка.Дата,
		|	ок_ОборотыБОСС.ВидДвиженияМСФО,
		|	ок_ОборотыБОСС.Субконто1СКт5,
		|	ок_ОборотыБОСС.Субконто1СКт3,
		|	ВЫРАЗИТЬ(ок_ОборотыБОСС.Содержание КАК СТРОКА(200))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	&ДатаДокумента КАК Период,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.РСБУ) КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ КАК Субконто1СКт5,
		|	СУММА(ОсновныеДанные.Сумма) КАК Сумма,
		|	СУММА(ОсновныеДанные.СуммаРазвернутая) КАК СуммаРазвернутая,
		|	"""" КАК Содержание
		|ПОМЕСТИТЬ ВТ_ТаблицаДельт
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеДанные.ВидОперации,
		|	ОсновныеДанные.ДатаСторноМСФО,
		|	ОсновныеДанные.СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт3,
		|	ОсновныеДанные.Организация,
		|	ОсновныеДанные.СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2,
		|	ОсновныеДанные.СубконтоБОССКт3,
		|	ОсновныеДанные.Субконто1СКт3,
		|	ОсновныеДанные.СубконтоБОССКт4,
		|	ОсновныеДанные.Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт2,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт3,
		|	ОсновныеДанные.СчетКт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт1,
		|	ОсновныеДанные.Субконто1СКт1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеДанные.Период КАК Период,
		|	ОсновныеДанные.ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ОсновныеДанные.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ОсновныеДанные.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт5 КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ОсновныеДанные.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт5 КАК Субконто1СКт5,
		|	ОсновныеДанные.Сумма КАК Сумма,
		|	ОсновныеДанные.СуммаРазвернутая КАК СуммаРазвернутая,
		|	ОсновныеДанные.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДельт.Период,
		|	ВТ_ТаблицаДельт.ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация,
		|	ВТ_ТаблицаДельт.ВидОперации,
		|	ВТ_ТаблицаДельт.ВидДвиженияМСФО,
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5,
		|	ВТ_ТаблицаДельт.СуммаРазвернутая,
		|	0,
		|	ВТ_ТаблицаДельт.Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт
		|ГДЕ
		|	ВТ_ТаблицаДельт.СуммаРазвернутая <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ок_ОперацияБОСС.Ссылка.Дата,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.РСБУ),
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5,
		|	ок_ОперацияБОСС.Сумма,
		|	0,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200))
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|	И &СторнируемыеДокументыОтсутствуют";
	
	 	
КонецФункции

Функция ПолучитьТекстЗапросаПоНачислениямИУдержаниям_МСФО()
	
//МСФО = Истина, виды операций = «Начисления и удержания ЗП», «Удержание по исполнительному листу»
//1.	По всем строкам ТЧ «Обороты БОСС” необходимо создать записи в РН “Обороты БОСС” с 
//	*заполнением ресурса «Сумма», 
//	*период = конец месяца из периода начисления, 
//	*ресурс «Сумма развернутая» = 0, 
//	*вид движения МСФО = «Аккруал».
//2.	По всем строкам ТЧ «Обороты БОСС” необходимо создать записи в РН “Обороты БОСС” с 
//	*заполнением ресурса «Сумма» и инвертированием знака, 
//	*период = конец месяца из периода начисления плюс один день (начало следующего месяца за периодом начисления), 
//	*ресурс «Сумма развернутая» = 0,  
//	*вид движения МСФО = «Сторно аккруала».

	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация КАК Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.Аккруал) КАК ВидДвиженияМСФО,
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт КАК СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт КАК СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	ок_ОперацияБОСС.Сумма КАК Сумма,
		|	0 КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		//|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ, 1), МЕСЯЦ),
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.СторноАккруала),
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5,
		|	-1 * ок_ОперацияБОСС.Сумма,
		|	0,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200))
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС";
	
КонецФункции

Функция ПолучитьТекстЗапросаПоРезервамОтпусков_МСФО()
	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ок_ОборотыБОСС.ПериодНачисления, МЕСЯЦ, 1), МЕСЯЦ) КАК Период,
		|	ок_ОборотыБОСС.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОборотыБОСС.Организация КАК Организация,
		|	ок_ОборотыБОСС.ВидОперации КАК ВидОперации,
		|	ок_ОборотыБОСС.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ок_ОборотыБОСС.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОборотыБОСС.СчетДт КАК СчетДт,
		|	ок_ОборотыБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОборотыБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОборотыБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОборотыБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОборотыБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОборотыБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОборотыБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОборотыБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОборотыБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОборотыБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОборотыБОСС.СчетКт КАК СчетКт,
		|	ок_ОборотыБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОборотыБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОборотыБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОборотыБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОборотыБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОборотыБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОборотыБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОборотыБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОборотыБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОборотыБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	0 КАК Сумма,
		|	-1 * ок_ОборотыБОСС.Сумма КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОборотыБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	РегистрНакопления.ок_ОборотыБОСС КАК ок_ОборотыБОСС
		|ГДЕ
		|	ок_ОборотыБОСС.Регистратор = &ОперацияБОСС_ПредыдущийМесяц
		|	И ок_ОборотыБОСС.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ),
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.Аккруал),
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5,
		|	0,
		|	ок_ОперацияБОСС.Сумма,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200))
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ) КАК Период,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.Аккруал) КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ КАК Субконто1СКт5,
		|	СУММА(ОсновныеДанные.Сумма) КАК Сумма,
		|	СУММА(ОсновныеДанные.СуммаРазвернутая) КАК СуммаРазвернутая,
		|	"""" КАК Содержание
		|ПОМЕСТИТЬ ВТ_ТаблицаДельт
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеДанные.ВидОперации,
		|	ОсновныеДанные.ДатаСторноМСФО,
		|	ОсновныеДанные.СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт3,
		|	ОсновныеДанные.Организация,
		|	ОсновныеДанные.СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2,
		|	ОсновныеДанные.СубконтоБОССКт3,
		|	ОсновныеДанные.Субконто1СКт3,
		|	ОсновныеДанные.СубконтоБОССКт4,
		|	ОсновныеДанные.Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт2,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт3,
		|	ОсновныеДанные.СчетКт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт1,
		|	ОсновныеДанные.Субконто1СКт1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеДанные.Период КАК Период,
		|	ОсновныеДанные.ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ОсновныеДанные.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ОсновныеДанные.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт5 КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ОсновныеДанные.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт5 КАК Субконто1СКт5,
		|	ОсновныеДанные.Сумма КАК Сумма,
		|	ОсновныеДанные.СуммаРазвернутая КАК СуммаРазвернутая,
		|	ОсновныеДанные.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДельт.Период,
		|	ВТ_ТаблицаДельт.ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация,
		|	ВТ_ТаблицаДельт.ВидОперации,
		|	ВТ_ТаблицаДельт.ВидДвиженияМСФО,
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5,
		|	ВТ_ТаблицаДельт.СуммаРазвернутая,
		|	0,
		|	ВТ_ТаблицаДельт.Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт
		|ГДЕ
		|	ВТ_ТаблицаДельт.СуммаРазвернутая <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		//|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ТаблицаДельт.ПериодНачисления, МЕСЯЦ, 1), МЕСЯЦ),
		|	&ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация,
		|	ВТ_ТаблицаДельт.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.СторноАккруала),
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5,
		|	-1 * ВТ_ТаблицаДельт.СуммаРазвернутая,
		|	0,
		|	ВТ_ТаблицаДельт.Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт
		|ГДЕ
		|	ВТ_ТаблицаДельт.СуммаРазвернутая <> 0";
	
КонецФункции

Функция ПолучитьТекстЗапросаПоРезервамОтпусков_МСФО_УжеРассчитанаДельта()
	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация КАК Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.Аккруал) КАК ВидДвиженияМСФО,
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт КАК СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт КАК СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	0 КАК Сумма,
		|	ок_ОперацияБОСС.Сумма КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ПОМЕСТИТЬ ВТ_ТаблицаДельт
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДельт.Период КАК Период,
		|	ВТ_ТаблицаДельт.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация КАК Организация,
		|	ВТ_ТаблицаДельт.ВидОперации КАК ВидОперации,
		|	ВТ_ТаблицаДельт.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт КАК СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1 КАК Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2 КАК Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3 КАК Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4 КАК Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5 КАК Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт КАК СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1 КАК Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2 КАК Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3 КАК Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4 КАК Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5 КАК Субконто1СКт5,
		|	ВТ_ТаблицаДельт.СуммаРазвернутая КАК Сумма,
		|	0 КАК СуммаРазвернутая,
		|	ВТ_ТаблицаДельт.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		//|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(ВТ_ТаблицаДельт.ПериодНачисления, МЕСЯЦ, 1), МЕСЯЦ),
		|	&ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация,
		|	ВТ_ТаблицаДельт.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.СторноАккруала),
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5,
		|	-1 * ВТ_ТаблицаДельт.СуммаРазвернутая,
		|	0,
		|	ВТ_ТаблицаДельт.Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт";
	
КонецФункции

Функция ПолучитьТекстЗапросаПоРезервамОтпусков_НеМСФО()
	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(ок_ОборотыБОСС.ПериодНачисления, МЕСЯЦ, 1), МЕСЯЦ) КАК Период,
		|	ок_ОборотыБОСС.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОборотыБОСС.Организация КАК Организация,
		|	ок_ОборотыБОСС.ВидОперации КАК ВидОперации,
		|	ок_ОборотыБОСС.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ок_ОборотыБОСС.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОборотыБОСС.СчетДт КАК СчетДт,
		|	ок_ОборотыБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОборотыБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОборотыБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОборотыБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОборотыБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОборотыБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОборотыБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОборотыБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОборотыБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОборотыБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОборотыБОСС.СчетКт КАК СчетКт,
		|	ок_ОборотыБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОборотыБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОборотыБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОборотыБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОборотыБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОборотыБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОборотыБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОборотыБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОборотыБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОборотыБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	0 КАК Сумма,
		|	-1 * ок_ОборотыБОСС.Сумма КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОборотыБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ПОМЕСТИТЬ ВТ_ОсновныеДанные
		|ИЗ
		|	РегистрНакопления.ок_ОборотыБОСС КАК ок_ОборотыБОСС
		|ГДЕ
		|	ок_ОборотыБОСС.Регистратор = &ОперацияБОСС_ПредыдущийМесяц
		|	И ок_ОборотыБОСС.Сумма <> 0
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ),
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.РСБУ),
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5,
		|	0,
		|	ок_ОперацияБОСС.Сумма,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200))
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОНЕЦПЕРИОДА(&ПериодНачисления, МЕСЯЦ) КАК Период,
		|	&ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.РСБУ) КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ КАК Субконто1СКт5,
		|	СУММА(ОсновныеДанные.Сумма) КАК Сумма,
		|	СУММА(ОсновныеДанные.СуммаРазвернутая) КАК СуммаРазвернутая,
		|	"""" КАК Содержание
		|ПОМЕСТИТЬ ВТ_ТаблицаДельт
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|СГРУППИРОВАТЬ ПО
		|	ОсновныеДанные.ВидОперации,
		|	ОсновныеДанные.ДатаСторноМСФО,
		|	ОсновныеДанные.СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт3,
		|	ОсновныеДанные.Организация,
		|	ОсновныеДанные.СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт4,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2,
		|	ОсновныеДанные.СубконтоБОССКт3,
		|	ОсновныеДанные.Субконто1СКт3,
		|	ОсновныеДанные.СубконтоБОССКт4,
		|	ОсновныеДанные.Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт2,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА """"
		|		ИНАЧЕ ОсновныеДанные.СубконтоБОССКт5
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СКт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СКт5
		|	КОНЕЦ,
		|	ОсновныеДанные.Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт3,
		|	ОсновныеДанные.СчетКт,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОсновныеДанные.Субконто1СДт5) = ТИП(Справочник.рс_МесяцыНачисления)
		|			ТОГДА &МесяцНачисления
		|		ИНАЧЕ ОсновныеДанные.Субконто1СДт5
		|	КОНЕЦ,
		|	ОсновныеДанные.СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт1,
		|	ОсновныеДанные.Субконто1СКт1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОсновныеДанные.Период КАК Период,
		|	ОсновныеДанные.ПериодНачисления КАК ПериодНачисления,
		|	ОсновныеДанные.Организация КАК Организация,
		|	ОсновныеДанные.ВидОперации КАК ВидОперации,
		|	ОсновныеДанные.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ОсновныеДанные.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ОсновныеДанные.СчетДт КАК СчетДт,
		|	ОсновныеДанные.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ОсновныеДанные.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ОсновныеДанные.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ОсновныеДанные.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ОсновныеДанные.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ОсновныеДанные.Субконто1СДт1 КАК Субконто1СДт1,
		|	ОсновныеДанные.Субконто1СДт2 КАК Субконто1СДт2,
		|	ОсновныеДанные.Субконто1СДт3 КАК Субконто1СДт3,
		|	ОсновныеДанные.Субконто1СДт4 КАК Субконто1СДт4,
		|	ОсновныеДанные.Субконто1СДт5 КАК Субконто1СДт5,
		|	ОсновныеДанные.СчетКт КАК СчетКт,
		|	ОсновныеДанные.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ОсновныеДанные.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ОсновныеДанные.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ОсновныеДанные.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ОсновныеДанные.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ОсновныеДанные.Субконто1СКт1 КАК Субконто1СКт1,
		|	ОсновныеДанные.Субконто1СКт2 КАК Субконто1СКт2,
		|	ОсновныеДанные.Субконто1СКт3 КАК Субконто1СКт3,
		|	ОсновныеДанные.Субконто1СКт4 КАК Субконто1СКт4,
		|	ОсновныеДанные.Субконто1СКт5 КАК Субконто1СКт5,
		|	ОсновныеДанные.Сумма КАК Сумма,
		|	ОсновныеДанные.СуммаРазвернутая КАК СуммаРазвернутая,
		|	ОсновныеДанные.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ОсновныеДанные КАК ОсновныеДанные
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДельт.Период,
		|	ВТ_ТаблицаДельт.ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация,
		|	ВТ_ТаблицаДельт.ВидОперации,
		|	ВТ_ТаблицаДельт.ВидДвиженияМСФО,
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5,
		|	ВТ_ТаблицаДельт.СуммаРазвернутая,
		|	0,
		|	ВТ_ТаблицаДельт.Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт
		|ГДЕ
		|	ВТ_ТаблицаДельт.СуммаРазвернутая <> 0";
	
КонецФункции

Функция ПолучитьТекстЗапросаПоРезервамОтпусков_НеМСФО_УжеРассчитанаДельта()
	
	Возврат 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КОНЕЦПЕРИОДА(ок_ОперацияБОСС.Ссылка.ПериодНачисления, МЕСЯЦ) КАК Период,
		|	ок_ОперацияБОСС.Ссылка.ПериодНачисления КАК ПериодНачисления,
		|	ок_ОперацияБОСС.Ссылка.Организация КАК Организация,
		|	ок_ОперацияБОСС.Ссылка.ВидОперации КАК ВидОперации,
		|	ЗНАЧЕНИЕ(ПЕРЕЧИСЛЕНИЕ.БИТ_ВидыДвиженияМСФО.РСБУ) КАК ВидДвиженияМСФО,
		|	ок_ОперацияБОСС.Ссылка.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ок_ОперацияБОСС.СчетДт КАК СчетДт,
		|	ок_ОперацияБОСС.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ок_ОперацияБОСС.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ок_ОперацияБОСС.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ок_ОперацияБОСС.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ок_ОперацияБОСС.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ок_ОперацияБОСС.Субконто1СДт1 КАК Субконто1СДт1,
		|	ок_ОперацияБОСС.Субконто1СДт2 КАК Субконто1СДт2,
		|	ок_ОперацияБОСС.Субконто1СДт3 КАК Субконто1СДт3,
		|	ок_ОперацияБОСС.Субконто1СДт4 КАК Субконто1СДт4,
		|	ок_ОперацияБОСС.Субконто1СДт5 КАК Субконто1СДт5,
		|	ок_ОперацияБОСС.СчетКт КАК СчетКт,
		|	ок_ОперацияБОСС.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ок_ОперацияБОСС.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ок_ОперацияБОСС.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ок_ОперацияБОСС.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ок_ОперацияБОСС.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ок_ОперацияБОСС.Субконто1СКт1 КАК Субконто1СКт1,
		|	ок_ОперацияБОСС.Субконто1СКт2 КАК Субконто1СКт2,
		|	ок_ОперацияБОСС.Субконто1СКт3 КАК Субконто1СКт3,
		|	ок_ОперацияБОСС.Субконто1СКт4 КАК Субконто1СКт4,
		|	ок_ОперацияБОСС.Субконто1СКт5 КАК Субконто1СКт5,
		|	0 КАК Сумма,
		|	ок_ОперацияБОСС.Сумма КАК СуммаРазвернутая,
		|	ВЫРАЗИТЬ(ок_ОперацияБОСС.Содержание КАК СТРОКА(200)) КАК Содержание
		|ПОМЕСТИТЬ ВТ_ТаблицаДельт
		|ИЗ
		|	Документ.ок_ОперацияБОСС.ОборотыБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ок_ОперацияБОСС.Ссылка = &ОперацияБОСС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаДельт.Период КАК Период,
		|	ВТ_ТаблицаДельт.ПериодНачисления КАК ПериодНачисления,
		|	ВТ_ТаблицаДельт.Организация КАК Организация,
		|	ВТ_ТаблицаДельт.ВидОперации КАК ВидОперации,
		|	ВТ_ТаблицаДельт.ВидДвиженияМСФО КАК ВидДвиженияМСФО,
		|	ВТ_ТаблицаДельт.ДатаСторноМСФО КАК ДатаСторноМСФО,
		|	ВТ_ТаблицаДельт.СчетДт КАК СчетДт,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт1 КАК СубконтоБОССДт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт2 КАК СубконтоБОССДт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт3 КАК СубконтоБОССДт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт4 КАК СубконтоБОССДт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССДт5 КАК СубконтоБОССДт5,
		|	ВТ_ТаблицаДельт.Субконто1СДт1 КАК Субконто1СДт1,
		|	ВТ_ТаблицаДельт.Субконто1СДт2 КАК Субконто1СДт2,
		|	ВТ_ТаблицаДельт.Субконто1СДт3 КАК Субконто1СДт3,
		|	ВТ_ТаблицаДельт.Субконто1СДт4 КАК Субконто1СДт4,
		|	ВТ_ТаблицаДельт.Субконто1СДт5 КАК Субконто1СДт5,
		|	ВТ_ТаблицаДельт.СчетКт КАК СчетКт,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт1 КАК СубконтоБОССКт1,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт2 КАК СубконтоБОССКт2,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт3 КАК СубконтоБОССКт3,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт4 КАК СубконтоБОССКт4,
		|	ВТ_ТаблицаДельт.СубконтоБОССКт5 КАК СубконтоБОССКт5,
		|	ВТ_ТаблицаДельт.Субконто1СКт1 КАК Субконто1СКт1,
		|	ВТ_ТаблицаДельт.Субконто1СКт2 КАК Субконто1СКт2,
		|	ВТ_ТаблицаДельт.Субконто1СКт3 КАК Субконто1СКт3,
		|	ВТ_ТаблицаДельт.Субконто1СКт4 КАК Субконто1СКт4,
		|	ВТ_ТаблицаДельт.Субконто1СКт5 КАК Субконто1СКт5,
		|	ВТ_ТаблицаДельт.СуммаРазвернутая КАК Сумма,
		|	0 КАК СуммаРазвернутая,
		|	ВТ_ТаблицаДельт.Содержание КАК Содержание
		|ИЗ
		|	ВТ_ТаблицаДельт КАК ВТ_ТаблицаДельт";
	
КонецФункции

Функция НайтиДокументОперацияБОССПоПараметрам_ПоРегистру(СтруктураПараметров)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ок_ОборотыБОСС.Регистратор КАК Регистратор
		|ИЗ
		|	РегистрНакопления.ок_ОборотыБОСС КАК ок_ОборотыБОСС
		|ГДЕ
		|	ИСТИНА
		|
		|СГРУППИРОВАТЬ ПО
		|	ок_ОборотыБОСС.Регистратор";
	
	Для Каждого ЭлементПараметра Из СтруктураПараметров Цикл 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ок_ОборотыБОСС." + ЭлементПараметра.Ключ + " = &" + ЭлементПараметра.Ключ + Символы.ПС + " И ИСТИНА");
		Запрос.УстановитьПараметр(ЭлементПараметра.Ключ, ЭлементПараметра.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Регистратор");
	
КонецФункции

Функция НайтиДокументОперацияБОССПоПараметрам_ПоДокументу(СтруткураПараметров)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ок_ОперацияБОСС.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ок_ОперацияБОСС КАК ок_ОперацияБОСС
		|ГДЕ
		|	ИСТИНА
		|	И НЕ ок_ОперацияБОСС.ПометкаУдаления
		|	И ок_ОперацияБОСС.Проведен";
	
	Для Каждого ЭлементПараметра Из СтруткураПараметров Цикл 
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИСТИНА", "ок_ОперацияБОСС." + ЭлементПараметра.Ключ + " = &" + ЭлементПараметра.Ключ + Символы.ПС + " И ИСТИНА");
		Запрос.УстановитьПараметр(ЭлементПараметра.Ключ, ЭлементПараметра.Значение);
	КонецЦикла;
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Возврат РезультатЗапроса.ВыгрузитьКолонку("Ссылка");
		
КонецФункции

Процедура УстановитьДополнительныеСвойства(РеквизитыДокумента) Экспорт
	
	//Если РеквизитыДокумента.ВидОперации = ПредопределенноеЗначение("Перечисление.ок_ВидыОперацийБОСС.РезервыОтпусков") Тогда
		
		//ИмяСвойства = "ОтразитьВЗакрытомПериоде";
		//ЗначениеСвойства = РеквизитыДокумента.ПериодЗакрыт_РСБУ;
		//					
		//Свойство_ОтразитьВЗакрытомПериоде = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", ИмяСвойства);
		//Если НЕ ЗначениеЗаполнено(Свойство_ОтразитьВЗакрытомПериоде) Тогда
		//	
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Заголовок 					= ИмяСвойства;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Имя 						= ИмяСвойства;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Наименование 				= ИмяСвойства;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Виден 						= Истина;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Доступен 					= Истина;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.ТипЗначения 				= Новый ОписаниеТипов("Булево");
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.ЭтоДополнительноеСведение 	= Истина;
		//	Свойство_ОтразитьВЗакрытомПериоде_Объект.Записать();
		//	
		//	Свойство_ОтразитьВЗакрытомПериоде = Свойство_ОтразитьВЗакрытомПериоде_Объект.Ссылка;
		//	
		//КонецЕсли;
		//
		//Если НЕ УправлениеСвойствами.ПроверитьСвойствоУОбъекта(Ссылка, Свойство_ОтразитьВЗакрытомПериоде)
		//	ИЛИ НЕ УправлениеСвойствами.ЗначениеСвойства(Ссылка, Свойство_ОтразитьВЗакрытомПериоде) = ЗначениеСвойства Тогда
		//
		//	МенеджерЗаписи = РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
		//				
		//	МенеджерЗаписи.Объект = Ссылка;
		//	МенеджерЗаписи.Свойство = Свойство_ОтразитьВЗакрытомПериоде;
		//	МенеджерЗаписи.Значение = ЗначениеСвойства;
		//	
		//	МенеджерЗаписи.Записать(Истина);
		//
		//КонецЕсли;
		
		Аналитика = ПредопределенноеЗначение("ПланВидовХарактеристик.бит_ВидыДополнительныхАналитик.ОтразитьВЗакрытомПериоде");
		//ЗначениеАналитики = РеквизитыДокумента.ПериодЗакрыт_РСБУ;
		ЗначениеАналитики = МСФО;
		
		Если бит_МеханизмДопИзмерений.ПолучитьЗначениеДопАналитики(Ссылка, Аналитика) <> ЗначениеАналитики Тогда
		
			МенеджерЗаписи = РегистрыСведений.бит_ДополнительныеАналитики.СоздатьМенеджерЗаписи();
							
			МенеджерЗаписи.Объект 			 = Ссылка;
			МенеджерЗаписи.Аналитика 		 = Аналитика;
			МенеджерЗаписи.ЗначениеАналитики = ЗначениеАналитики;
			
			МенеджерЗаписи.Записать(Истина);
		
		КонецЕсли;
		
		
		//ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2020-06-29 (#3794)
		// так как в одной транзакции происходит движения и установка аналитики, 
		// то необходимо зафиксировать в доп. св-вах
		Если МСФО Тогда
			Если ДополнительныеСвойства.Свойство("ДополнительныеАналитики") Тогда
				ДополнительныеАналитики = ДополнительныеСвойства.ДополнительныеАналитики;
			Иначе	
				ДополнительныеАналитики = бит_МеханизмТрансляции.ПолучитьАналитикиОбъекта(Ссылка);
				ДополнительныеСвойства.Вставить("ДополнительныеАналитики",	ДополнительныеАналитики);	
			КонецЕсли;
			
			ДополнительныеСвойства.Вставить("НеПроверятьНаЗакрытый", МСФО);
			ДополнительныеСвойства.ДополнительныеАналитики.Вставить("ОтразитьВЗакрытомПериоде",	МСФО);
			
		КонецЕсли;
		//ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2020-06-29 (#3794)
	
	//КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыИФункцииДляОбеспеченияПроведенияДокумента

// Процедура выполняет проверку заполнения шапки и таб. частей.
// 
// Параметры:
//  СтруктураШапкиДокумента 		 - Структура.
// 
//  Отказ 	  - Булево.
//  Заголовок – Строка.
// 
Процедура ПроверкаРеквизитов(СтруктураШапкиДокумента, Отказ, Заголовок)

	// Проверим заполнение шапки
	СтруктураОбязательныхПолей = Новый Структура;
	СтруктураОбязательныхПолей.Вставить("Организация");
	СтруктураОбязательныхПолей.Вставить("ВидОперации");
	СтруктураОбязательныхПолей.Вставить("ПериодНачисления");
	
	бит_РаботаСМетаданными.ПроверитьЗаполнениеШапки(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
	// Табличная часть Распределение
	СтруктураОбязательныхПолей = Новый Структура;
	
	Если ОборотыБОСС.Количество() > 1 Тогда
		//СтруктураОбязательныхПолей.Вставить("СчетДт");
		//СтруктураОбязательныхПолей.Вставить("СчетКт");
		СтруктураОбязательныхПолей.Вставить("Сумма");
	КонецЕсли;
	
	бит_РаботаСМетаданными.ПроверитьЗаполнениеТабличнойЧасти(ЭтотОбъект,"ОборотыБОСС",СтруктураОбязательныхПолей,Отказ,Заголовок);

КонецПроцедуры // ПроверкаРеквизитов()

// Процедура выполняет проверку проведения документа в закрытом периоде.
// 
// Параметры:
//  СтруктураШапкиДокумента 		 - Структура.
// 
//  Отказ 	  - Булево.
//  Заголовок – Строка.
// 
Процедура ПроверкаЗакрытогоПериода(СтруктураШапкиДокумента, Отказ, Заголовок)

	СтруктураШапкиДокумента.Вставить("ПериодЗакрыт_РСБУ", Ложь);
	СтруктураШапкиДокумента.Вставить("ПериодЗакрыт_МСФО", Ложь);
	
	//метДокумента = Метаданные.Документы.ок_ОперацияБОСС;
	//СтруктураПараметров = Новый Структура();
	//СтруктураПараметров.Вставить("Организация", СтруктураШапкиДокумента.Организация);
	//СтруктураПараметров.Вставить("Дата", 		КонецМесяца(СтруктураШапкиДокумента.ПериодНачисления));
	//
	//ДатаЗапрета = бит_ДатыЗапретаРедактирования.ПолучитьДатуЗапретаРедактирования(метДокумента, СтруктураПараметров);
	//СтруктураШапкиДокумента.ПериодЗакрыт_РСБУ = НЕ Документы.ок_ОперацияБОСС.ПроверитьГраницыПериодовРСБУ(КонецМесяца(СтруктураШапкиДокумента.ПериодНачисления), СтруктураШапкиДокумента.Организация);
	//
	//ОбъектСистемы_МСФО = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные.РегистрыБухгалтерии.бит_Дополнительный_2);
	//СоответствиеДат_МСФО = бит_КонтрольЗакрытогоПериода.ПолучитьДатыОткрытогоПериода(Организация, ОбъектСистемы_МСФО);
	//
	//СоответствиеДат_МСФО = Новый Соответствие;
	//Если СоответствиеДат_МСФО.Количество() > 0
	//	И СоответствиеДат_МСФО.Получить(ОбъектСистемы_МСФО) < СтруктураШапкиДокумента.ПериодНачисления Тогда
	//	СтруктураШапкиДокумента.ПериодЗакрыт_МСФО = Истина;
	//КонецЕсли;
	
	РазделРСБУ = ДатыЗапретаИзмененияБП.РазделБухгалтерскийУчет().Ссылка;
	
	СтруктураШапкиДокумента.ПериодЗакрыт_РСБУ = НЕ Документы.ок_ОперацияБОСС.ПроверитьГраницыПериодов(СтруктураШапкиДокумента.ПериодНачисления, СтруктураШапкиДокумента.Организация, РазделРСБУ);
	СтруктураШапкиДокумента.ПериодЗакрыт_МСФО = НЕ Документы.ок_ОперацияБОСС.ПроверитьГраницыПериодовМСФО(СтруктураШапкиДокумента.ПериодНачисления, СтруктураШапкиДокумента.Организация);
	
КонецПроцедуры // ПроверкаЗакрытогоПериода()

// Процедура выполняет движения по регистрам.
//                
Процедура ДвиженияПоРегистрам(РеквизитыДокумента, ТаблицаДляДвижений, Отказ, Заголовок)
	
	// Сформируем движения по РН "ок_ОборотыБОСС".
	Движения.ок_ОборотыБОСС.Записывать = Истина;
	Движения.ок_ОборотыБОСС.Очистить();
	
	Для каждого СтрокаТаблицы Из ТаблицаДляДвижений Цикл
		
		СтрокаДвижений = Движения.ок_ОборотыБОСС.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, РеквизитыДокумента);
		ЗаполнитьЗначенияСвойств(СтрокаДвижений, СтрокаТаблицы);
		
		//СтрокаДвижений.Период = РеквизитыДокумента.Дата;
		
	КонецЦикла;
	
КонецПроцедуры // ДвиженияПоРегистрам()

// Функция готовит таблицу по планируемому расходу ДС для проведения.
// 
// 
// Возвращаемое значение:
//   РезТаблица   – ТаблицаЗначений.
// 
Функция ПодготовитьТаблицуДляДвижений(Отказ)
	
	Запрос = Новый Запрос;
	
	Если ВидОперации = Перечисления.ок_ВидыОперацийБОСС.НачислениеИУдержаниеЗП
		ИЛИ ВидОперации = Перечисления.ок_ВидыОперацийБОСС.УдержаниеПоИсполнительномуЛисту Тогда
		Если МСФО Тогда
			ТекстЗапроса = ПолучитьТекстЗапросаПоНачислениямИУдержаниям_МСФО();
		Иначе
			ТекстЗапроса = ПолучитьТекстЗапросаПоНачислениямИУдержаниям_НеМСФО();
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СторнируемыеДокументыОтсутствуют", 	СторнируемыеДокументы.Количество() = 0);
		Запрос.УстановитьПараметр("ДатаДокумента", 						Дата);
		Запрос.УстановитьПараметр("ПериодНачисления", 					ПериодНачисления);
		Запрос.УстановитьПараметр("МесяцНачисления",					Справочники.рс_МесяцыНачисления.НайтиПоРеквизиту("Дата", ПериодНачисления));
		
	Иначе
		
		Если МСФО Тогда
			Если НЕ ОбрабатыватьДанныеПоРезервамПредыдущегоПериода Тогда
				ТекстЗапроса = ПолучитьТекстЗапросаПоРезервамОтпусков_МСФО_УжеРассчитанаДельта();
			Иначе
				ТекстЗапроса = ПолучитьТекстЗапросаПоРезервамОтпусков_МСФО();
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Организация", 		Организация);
			СтруктураПараметров.Вставить("ПериодНачисления", 	ДобавитьМесяц(ПериодНачисления, -1));
			СтруктураПараметров.Вставить("ВидОперации", 	 	ПредопределенноеЗначение("Перечисление.ок_ВидыОперацийБОСС.РезервыОтпусков"));
			СтруктураПараметров.Вставить("МСФО",				Ложь);
			
			Если ОбрабатыватьДанныеПоРезервамПредыдущегоПериода Тогда
				МассивДокументов = НайтиДокументОперацияБОССПоПараметрам_ПоДокументу(СтруктураПараметров);
				Если МассивДокументов.Количество() > 0 Тогда
					ОперацияБОСС_ПредыдущийМесяц = МассивДокументов[0];
				Иначе
					ОперацияБОСС_ПредыдущийМесяц = Неопределено;
					ТекстСообщения = НСтр("ru = 'Не найден документ ""Операция БОСС"" за предыдущий период начисления с признаком ""МСФО"" = ""Ложь"".
										|Проведение документа отменено.'");
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				КонецЕсли;
			КонецЕсли;
			
		Иначе
			Если НЕ ОбрабатыватьДанныеПоРезервамПредыдущегоПериода Тогда
				ТекстЗапроса = ПолучитьТекстЗапросаПоРезервамОтпусков_НеМСФО_УжеРассчитанаДельта();
			Иначе
				ТекстЗапроса = ПолучитьТекстЗапросаПоРезервамОтпусков_НеМСФО();
			КонецЕсли;
			
			СтруктураПараметров = Новый Структура();
			СтруктураПараметров.Вставить("Организация", 		Организация);
			СтруктураПараметров.Вставить("ПериодНачисления", 	ДобавитьМесяц(ПериодНачисления, -1));
			СтруктураПараметров.Вставить("ВидОперации", 	 	ПредопределенноеЗначение("Перечисление.ок_ВидыОперацийБОСС.РезервыОтпусков"));
			СтруктураПараметров.Вставить("МСФО",				Ложь);
			
			Если ОбрабатыватьДанныеПоРезервамПредыдущегоПериода Тогда
				МассивДокументов = НайтиДокументОперацияБОССПоПараметрам_ПоДокументу(СтруктураПараметров);
				Если МассивДокументов.Количество() > 0 Тогда
					ОперацияБОСС_ПредыдущийМесяц = МассивДокументов[0];
				Иначе
					ОперацияБОСС_ПредыдущийМесяц = Неопределено;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ОперацияБОСС_ПредыдущийМесяц", 	ОперацияБОСС_ПредыдущийМесяц);
		Запрос.УстановитьПараметр("ПериодНачисления", 				ПериодНачисления);
		Запрос.УстановитьПараметр("МесяцНачисления",		 		Справочники.рс_МесяцыНачисления.НайтиПоРеквизиту("Дата", ПериодНачисления));
	КонецЕсли;

	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ОперацияБОСС", Ссылка);
	Запрос.УстановитьПараметр("ДатаСторноМСФО", ДатаСторноМСФО);
	
	Результат = Запрос.Выполнить();
	
	РезТаблица = Результат.Выгрузить();
	
	Возврат РезТаблица;

КонецФункции // ПодготовитьТаблицуПланируемыйРасхода()

#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события "ОбработкаПроведения".
// 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	РеквизитыДокумента = бит_ОбщегоНазначения.СформироватьСтруктуруШапкиДокумента(ЭтотОбъект);
	
	// Заголовок для сообщений об ошибках проведения.
	Заголовок = бит_ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
	
	ПроверкаРеквизитов(РеквизитыДокумента, Отказ, Заголовок);
	ПроверкаЗакрытогоПериода(РеквизитыДокумента, Отказ, Заголовок);
	
	//Если (РеквизитыДокумента.ПериодЗакрыт_РСБУ
	//	ИЛИ РеквизитыДокумента.ПериодЗакрыт_МСФО)
	Если РеквизитыДокумента.ПериодЗакрыт_РСБУ
		И СторнируемыеДокументы.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Период начисления ""%1"" находится в закрытом периоде.
									|Необходимо заполнить ТЧ с документами-основаниями (ранее оформленными документами “Операция БОСС” за выбранный период начисления)'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ПериодНачисления);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
		
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаДляДвижений = ПодготовитьТаблицуДляДвижений(Отказ);
	
	// Выполним движения
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(РеквизитыДокумента,ТаблицаДляДвижений,Отказ,Заголовок);
	КонецЕсли;
	
	//УстановитьДополнительныеСвойства(РеквизитыДокумента);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//Для Каждого ТекущееДвижение Из Движения Цикл 
	//	ТекущееДвижение.Прочитать();
	//КонецЦикла;
	
	//Если Не ЭтоНовый() Тогда
	//	
	//	Запрос = Новый Запрос("Выбрать Док.ПометкаУдаления, Док.Проведен Из Документ.ок_ОперацияБОСС КАК Док Где Док.Ссылка = &Ссылка");
	//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	
	//	Если Выборка.Следующий()  Тогда	
	//		Если РежимЗаписи = РежимЗаписиДокумента.Запись 
	//			Тогда			
	//			Движения.бит_Дополнительный_2.Прочитать();
	//			ТаблицаДвиженийМСФО = Движения.бит_Дополнительный_2.Выгрузить(); 	
	//		КонецЕсли;		
	//	КонецЕсли;
	//	
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//Если ТаблицаДвиженийМСФО.Количество() Тогда
	//	
	//	Движения.бит_Дополнительный_2.Загрузить(ТаблицаДвиженийМСФО);
	//	Движения.бит_Дополнительный_2.Записывать = Истина;
	//	Движения.бит_Дополнительный_2.Записать();
	//	
	//	ТаблицаДвиженийМСФО.Очистить();
	//	
	//КонецЕсли;
	
	РеквизитыДокумента = Новый Структура();
	РеквизитыДокумента.Вставить("ВидОперации", ВидОперации);
	УстановитьДополнительныеСвойства(РеквизитыДокумента);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

#КонецОбласти

#Область ОператорыОсновнойПрограммы

#КонецОбласти

ТаблицаДвиженийМСФО = Новый ТаблицаЗначений;

#КонецЕсли

