#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
		      	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда	
		Возврат;	
	КонецЕсли; 

	Если Найти(Код, ".") <> 0 Тогда
		Код = СтрЗаменить(Код, ".", "");
	КонецЕсли;
		
	бит_ук_СлужебныйСервер.РегистрацияНачалоСобытия(Отказ, ЭтотОбъект.ДополнительныеСвойства);
	
	Если Ссылка.ПометкаУдаления <> ЭтотОбъект.ПометкаУдаления Тогда 	
		Возврат;  	
	КонецЕсли; 
	
	Имена = Справочники.бит_ВидыСоответствийАналитик.ЗарезервированныеИмена();
	
	Если НЕ Имена.НайтиПоЗначению(Код) = Неопределено Тогда
		ТекстСообщения =  НСтр("ru = 'Имя ""%1%"" зарезервировано для поставляемых соответствий.'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения, Код);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "Код", ,Отказ);
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияПриЗаписи(Отказ, ЭтотОбъект.ДополнительныеСвойства, Метаданные().ПолноеИмя());
		
КонецПроцедуры

#КонецОбласти

#КонецЕсли
