
Перем НомерЗаписи;

Процедура ПередЗаписью(Отказ, Замещение)
	
	Для Каждого ТекСтрока Из ЭтотОбъект Цикл
		
		Если НЕ ТекСтрока.НомерЗаписи = 0 Тогда 
			Возврат;
		КонецЕсли;
		
		НомерЗаписи = НомерЗаписи+1;
		ТекСтрока.НомерЗаписи = НомерЗаписи;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	МАКСИМУМ(бит_му_НРП_ВНА.НомерЗаписи) КАК НомерЗаписи
	|ИЗ
	|	РегистрСведений.бит_му_НРП_ВНА КАК бит_му_НРП_ВНА");
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		Константы.бит_му_НомерЗаписиРегистраНРПВНА.Установить(Выборка.НомерЗаписи);
	иначе
		Константы.бит_му_НомерЗаписиРегистраНРПВНА.Установить(0);
	КонецЕсли;
	
	
КонецПроцедуры


НомерЗаписи = Константы.бит_му_НомерЗаписиРегистраНРПВНА.Получить();
