
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	флРежимСинхронизации = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_СинхронизироватьПодразделенияРеглЦФО");
	
    Элементы.Список.ИзменятьСоставСтрок = НЕ флРежимСинхронизации;
	Если НЕ Элементы.Найти("ФормаОбработкабит_ИмпортОбъектовИзExcelЗагрузитьИзExcelПоНастройке") = Неопределено Тогда
		
		Элементы.ФормаОбработкабит_ИмпортОбъектовИзExcelЗагрузитьИзExcelПоНастройке.Видимость = НЕ флРежимСинхронизации;	
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

