
&НаКлиенте
Процедура Загрузить(Команда)
	
	АдресТаб = ПолучитьНовыеДвижения();
	
	СоздатьНовыеДвижения(АдресТаб, Истина);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	
	АдресТаб = ПолучитьНовыеДвижения();
	
	СоздатьНовыеДвижения(АдресТаб, Ложь);	
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНовыеДвижения() Экспорт
	
	АдресТаб = ПоместитьВоВременноеХранилище(Объект.ТаблицаДвижений.Выгрузить(Новый Структура("Выбрать", Истина)), ЭтаФорма.УникальныйИдентификатор);
	Возврат АдресТаб;
	
КонецФункции

&НаСервере
Процедура СоздатьНовыеДвижения(АдресТаб, Замена)			   
	
	ТаблицаНовыхДвижений = ПолучитьИзВременногоХранилища(АдресТаб);
	НаборЗаписейРегистра = РегистрыСведений.бит_му_НРП_ВНА.СоздатьНаборЗаписей();

	НаборЗаписейРегистра.Отбор.ОрганизацияЗаказчик.Установить(Объект.ОрганизацияЗаказчик);
	НаборЗаписейРегистра.Отбор.ОрганизацияПодрядчик.Установить(Объект.ОрганизацияПодрядчик);
	НаборЗаписейРегистра.Отбор.ИсточникЗаписи.Установить(Шаг);
	НаборЗаписейРегистра.Прочитать(); 
	Колво = НаборЗаписейРегистра.Количество();
	
	Если Колво > 0 Тогда
		Если Замена Тогда
			Для Сч = 1 По Колво Цикл
				Если НаборЗаписейРегистра[Колво-Сч].Период<=Объект.ДатаКон И НаборЗаписейРегистра[Колво-Сч].Период>=Объект.ДатаНач Тогда
					НаборЗаписейРегистра.Удалить(Колво-Сч);
				КонецЕсли;
			КонецЦикла;			
		КонецЕсли;		
		НаборЗаписейРегистра.Записать();
	КонецЕсли;
	
	// --> BIT AGoncharenko CR#267 05.05.2015
	// обработаем дополнительно записи регистра
	Если Шаг = Перечисления.бит_му_ИсточникЗаписи_НРП_ВНА.АнализДокументовПоступлениеТоваровУслугПоступлениеДопРасходов Тогда
		// НРП
		НаборЗаписейРегистраНРП = РегистрыСведений.бит_му_НРП_ВНА.СоздатьНаборЗаписей();
		
		НаборЗаписейРегистраНРП.Отбор.ОрганизацияЗаказчик.Установить(Объект.ОрганизацияЗаказчик);
		НаборЗаписейРегистраНРП.Отбор.ОрганизацияПодрядчик.Установить(Объект.ОрганизацияПодрядчик);
		НаборЗаписейРегистраНРП.Отбор.ИсточникЗаписи.Установить(Перечисления.бит_му_ИсточникЗаписи_НРП_ВНА.АнализДокументовПоступлениеТоваровУслугПоступлениеДопРасходов_ПередачаОС_НРП);
		НаборЗаписейРегистраНРП.Прочитать(); 
		Колво = НаборЗаписейРегистраНРП.Количество();
		
		Если Колво > 0 Тогда
			Если Замена Тогда
				Для Сч = 1 По Колво Цикл
					Если НаборЗаписейРегистраНРП[Колво-Сч].Период<=Объект.ДатаКон И НаборЗаписейРегистраНРП[Колво-Сч].Период>=Объект.ДатаНач Тогда
						НаборЗаписейРегистраНРП.Удалить(Колво-Сч);
					КонецЕсли;
				КонецЦикла;			
			КонецЕсли;		
			НаборЗаписейРегистраНРП.Записать();
		КонецЕсли;
		
		// С/С актива
		НаборЗаписейРегистраСебестоимость = РегистрыСведений.бит_му_НРП_ВНА.СоздатьНаборЗаписей();
		
		НаборЗаписейРегистраСебестоимость.Отбор.ОрганизацияЗаказчик.Установить(Объект.ОрганизацияЗаказчик);
		НаборЗаписейРегистраСебестоимость.Отбор.ОрганизацияПодрядчик.Установить(Объект.ОрганизацияПодрядчик);
		НаборЗаписейРегистраСебестоимость.Отбор.ИсточникЗаписи.Установить(Перечисления.бит_му_ИсточникЗаписи_НРП_ВНА.АнализДокументовПоступлениеТоваровУслугПоступлениеДопРасходов_ПередачаОС_СебестоимостьАктива);
		НаборЗаписейРегистраСебестоимость.Прочитать(); 
		Колво = НаборЗаписейРегистраСебестоимость.Количество();
		
		Если Колво > 0 Тогда
			Если Замена Тогда
				Для Сч = 1 По Колво Цикл
					Если НаборЗаписейРегистраСебестоимость[Колво-Сч].Период<=Объект.ДатаКон И НаборЗаписейРегистраСебестоимость[Колво-Сч].Период>=Объект.ДатаНач Тогда
						НаборЗаписейРегистраСебестоимость.Удалить(Колво-Сч);
					КонецЕсли;
				КонецЦикла;			
			КонецЕсли;		
			НаборЗаписейРегистраСебестоимость.Записать();
		КонецЕсли;
	КонецЕсли;
	// <-- BIT AGoncharenko

	МассивСозданныхПроводок = "";
	
	СообщитьШапку = Истина;
	Для Каждого НовоеДвижение ИЗ ТаблицаНовыхДвижений Цикл
						
			НоваяСтрока = РегистрыСведений.бит_му_НРП_ВНА.СоздатьМенеджерЗаписи();			
			                                                                      		
			ЗаполнитьЗначенияСвойств(НоваяСтрока, НовоеДвижение);			
			
			НоваяСтрокаДляПроверки = РегистрыСведений.бит_му_НРП_ВНА.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДляПроверки, НовоеДвижение);
			НоваяСтрокаДляПроверки.Прочитать();	
			
			НоваяСтрока.Записать();
				
			Если Не Замена Тогда				
				Если НЕ НоваяСтрокаДляПроверки.НомерЗаписи = 0 Тогда
					Если СообщитьШапку Тогда
						Сообщить("В регистре НРП ВНА были заменены строки, которые содержали одинаковые данные в полях-измерениях (Организация-заказчик, Организация-подрядчик, Документ реализации, Документ поступления, Источник записи, Приход-расход, Регистратор, Счет учета актива):");
						СообщитьШапку = Ложь;
					КонецЕсли;
					Сообщить("Строка " + НоваяСтрокаДляПроверки.НомерЗаписи + " регистра НРП ВНА заменена на строку №" + НоваяСтрока.НомерЗаписи);
				КонецЕсли;
			КонецЕсли;		
			
			МассивСозданныхПроводок = МассивСозданныхПроводок + Строка(НоваяСтрока.НомерЗаписи) + ",";
				
	КонецЦикла;                    														   
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьВсе(Команда)
	
	Для Каждого Строка Из Объект.ТаблицаДвижений Цикл
		Строка.Выбрать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из Объект.ТаблицаДвижений Цикл
		Строка.Выбрать = Ложь;
	КонецЦикла;
	
КонецПроцедуры
