
#Область ОписаниеПеременных

&НаКлиенте
Перем мТекущийРБ; // Хранит текущий регистр бухгалтерии

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	фДоступныеОбъектыСистемы = бит_РегламентныеЗакрытия.СформироватьСписокРегистровБухгалтерииДляВыбора();
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	мТекущийРБ = Объект.РегистрБухгалтерии;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РегистрБухгалтерииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВидовОбъектов = Новый СписокЗначений;
	СписокВидовОбъектов.Добавить(ПредопределенноеЗначение("Перечисление.бит_ВидыОбъектовСистемы.РегистрБухгалтерии"));
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ВидыОбъектов"           , СписокВидовОбъектов);
	ПараметрыФормы.Вставить("ТекущийОбъектСистемы"   , Объект.РегистрБухгалтерии);
	ПараметрыФормы.Вставить("ДоступныеОбъектыСистемы", фДоступныеОбъектыСистемы);
	ОткрытьФорму("ОбщаяФорма.бит_ФормаВыбораОбъектовСистемыУправляемая", ПараметрыФормы,Элемент,УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрБухгалтерииПриИзменении(Элемент)
	
	// Проверка допустимости выбранного значения.
	Если ЗначениеЗаполнено(Объект.РегистрБухгалтерии) 
		И фДоступныеОбъектыСистемы.НайтиПоЗначению(Объект.РегистрБухгалтерии) = Неопределено Тогда
		
		ТекстСообщения = НСтр("ru = 'Выбрано недопустимое значение регистра бухгелтерии %1%!'");
		ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения, Объект.РегистрБухгалтерии);
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения, Объект, "Объект.РегистрБухгалтерии");
		Объект.РегистрБухгалтерии = мТекущийРБ;
		Возврат;
		
	КонецЕсли; 
	
	мТекущийРБ = Объект.РегистрБухгалтерии;
	
КонецПроцедуры

#КонецОбласти
