#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ПервоначальноеЗаполнение() Экспорт
	
	МассивИменКатегорий = Новый Массив;
	МассивИменКатегорий.Добавить("ИмеющиесяДляПродажи");
	МассивИменКатегорий.Добавить("КредитыИДебиторскаяЗадолженность");
	МассивИменКатегорий.Добавить("УдерживаемыеДоПогашения");
	МассивИменКатегорий.Добавить("УчитываемыеПоСправедливойСтоимости");
	
	Для Каждого ИмяКатегории Из МассивИменКатегорий Цикл
		ЭлементКатегория = Справочники.бит_му_КатегорииФинансовыхАктивовМСФО[ИмяКатегории];
		Если ЗначениеЗаполнено(ЭлементКатегория.ТипКатегории) Тогда
			Продолжить;			
		КонецЕсли;
		ОбъектКатегория = ЭлементКатегория.ПолучитьОбъект();
		ОбъектКатегория.ТипКатегории = Перечисления.бит_му_ТипыКатегорийФинансовыхАктивовМСФО[ИмяКатегории];
		ОбновлениеИнформационнойБазы.ЗаписатьДанные(ОбъектКатегория);
	КонецЦикла;

КонецПроцедуры
 
#КонецОбласти

#КонецЕсли