#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьНастройку(Настройка,ЗначениеНастройки,ДатаУстановки) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.бит_НастройкиПрограммы.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период            = ДатаУстановки;
	МенеджерЗаписи.Настройка         = Настройка;
	МенеджерЗаписи.ЗначениеНастройки = ЗначениеНастройки;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры // УстановитьНастройку()

Процедура УстановитьНастройкуПрограммыПриПереходеНа3_1_44() Экспорт

	ДатаУстановки = Дата('19800101');
	Настройки = ПланыВидовХарактеристик.бит_НастройкиПрограммы;
	УстановитьНастройку(Настройки.ЗаполнятьНазначениеПлатежаВЗаявкеНаРасходованиеДС, 
		Истина, ДатаУстановки);

КонецПроцедуры
	
#КонецОбласти

#КонецЕсли