
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-19 (#3732)
	//ПараметрыФормы = Новый Структура("БумажныйДокументооборот", Истина);
	//ОткрытьФорму("Обработка.ОбменСКонтрагентами.Форма.ок_РаботаСВходящимиДокументами", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ФормаВходящегоБумажногоДокументооборота", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ПараметрыФормы = Новый Структура();
	ОткрытьФорму("Обработка.ОбменСКонтрагентами.Форма.ок_РаботаСВходящимиБумажнымиДокументами", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ФормаВходящегоБумажногоДокументооборота", ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-19 (#3732)
	
КонецПроцедуры
