
#Область ОбработчикиСобытий

// Процедура - обработчик команды.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Документ.бит_ЗаявкаНаРасходованиеСредств.Форма.ФормаСпискаОплат"
				,Новый Структура("ДокументОснование, ПоказыватьДокумент", ПараметрКоманды, Ложь)
				,ПараметрыВыполненияКоманды.Источник
				,ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор
				,ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

#КонецОбласти

			