#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияНачалоСобытия(Отказ, ЭтотОбъект.ДополнительныеСвойства);
		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда			
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияПриЗаписи(Отказ, ЭтотОбъект.ДополнительныеСвойства, Метаданные().ПолноеИмя());
	
	Если НЕ Отказ И НЕ ЭтотОбъект.ДополнительныеСвойства.Свойство("бит_НеРегистрироватьИзменение") Тогда
	
		 РегистрыСведений.бит_мдм_СостоянияОбъектов.Зарегистрировать(ЭтотОбъект.Ссылка, Перечисления.бит_мдм_СостоянияОбъектов.Изменен);
		 
		 Если ЭтотОбъект.ВидИнформационнойБазы = Справочники.бит_мпд_ВидыИнформационныхБаз.ТекущаяИнформационнаяБаза Тогда
			 РегистрыСведений.бит_мдм_СобытияОбъектов.Зарегистрировать(ЭтотОбъект.Ссылка, Перечисления.бит_мдм_События.РегистрацияИзменений);
		 Иначе	
			 РегистрыСведений.бит_мдм_СобытияОбъектов.Зарегистрировать(ЭтотОбъект.Ссылка, Перечисления.бит_мдм_События.ПодготовкаОбмена);
		 КонецЕсли; 
		 
	КонецЕсли; 
	
КонецПроцедуры // ПриЗаписи()

#КонецОбласти

#КонецЕсли
