
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДанныеФайла = ПолучитьДанныеПрисоединенногоФайлаНаСервере(ПараметрКоманды, ПараметрыВыполненияКоманды.Источник.УникальныйИдентификатор);
		
	Если ДанныеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПолучитьФайл(ДанныеФайла.СсылкаНаДвоичныеДанныеФайла, ДанныеФайла.ИмяФайла);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеПрисоединенногоФайлаНаСервере(Документ, Знач УникальныйИдентификатор)
	Перем СсылкаНаАрхив;
	
	Если ок_ОбменСКонтрагентамиВнутренний.ЕстьАрхивИсходящегоДокумента(Документ, СсылкаНаАрхив) Тогда
		Возврат РаботаСФайлами.ДанныеФайла(СсылкаНаАрхив, УникальныйИдентификатор);
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
