
&НаКлиенте
Процедура СоздатьЗаписи(Команда)
	
	Если ПроверитьЗаполнение() Тогда
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-21 (#2875)
		Если Не ПользовательЗаместителяЗаполнен() Тогда 						
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("У заместителя не заполнен связанный с ним пользователь!",,"Объект.ок_Заместитель");
			Возврат;
		КонецЕсли;
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-21 (#2875)
		СоздатьЗаписиНаСервере();
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-21 (#2875)
		ЭтаФорма.Закрыть();
		//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-21 (#2875)		
	КонецЕсли; 
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-21 (#2875)
	//ЭтаФорма.Закрыть();
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-21 (#2875)
КонецПроцедуры

&НаСервере
Процедура СоздатьЗаписиНаСервере()
	
	//создаем записи в РС бит_НазначенныеЗаместители
	Если Объект.Визы.Количество() = 0 Тогда
		Сообщить("Заместители не назначены! У выбранного пользователя нет доступных для согласования виз. Проверьте Права установки виз!");
	Иначе 
		Для каждого Строка из Объект.Визы Цикл 
				лНовЗапись = РегистрыСведений.бит_НазначенныеЗаместители.СоздатьМенеджерЗаписи();
				лНовЗапись.Состояние = Перечисления.бит_СостоянияЗаместителей.Ожидание;
				лНовЗапись.Виза = Строка.Виза;
				лНовЗапись.ДатаНачала = Объект.ДатаНачала;
				лНовЗапись.ДатаОкончания = Объект.ДатаОкончания;     				
				//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-21 (#2875)
				//лНовЗапись.Заместитель = Объект.Заместитель;
				//Заменено на:
				лНовЗапись.Заместитель = Объект.ок_Заместитель.Пользователь;
				//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-21 (#2875)
				лНовЗапись.Пользователь = Объект.Пользователь.Пользователь;
				лНовЗапись.Записать(Истина); 		 				
		КонецЦикла;
	КонецЕсли;
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-10-23 (#3393)
	Если ЗначениеЗаполнено(ок_ЗаместительОтветственныйЗаКорректировки) Тогда 
		лНовЗапись 		  = РегистрыСведений.ок_ЗаместителиОтветственныхЗаКорректировкуБК.СоздатьМенеджерЗаписи();
		лНовЗапись.Период = Объект.ДатаНачала;
		лНовЗапись.ОтветственныйЗаКорректировкуБК = ПараметрыСеанса.бит_БК_ТекущийИнициатор;     				
		лНовЗапись.ДатаОкончанияПолномочий = Объект.ДатаОкончания;     				
		лНовЗапись.Заместитель = ок_ЗаместительОтветственныйЗаКорректировки;		
		лНовЗапись.Записать(Истина)
	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-10-23 (#3393)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Если ЗначениеЗаполнено(Параметры.Пользователь) Тогда
		Объект.Пользователь = Параметры.Пользователь;
	КонецЕсли;
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-25 (#2875)
	Если УправлениеДоступом.ЕстьРоль("ПолныеПрава"		,,Пользователи.ТекущийПользователь()) ИЛИ
		 УправлениеДоступом.ЕстьРоль("бит_БК_ГлавныйБК" ,,Пользователи.ТекущийПользователь())
	Тогда 
		Элементы.Пользователь.ТолькоПросмотр = Ложь;
	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-25 (#2875)
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-10-23 (#3393)
	Если ЗначениеЗаполнено(ПараметрыСеанса.бит_БК_ТекущийИнициатор)
	   И ТекущийИнициаторОтветственныйЗаКорректировки() 
	Тогда 
		Элементы.ок_ЗаместительОтветственныйЗаКорректировки.Видимость = Истина;
	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-10-23 (#3393)
	
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-14 (#3393)
&НаСервереБезКонтекста
Функция ТекущийИнициаторОтветственныйЗаКорректировки()
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	СБ_СоответствиеФД_ЦФО.ЦФО КАК ЦФО
	|ИЗ
	|	РегистрСведений.СБ_СоответствиеФД_ЦФО КАК СБ_СоответствиеФД_ЦФО
	|ГДЕ
	|	СБ_СоответствиеФД_ЦФО.ОтветственныйЗаКорректировкуБК = &ТекущийИнициатор";
	Запрос.УстановитьПараметр("ТекущийИнициатор", ПараметрыСеанса.бит_БК_ТекущийИнициатор);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
		
КонецФункции
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-14 (#3393)

&НаКлиенте
Процедура ЗаместительПриИзменении(Элемент)
	ЗаместительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаместительПриИзмененииНаСервере()
	
	//заполняем таблицу виз, доступными визами выбранного пользователя	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ГруппыПользователейСостав.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ГруппаПользователя
	|ИЗ
	|	Справочник.ГруппыПользователей.Состав КАК ГруппыПользователейСостав
	|ГДЕ
	|	ГруппыПользователейСостав.Пользователь = &Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	бит_ПраваУстановкиВиз.Виза КАК Виза
	|ИЗ
	|	РегистрСведений.бит_ПраваУстановкиВиз КАК бит_ПраваУстановкиВиз
	|ГДЕ
	|	(бит_ПраваУстановкиВиз.Пользователь = &Пользователь
	|			ИЛИ бит_ПраваУстановкиВиз.Инициатор = &Пользователь)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_ПраваУстановкиВиз.Виза
	|ИЗ
	|	ВТ_ГруппаПользователя КАК ВТ_ГруппаПользователя
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПраваУстановкиВиз КАК бит_ПраваУстановкиВиз
	|		ПО ВТ_ГруппаПользователя.Ссылка = бит_ПраваУстановкиВиз.Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Объект.Пользователь.Пользователь);
	
	Объект.Визы.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2017-08-21 (#2875)
Функция ПользовательЗаместителяЗаполнен()
	Возврат ЗначениеЗаполнено(Объект.ок_Заместитель.Пользователь);
КонецФункции	
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2017-08-21 (#2875)
