
// ОКЕЙ Гиль А.В.(Софтлаб) Начало 23.09.2019 (#3487)
Функция ок_ПолучитьНастройкиПодключенияАксапта() Экспорт
	
	УстановитьПривилегированныйРежим(Истина); // отключим ограничение по правам
	
	Организация_ОкейЛоджистикс 	= бит_БК_Общий.ПолучитьЗначениеНастройкиМеханизмаИмпортаДанных("Организации", "Организация Лоджистикс");
	Организация_Окей 			= бит_БК_Общий.ПолучитьЗначениеНастройкиМеханизмаИмпортаДанных("Организации", "Организация ОКЕЙ");
	Настройки					= Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	&Организация_ОкейЛоджистикс КАК Организация,
	|	АдресСервера.Значение КАК АдресСервера,
	|	БазаДанных.Значение КАК БазаДанных,
	|	ИмяПользователя.Значение КАК ИмяПользователя,
	|	Пароль.Значение КАК Пароль
	|ИЗ
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК АдресСервера,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК БазаДанных,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК ИмяПользователя,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК Пароль
	|ГДЕ
	|	АдресСервера.ИмяНастройки = ""АдресСервера Лоджистикс""
	|	И БазаДанных.ИмяНастройки = ""БазаДанных Лоджистикс""
	|	И ИмяПользователя.ИмяНастройки = ""ИмяПользователя Лоджистикс""
	|	И Пароль.ИмяНастройки = ""Пароль Лоджистикс""
	|	И АдресСервера.Группа = ""ПараметрыСоединенияSQL""
	|	И БазаДанных.Группа = ""ПараметрыСоединенияSQL""
	|	И ИмяПользователя.Группа = ""ПараметрыСоединенияSQL""
	|	И Пароль.Группа = ""ПараметрыСоединенияSQL""
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Организация_Окей,
	|	АдресСервера.Значение,
	|	БазаДанных.Значение,
	|	ИмяПользователя.Значение,
	|	Пароль.Значение
	|ИЗ
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК АдресСервера,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК БазаДанных,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК ИмяПользователя,
	|	РегистрСведений.бит_ок_НастройкиМеханизмаИмпортаДанных КАК Пароль
	|ГДЕ
	|	АдресСервера.ИмяНастройки = ""АдресСервера""
	|	И БазаДанных.ИмяНастройки = ""БазаДанных""
	|	И ИмяПользователя.ИмяНастройки = ""ИмяПользователя""
	|	И Пароль.ИмяНастройки = ""Пароль""
	|	И АдресСервера.Группа = ""ПараметрыСоединенияSQL""
	|	И БазаДанных.Группа = ""ПараметрыСоединенияSQL""
	|	И ИмяПользователя.Группа = ""ПараметрыСоединенияSQL""
	|	И Пароль.Группа = ""ПараметрыСоединенияSQL""
	|ИТОГИ ПО
	|	Организация"
	;
	Запрос.УстановитьПараметр("Организация_ОкейЛоджистикс", Организация_ОкейЛоджистикс);
	Запрос.УстановитьПараметр("Организация_Окей", Организация_Окей);
	
	ВыборкаПоОрганизациям = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПоОрганизациям.Следующий() Цикл
		ВыборкаНастройки = ВыборкаПоОрганизациям.Выбрать();
		Если ВыборкаНастройки.Следующий() Тогда
			
			СтруктураПодключения 	= Новый Структура("АдресСервера, ИмяПользователя, Пароль, БазаДанных, СтрокаСоединения");
			ЗаполнитьЗначенияСвойств(СтруктураПодключения, ВыборкаНастройки);
			СтруктураПодключения.СтрокаСоединения = "driver={SQL Server};server="+ВыборкаНастройки.АдресСервера+";uid="+ВыборкаНастройки.ИмяПользователя+";pwd="+ВыборкаНастройки.Пароль+";Database="+ ВыборкаНастройки.БазаДанных;
			
			Настройки.Вставить(ВыборкаПоОрганизациям.Организация, СтруктураПодключения);
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Настройки;
	
КонецФункции

// ОКЕЙ Гиль А.В.(Софтлаб) Конец 23.09.2019 (#3487)