
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("СписокЗакладок, ПараметрОткрытия");
	
	ФормаИсточника = ПолучитьФорму("Обработка.бит_си_ИсточникСправочникСтатьи.Форма.ФормаУправляемая");	
	ПараметрыФормы.СписокЗакладок = ФормаИсточника.ПолучитьМассивИсточников("бит_си_ИсточникСправочникСтатьи");
	ПараметрыФормы.ПараметрОткрытия = НайтиСтатью();
	
	Если ЗначениеЗаполнено(ПараметрыФормы.ПараметрОткрытия) Тогда
		
		ОткрытьФорму("Обработка.бит_си_СправочнаяИнформация.Форма", ПараметрыФормы, "бит_си_СправочнаяИнформация", Ложь);		
		
	Иначе
		
		ТекстСообщения =  НСтр("ru = 'Не найдена статья справки.'");
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти


#Область ПрочиеПроцедурыФункции

&НаСервере
Функция НайтиСтатью()
	
	СтатьяСправки = Справочники.бит_си_Статьи.НайтиПоНаименованию("БыстрыйСтарт.Бюджетирование");
	
	Возврат СтатьяСправки;
	
КонецФункции // НайтиСтатью()


#КонецОбласти

