////izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ (
////Событие ПриОткрытии() заменилось на ПриОткрытии(Отказ)
////izhtc_translator ИЗМЕНЕННЫЕ СОБЫТИЯ ФОРМЫ )


//&НаКлиенте
//Процедура ПриОткрытии(Отказ)
//	
//	Для каждого ТекКолонка Из  Элементы.ТабличноеПолеВыбора.ПодчиненныеЭлементы Цикл
//		//Устанавливаем заголовки
//		Если ТекКолонка.Имя = "Аналитика_1" Тогда 
//			ТекКолонка.ТекстШапки = "№ Заявки"
//		ИначеЕсли 	ТекКолонка.Имя = "Аналитика_2" Тогда 
//			ТекКолонка.ТекстШапки = "Объект"
//		ИначеЕсли	 ТекКолонка.Имя = "Аналитика_3" Тогда 
//			ТекКолонка.ТекстШапки = "Вариант бюджета"
//		ИначеЕсли	 ТекКолонка.Имя = "Аналитика_4" Тогда 
//			ТекКолонка.ТекстШапки = "ID"
//		КонецЕсли;
//        //устанавливаем колонку флага Выбран
//		Если ТекКолонка.Имя = "Выбран" Тогда
//			ТекКолонка.УстановитьЭлементУправления(Тип("Флажок"));
//			ТекКолонка.ДанныеФлажка = "Выбран";
//			ТекКолонка.ТекстШапки = "";
//			ТекКолонка.Ширина = 3;
//			ТекКолонка.РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
//			ТекКолонка.ИзменениеРазмера = ИзменениеРазмераКолонки.НеИзменять;
//			ТекКолонка.Формат = "БЛ=; БИ=";
//			
//			ТекКолонка.ИзменятьВидимость = Ложь;
//			ТекКолонка.ИзменятьПозицию = Ложь; 			
//			
//		иначе //остальные недоступны
//			ТекКолонка.ТолькоПросмотр = Истина;
//			ТекКолонка.ИзменятьВидимость = Истина;
//			ТекКолонка.ИзменятьПозицию = Истина;
//		КонецЕсли;
//			//устанавливаем видимость
//		Если ТекКолонка.Имя = "Выбран" ИЛИ
//			ТекКолонка.Имя = "НомерСтроки" ИЛИ
//			ТекКолонка.Имя = "Период" ИЛИ
//			ТекКолонка.Имя = "ЦФО" ИЛИ
//			ТекКолонка.Имя = "СтатьяОборотов" ИЛИ
//			ТекКолонка.Имя = "Аналитика_2" ИЛИ
//			ТекКолонка.Имя = "бит_БК_СуммаБезНДС" ИЛИ
//			ТекКолонка.Имя = "бит_БК_СуммаЗаРамкамиБюджетаБезНДС" Тогда 			
//			ТекКолонка.Имя = "Видимость" = Истина;
//		иначе
//			ТекКолонка.Видимость = Ложь;
//		КонецЕсли;

//		//устанавливаем отображение итогов для сумм
//		Если НЕ Найти(ВРег(ТекКолонка.Имя),"СУММА") = 0 Тогда 
//			ТекКолонка.ОтображатьВПодвале = Истина;
//			ТекКолонка.ОтображатьИтогиВПодвале = Истина;
//		иначе
//			ТекКолонка.ОтображатьВПодвале = Ложь;
//		КонецЕсли;
//		
//	КонецЦикла;
////ОК Ванюков К. + //2012-03-01 //При открытии все галки проставлены
//	ДействияФормыУстановитьВсе(Неопределено);
////ОК Ванюков К. -
//	
//КонецПроцедуры

//&НаСервере
//Функция ДействияФормыУстановитьВсе_Сервер()
//	Для Каждого  ТекСтрока Из ТабличноеПолеВыбора Цикл
//		ТекСтрока.Выбран = Истина;	
//	КонецЦикла; 
//	ПосчитатьСуммуВыбранныхСтрок();
//КонецФункции


//&НаКлиенте
//Процедура ДействияФормыУстановитьВсе(Команда)
//	ДействияФормыУстановитьВсе_Сервер();
//КонецПроцедуры

//&НаСервере
//Функция ДействияФормыСнятьВсе_Сервер()
//	Для Каждого  ТекСтрока Из ТабличноеПолеВыбора Цикл
//		ТекСтрока.Выбран = Ложь;	
//	КонецЦикла;
//	ПосчитатьСуммуВыбранныхСтрок();
//КонецФункции


//&НаКлиенте
//Процедура ДействияФормыСнятьВсе(Команда)
//	ДействияФормыСнятьВсе_Сервер();
//КонецПроцедуры

//&НаКлиенте
//Процедура ОсновныеДействияФормыЗагрузить(Команда)
//	Если Предупреждения() Тогда 
//		Возврат;
//	КонецЕсли;
//	
//	Структура = Новый Структура("СпособЗагрузки, СуммаДляЗагрузки","Загрузить", СуммаДляЗагрузки);
//	Закрыть(Структура);
//КонецПроцедуры

//&НаКлиенте
//Процедура ОсновныеДействияФормыДобавить(Команда)
//	Если Предупреждения() Тогда 
//		Возврат;
//	КонецЕсли;
//	Структура = Новый Структура("СпособЗагрузки, СуммаДляЗагрузки","Добавить", СуммаДляЗагрузки);
//	Закрыть(Структура);
//КонецПроцедуры

//&НаКлиенте
//Функция Предупреждения()
//	Отказ = Ложь;
//	Текст = "";
//	Если ТабличноеПолеВыбора.Найти(Истина, "Выбран") = Неопределено Тогда 
//		Текст = Текст + "Не выбраны строки"+ Символы.ПС;
//		Отказ = Истина;
//	КонецЕсли;
//	Если СуммаДляЗагрузки = 0 Тогда 
//		Текст = Текст + "Не указана сумма для загрузки"+ Символы.ПС;
//		Отказ = Истина;
//	КонецЕсли;
//	Если Отказ Тогда 
//		Предупреждение(Текст, 5);
//	КонецЕсли;
//	
//	Возврат Отказ;
//КонецФункции
//	//izhtc_translator предупреждение
//	//В управляемые формы не переносятся кнопки ОК, Записать, Закрыть. Проверить необходимость переноса кода, связанного с текущим элементом!

//&НаКлиенте
//Процедура ОсновныеДействияФормыЗакрыть(Команда)
//	Закрыть(Неопределено);
//КонецПроцедуры

//&НаСервере
//Процедура ПосчитатьСуммуВыбранныхСтрок()
//	СуммаВыбранных = 0;
//	Для Каждого ТекСтрока Из ТабличноеПолеВыбора Цикл
//		Если ТекСтрока.Выбран Тогда 
//			 СуммаВыбранных = СуммаВыбранных + ТекСтрока.бит_БК_СуммаБезНДС;
//		 КонецЕсли;
//	 КонецЦикла;
//	 
//	Выбрано = СуммаВыбранных;
//	
//	//ОК Калинин М. 211212
//	СуммаДляЗагрузки = Выбрано;
//	//ОК Калинин М. 
//	
//КонецПроцедуры

//&НаКлиенте
////izhtc_translator предупреждение
////Перенести обработчик события ПриИзмененииФлажка на ПриИзменении у соответствующей колонки
//Процедура ТабличноеПолеВыбораПриИзмененииФлажка(Элемент)
//	ПосчитатьСуммуВыбранныхСтрок()
//КонецПроцедуры
