
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	МетаданныеОбъекта = Метаданные.Обработки.бит_ЗаменаТиповАналитикВДокументах;
	
	// Вызов механизма защиты
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект.РежимЗаписи = "Запись";
	Объект.ВыполнятьВТранзакции  = Истина;
	
	СписокТиповДокументов = ПолучитьСписокДокументов();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПериода(Команда)
	
	бит_РаботаСДиалогамиКлиент.ОткрытьДиалогСтандартногоПериодаПоДатам(Объект);
	
КонецПроцедуры // НастройкаПериода()

&НаКлиенте
Процедура ВыполнитьОбработку(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ВыполнитьОбработкуЗавершение", ЭтотОбъект);
	ТекстВопроса = НСтр("ru='Будет произведена замена типов аналитик в документах. Продолжить?'");
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры // ВыполнитьОбработку()

// Процедура обработчик оповещения "ВыполнитьОбработкуЗавершение".
// 
// Параметры:
// Результат - КодВозвратаДиалога.
// ДополнительныеДанные - Структура.
// 
&НаКлиенте
Процедура ВыполнитьОбработкуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ЗаменитьТипыАналитик(СписокТиповДокументов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьСписокДокументов()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	СписокДокументов = ОбработкаОбъект.ПолучитьДокументыИспользующиеДопАналитики();
	
	Возврат СписокДокументов;
	
КонецФункции // ПолучитьСписокДокументов()

&НаСервере
Процедура ЗаменитьТипыАналитик(СписокДокументов)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	// Для замены типов аналитик кроме списка документов, необходима инициализация некоторых вспомогательных структур.
	ОбработкаОбъект.ПолучитьДокументыИспользующиеДопАналитики();
	
	ОбработкаОбъект.ЗаменитьТипыАналитик(СписокДокументов);
	
КонецПроцедуры // ЗаменитьТипыАналитик()

#КонецОбласти

