
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТаблицаППУ = бит_ОбщегоНазначения.РаспаковатьТаблицуЗначений(Параметры.ТаблицаПравилПоискаПоУмолчанию);
	ТаблицаПравилПоискаПоУмолчанию.Загрузить(ТаблицаППУ);
	
	СпособЗаписиНазначенийПравилПоиска = Параметры.СпособЗаписиНазначенийПравилПоиска;
	СпособПоискаДанныхДляПеречислений  = Параметры.СпособПоискаДанныхДляПеречислений;
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды "ОК".
// 
&НаКлиенте
Процедура ОК(Команда)
	
	СтруктураРезультата = Новый Структура;
	
	СтруктураРезультата.Вставить("ТаблицаПравилПоискаПоУмолчанию"	 , ПолучитьХранилищеПравил());
	СтруктураРезультата.Вставить("СпособЗаписиНазначенийПравилПоиска", СпособЗаписиНазначенийПравилПоиска);
	СтруктураРезультата.Вставить("СпособПоискаДанныхДляПеречислений" , СпособПоискаДанныхДляПеречислений);
	
	Закрыть(СтруктураРезультата);
	
КонецПроцедуры // ОК()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция помещает таблицу правил по умолчанию в хранилище значений.
// 
// Параметры:
//  Нет
//  
// Возвращаемое значение:
//   ХранилищеЗначений
// 
&НаСервере
Функция ПолучитьХранилищеПравил()

	ТаблицаППУ 		= ТаблицаПравилПоискаПоУмолчанию.Выгрузить();
	ХранилищеПравил = бит_ОбщегоНазначения.УпаковатьТаблицуЗначений(ТаблицаППУ);

	Возврат ХранилищеПравил;
	
КонецФункции // ПолучитьХранилищеПравил()

#КонецОбласти

