
&НаСервере
Функция ПоместитьТаблицуОстатковВоВременноеХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ОстаткиПоОвердафту.Выгрузить())
	
КонецФункции

&НаКлиенте
Процедура Применить(Команда)
	ВладелецФормы.ОбработатьПодбор(ПоместитьТаблицуОстатковВоВременноеХранилище());
	Закрыть();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОстаткиПоОвердафту.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресОстаткиПоОвердрафту));
	
	Организация = Параметры.Организация;
	
КонецПроцедуры
