#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	Параметры.Свойство("ИсходныйКод", ИсходныйКод);
	Если ЗначениеЗаполнено(ИсходныйКод) Тогда
		РаскраситьНаСервере();
		СкрытьИсходныйКод = Неопределено;
		Параметры.Свойство("СкрытьИсходныйКод", СкрытьИсходныйКод);
		Если СкрытьИсходныйКод = Истина Тогда
			Элементы.ИсходныйКод.Видимость = Ложь;
			ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Нет;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Раскрасить(Команда)
	РаскраситьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура РаскраситьНаСервере()
	РезультатHTML = РеквизитФормыВЗначение("Объект").РаскраситьТекст(ИсходныйКод);
КонецПроцедуры

#КонецОбласти

