
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры // ПриОткрытии()

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Объект.Ссылка.Метаданные();
	
	// Вызов механизма защиты
	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли; 	
	
	Если Параметры.Ключ.Пустая() Тогда
	 	фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость/доступность элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	Элементы.Код.ТолькоПросмотр         = Объект.Предопределенный;
	Элементы.ТипЗначения.ТолькоПросмотр = Объект.Предопределенный;

КонецПроцедуры // УстановитьВидимость()

#КонецОбласти

