#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Задача", Задача);
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");
	ЭлементОтбора.Использование  = Истина;
	ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Задача;
	
	Если ТипЗнч(Задача) = Тип("БизнесПроцессСсылка.бит_уп_Процесс") Тогда
	
		ЭтаФорма.Заголовок = НСтр("ru = 'История изменения состояний процесса'");
		Элементы.Задача.Заголовок = НСтр("ru = 'Процесс'");
		
	Иначе
		
		ЭтаФорма.Заголовок = НСтр("ru = 'История изменения состояний задачи'");
		Элементы.Задача.Заголовок = НСтр("ru = 'Задача'");		
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
КонецПроцедуры

#КонецОбласти




