#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияНачалоСобытия(Отказ, ЭтотОбъект.ДополнительныеСвойства);
	
	Если Не ЭтоНовый() И Не ПометкаУдаления=Ссылка.ПометкаУдаления Тогда
		// В случае установки или снятия пометки удаления не производить проверку.
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЭтоГруппа Тогда
	
		Если Получатели.Количество() = 0 Тогда
		
			ТекстСообщения = НСтр("ru = 'Не указаны получатели!'");
		    бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения,,"Объект.Получатели");
		
		КонецЕсли; 
	
	КонецЕсли; 
		
КонецПроцедуры // ПередЗаписью()
	
Процедура ПриЗаписи(Отказ)
		
	Если ОбменДанными.Загрузка Тогда
		// В случае выполнения обмена данными не производить проверку.
		Возврат;			
	КонецЕсли; 
		
	бит_ук_СлужебныйСервер.РегистрацияПриЗаписи(Отказ, ЭтотОбъект.ДополнительныеСвойства, Метаданные().ПолноеИмя());
		
КонецПроцедуры // ПриЗаписи()	
	
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция получает настройки построителя.
// 
// Возвращаемое значение:
//  СтруктураНастроек - Структура.
// 
Функция ПолучитьНастройкиКомпоновщика() Экспорт
	
	СтруктураНастроек = НастройкиКомпоновщика.Получить();
	
	Если НЕ ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
	
		СтруктураНастроек = Новый Структура;
	
	КонецЕсли; 	
	
	Возврат СтруктураНастроек;
	
КонецФункции // ПолучитьНастройки()

// Процедура сохраняет настройки построителя.
// 
// Параметры:
//  СтруктураНастроек - Структура.
// 
Процедура СохранитьНастройкиКомпоновщика(СтруктураНастроек)  Экспорт
	
	НастройкиКомпоновщика = Новый ХранилищеЗначения(СтруктураНастроек);
	
КонецПроцедуры // СохранитьНастройки()

// Функция создает схему компоновки данных по тексту запроса.
// 
// Параметры:
// ТекстЗапроса - Строка
// ИмяНабораДанных - Строка
// 
// Возвращаемое значение:
//  СКД - СхемаКомпоновкиДанных.
// 
Функция СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса) Экспорт
	
	СКД = Новый СхемаКомпоновкиДанных;
	
	ИсточникДанных = СКД.ИсточникиДанных.Добавить();
	ИсточникДанных.Имя 				  = "ИсточникДанных";
	ИсточникДанных.ТипИсточникаДанных = "local";
	
	НаборДанных = СКД.НаборыДанных.Добавить(Тип("НаборДанныхЗапросСхемыКомпоновкиДанных"));
	НаборДанных.Имя 						 = "НаборДанныхОсновной"; 
	НаборДанных.ИсточникДанных 				 = "ИсточникДанных";
	НаборДанных.Запрос 						 = ТекстЗапроса;
	НаборДанных.АвтоЗаполнениеДоступныхПолей = Истина;
	
	Построитель = Новый ПостроительЗапроса;
	Построитель.Текст = ТекстЗапроса;
	Построитель.ЗаполнитьНастройки();
	
	
	Для каждого ПолеПостроителя Из Построитель.ДоступныеПоля Цикл
		
		ПолеКомпоновки = НаборДанных.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		ПолеКомпоновки.Поле = ПолеПостроителя.Имя;
		ПолеКомпоновки.ПутьКДанным = ПолеПостроителя.ПутьКДанным;
		ПолеКомпоновки.ОграничениеИспользованияРеквизитов.Порядок = Истина;
		ПолеКомпоновки.Заголовок = ?(ПолеПостроителя.Представление = "Ссылка", "Измерение", ПолеПостроителя.Представление);
		ПолеКомпоновки.Роль.Обязательное = Истина;
		
		Если ПолеПостроителя.Отбор Тогда
			
			ВыбранноеПоле = СКД.НастройкиПоУмолчанию.Выбор.Элементы.Добавить(Тип("ВыбранноеПолеКомпоновкиДанных"));
			ВыбранноеПоле.Поле = Новый ПолеКомпоновкиДанных(ПолеПостроителя.Имя);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	ГруппировкаКомпоновки = СКД.НастройкиПоУмолчанию.Структура.Добавить(Тип("ГруппировкаКомпоновкиДанных"));
	ВыбранноеПоле         = ГруппировкаКомпоновки.Выбор.Элементы.Добавить(Тип("АвтовыбранноеПолеКомпоновкиДанных"));
	ВыбранноеПоле.Использование = Истина;
	
		
	Возврат СКД
	
КонецФункции // СоздатьСхемуКомпоновкиПоЗапросу()

// Процедура инициализирует компоновщик, используемый для фильтрации структуры дерева.
// 
Процедура ИнициализироватьКомпоновщик(ВидСобытия, Компоновщик) Экспорт
	
	АдресКомпоновки = "";
	УникальныйИдентификатор = Новый УникальныйИдентификатор;
	
	Если бит_ОбщегоНазначения.ЭтоСемействоБП() Тогда
		
		Если ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуНачислений Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикНачислений КАК бит_ДополнительныеУсловияПоДоговоруГрафикНачислений";
			
		ИначеЕсли ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.НапоминанияПоГрафикуПлатежей Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	*
			|ИЗ
			|	Документ.бит_ДополнительныеУсловияПоДоговору.ГрафикПлатежей КАК бит_ДополнительныеУсловияПоДоговоруГрафикПлатежей";
			
		Иначе
			
			ТекстЗапроса = 
			"ВЫБРАТЬ *
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов";
			
		КонецЕсли;
		
	ИначеЕсли бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда	
		
		Если ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ОкончаниеСрокаДействияДоговора Тогда
			
			ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Ссылка,
			|	ДоговорыКонтрагентов.ВерсияДанных,
			|	ДоговорыКонтрагентов.ПометкаУдаления,
			|	ДоговорыКонтрагентов.Наименование,
			|	ДоговорыКонтрагентов.БанковскийСчет,
			|	ДоговорыКонтрагентов.бит_ДержательДоговора,
			|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента,
			|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов,
			|	ДоговорыКонтрагентов.Комментарий,
			|	ДоговорыКонтрагентов.ДатаНачалаДействия,
			|	ДоговорыКонтрагентов.ДатаОкончанияДействия,
			|	ДоговорыКонтрагентов.Организация,
			|	ДоговорыКонтрагентов.Контрагент,
			|	ДоговорыКонтрагентов.Менеджер КАК Ответственный,
			|	ДоговорыКонтрагентов.НаименованиеДляПечати,
			|	ДоговорыКонтрагентов.УчетАгентскогоНДС,
			|	ДоговорыКонтрагентов.ВидАгентскогоДоговора,
			|	ДоговорыКонтрагентов.Дата,
			|	ДоговорыКонтрагентов.Номер,
			|	ДоговорыКонтрагентов.Партнер,
			|	ДоговорыКонтрагентов.Подразделение,
			|	ДоговорыКонтрагентов.ПорядокОплаты,
			|	ДоговорыКонтрагентов.ПорядокРасчетов,
			|	ДоговорыКонтрагентов.Согласован,
			|	ДоговорыКонтрагентов.Статус,
			|	ДоговорыКонтрагентов.ХозяйственнаяОперация,
			|	ДоговорыКонтрагентов.ТипДоговора,
			|	ДоговорыКонтрагентов.ОграничиватьСуммуЗадолженности,
			|	ДоговорыКонтрагентов.ДопустимаяСуммаЗадолженности,
			|	ДоговорыКонтрагентов.ГруппаФинансовогоУчета,
			|	ДоговорыКонтрагентов.ЗапрещаетсяПросроченнаяЗадолженность,
			|	ДоговорыКонтрагентов.КонтактноеЛицо,
			|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств,
			|	ДоговорыКонтрагентов.ИдентификаторПлатежа,
			|	ДоговорыКонтрагентов.ИспользуетсяПриОбменеДанными,
			|	ДоговорыКонтрагентов.бит_СостояниеДоговора,
			|	ДоговорыКонтрагентов.бит_ПредметДоговора,
			|	ДоговорыКонтрагентов.бит_ОписаниеРабот,
			|	ДоговорыКонтрагентов.бит_ОсновнаяСтатьяОборотов,
			|	ДоговорыКонтрагентов.бит_ОсновнаяСтатьяОборотовБДР,
			|	ДоговорыКонтрагентов.бит_ЦФО,
			|	ДоговорыКонтрагентов.бит_Проект,
			|	ДоговорыКонтрагентов.бит_СуммаДоговора,
			|	ДоговорыКонтрагентов.бит_ТипДоговора,
			|	ДоговорыКонтрагентов.бит_НаправлениеДоговора,
			|	ДоговорыКонтрагентов.бит_ПодразделениеОрганизации,
			|	ДоговорыКонтрагентов.бит_СпособРасчетаФинПлатежей,
			|	ДоговорыКонтрагентов.бит_ВысокийПриоритетПриЗаполненииАналитик,
			|	ДоговорыКонтрагентов.бит_СтадияДоговора,
			|	ДоговорыКонтрагентов.бит_ВключатьВРеестрДоговоров,
			|	ДоговорыКонтрагентов.бит_КурсВзаиморасчетов,
			|	ДоговорыКонтрагентов.бит_КратностьВзаиморасчетов,
			|	ДоговорыКонтрагентов.бит_СтавкаНДС,
			|	ДоговорыКонтрагентов.бит_СуммаНДСВзаиморасчеты,
			|	ДоговорыКонтрагентов.ДополнительныеРеквизиты.(
			|		Ссылка,
			|		НомерСтроки,
			|		Свойство,
			|		Значение,
			|		ТекстоваяСтрока
			|	),
			|	ДоговорыКонтрагентов.бит_СтатьиОборотов.(
			|		Ссылка,
			|		НомерСтроки,
			|		РасходДоход,
			|		СтатьяОборотов
			|	),
			|	ДоговорыКонтрагентов.Предопределенный,
			|	ДоговорыКонтрагентов.ИмяПредопределенныхДанных,
			|	NULL КАК БанковскийСчетПолучателя,
			|	NULL КАК ОрганизацияПолучатель,
			|	NULL КАК СтатьяДвиженияДенежныхСредствПолучателя,
			|	NULL КАК НаправлениеДеятельности,
			|	NULL КАК УстановленСрокОплаты,
			|	NULL КАК СрокОплаты,
			|	NULL КАК СтавкаНДС,
			|	NULL КАК ДоговорСУчастникомГОЗ,
			|	NULL КАК ГосударственныйКонтракт,
			|	NULL КАК ПлатежиПо275ФЗ,
			|	NULL КАК ТипПлатежаФЗ275,
			|	NULL КАК ПроцентОплатыЗаСчетСобственныхСредств,
			|	NULL КАК РаспределениеОплатПоБанковскимСчетам,
			|	NULL КАК СуммаПрибыли,
			|	NULL КАК Сумма,
			|	ПУСТАЯТАБЛИЦА.( КАК Ссылка,  КАК НомерСтроки,  КАК СтатьяКалькуляции,  КАК Сумма,  КАК СуммаКВозмещению) КАК КалькуляцияЗатрат,
			|	ПУСТАЯТАБЛИЦА.( КАК Ссылка,  КАК НомерСтроки,  КАК ДоговорСЗаказчиком,  КАК Процент) КАК ДоговорыСЗаказчиками,
			|	ПУСТАЯТАБЛИЦА.( КАК Ссылка,  КАК НомерСтроки,  КАК ВидДокумента,  КАК Номер,  КАК Дата,  КАК Сумма,  КАК Файл) КАК ПодтверждающиеДокументы
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоговорыКредитовИДепозитов.Ссылка,
			|	ДоговорыКредитовИДепозитов.ВерсияДанных,
			|	ДоговорыКредитовИДепозитов.ПометкаУдаления,
			|	ДоговорыКредитовИДепозитов.Наименование,
			|	ДоговорыКредитовИДепозитов.БанковскийСчет,
			|	ДоговорыКредитовИДепозитов.бит_ДержательДоговора,
			|	ДоговорыКредитовИДепозитов.БанковскийСчетКонтрагента,
			|	ДоговорыКредитовИДепозитов.ВалютаВзаиморасчетов,
			|	ДоговорыКредитовИДепозитов.Комментарий,
			|	ДоговорыКредитовИДепозитов.ДатаПервогоТранша,
			|	ДоговорыКредитовИДепозитов.ДатаПоследнегоПлатежа,
			|	ДоговорыКредитовИДепозитов.Организация,
			|	ДоговорыКредитовИДепозитов.Контрагент,
			|	ДоговорыКредитовИДепозитов.Ответственный,
			|	ДоговорыКредитовИДепозитов.НаименованиеДляПечати,
			|	NULL,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.Дата,
			|	ДоговорыКредитовИДепозитов.Номер,
			|	ДоговорыКредитовИДепозитов.Партнер,
			|	ДоговорыКредитовИДепозитов.Подразделение,
			|	ДоговорыКредитовИДепозитов.ПорядокОплаты,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.Согласован,
			|	ДоговорыКредитовИДепозитов.Статус,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.ТипДоговора,
			|	NULL,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.ГруппаФинансовогоУчета,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.бит_СостояниеДоговора,
			|	ДоговорыКредитовИДепозитов.бит_ПредметДоговора,
			|	ДоговорыКредитовИДепозитов.бит_ОписаниеРабот,
			|	ДоговорыКредитовИДепозитов.бит_ОсновнаяСтатьяОборотов,
			|	ДоговорыКредитовИДепозитов.бит_ОсновнаяСтатьяОборотовБДР,
			|	ДоговорыКредитовИДепозитов.бит_ЦФО,
			|	ДоговорыКредитовИДепозитов.бит_Проект,
			|	ДоговорыКредитовИДепозитов.бит_СуммаДоговора,
			|	ДоговорыКредитовИДепозитов.бит_ТипДоговора,
			|	ДоговорыКредитовИДепозитов.бит_НаправлениеДоговора,
			|	ДоговорыКредитовИДепозитов.бит_ПодразделениеОрганизации,
			|	ДоговорыКредитовИДепозитов.бит_СпособРасчетаФинПлатежей,
			|	ДоговорыКредитовИДепозитов.бит_ВысокийПриоритетПриЗаполненииАналитик,
			|	NULL,
			|	ДоговорыКредитовИДепозитов.бит_ВключатьВРеестрДоговоров,
			|	ДоговорыКредитовИДепозитов.бит_КурсВзаиморасчетов,
			|	ДоговорыКредитовИДепозитов.бит_КратностьВзаиморасчетов,
			|	ДоговорыКредитовИДепозитов.бит_СтавкаНДС,
			|	ДоговорыКредитовИДепозитов.бит_СуммаНДСВзаиморасчеты,
			|	ДоговорыКредитовИДепозитов.ДополнительныеРеквизиты.(
			|		Ссылка,
			|		НомерСтроки,
			|		Свойство,
			|		Значение,
			|		ТекстоваяСтрока
			|	),
			|	ДоговорыКредитовИДепозитов.бит_СтатьиОборотов.(
			|		Ссылка,
			|		НомерСтроки,
			|		РасходДоход,
			|		СтатьяОборотов
			|	),
			|	ДоговорыКредитовИДепозитов.Предопределенный,
			|	ДоговорыКредитовИДепозитов.ИмяПредопределенныхДанных,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ПУСТАЯТАБЛИЦА.(, , , , ),
			|	ПУСТАЯТАБЛИЦА.(, , , ),
			|	ПУСТАЯТАБЛИЦА.(, , , , , , )
			|ИЗ
			|	Справочник.ДоговорыКредитовИДепозитов КАК ДоговорыКредитовИДепозитов
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоговорыЛизинга.Ссылка,
			|	ДоговорыЛизинга.ВерсияДанных,
			|	ДоговорыЛизинга.ПометкаУдаления,
			|	ДоговорыЛизинга.Наименование,
			|	ДоговорыЛизинга.БанковскийСчет,
			|	ДоговорыЛизинга.бит_ДержательДоговора,
			|	ДоговорыЛизинга.БанковскийСчетКонтрагента,
			|	ДоговорыЛизинга.ВалютаВзаиморасчетов,
			|	ДоговорыЛизинга.Комментарий,
			|	ДоговорыЛизинга.ДатаНачалаДействия,
			|	ДоговорыЛизинга.ДатаОкончанияДействия,
			|	ДоговорыЛизинга.Организация,
			|	ДоговорыЛизинга.Контрагент,
			|	ДоговорыЛизинга.Ответственный,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДоговорыЛизинга.Дата,
			|	ДоговорыЛизинга.Номер,
			|	ДоговорыЛизинга.Партнер,
			|	ДоговорыЛизинга.Подразделение,
			|	ДоговорыЛизинга.ПорядокОплаты,
			|	NULL,
			|	ДоговорыЛизинга.Согласован,
			|	ДоговорыЛизинга.Статус,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДоговорыЛизинга.КонтактноеЛицо,
			|	ДоговорыЛизинга.СтатьяДвиженияДенежныхСредств,
			|	NULL,
			|	NULL,
			|	ДоговорыЛизинга.бит_СостояниеДоговора,
			|	ДоговорыЛизинга.бит_ПредметДоговора,
			|	ДоговорыЛизинга.бит_ОписаниеРабот,
			|	ДоговорыЛизинга.бит_ОсновнаяСтатьяОборотов,
			|	ДоговорыЛизинга.бит_ОсновнаяСтатьяОборотовБДР,
			|	ДоговорыЛизинга.бит_ЦФО,
			|	ДоговорыЛизинга.бит_Проект,
			|	ДоговорыЛизинга.бит_СуммаДоговора,
			|	ДоговорыЛизинга.бит_ТипДоговора,
			|	ДоговорыЛизинга.бит_НаправлениеДоговора,
			|	ДоговорыЛизинга.бит_ПодразделениеОрганизации,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДоговорыЛизинга.бит_КурсВзаиморасчетов,
			|	ДоговорыЛизинга.бит_КратностьВзаиморасчетов,
			|	ДоговорыЛизинга.бит_СтавкаНДС,
			|	ДоговорыЛизинга.бит_СуммаНДСВзаиморасчеты,
			|	ДоговорыЛизинга.ДополнительныеРеквизиты.(
			|		Ссылка,
			|		НомерСтроки,
			|		Свойство,
			|		Значение,
			|		ТекстоваяСтрока
			|	),
			|	ДоговорыЛизинга.бит_СтатьиОборотов.(
			|		Ссылка,
			|		НомерСтроки,
			|		РасходДоход,
			|		СтатьяОборотов
			|	),
			|	ДоговорыЛизинга.Предопределенный,
			|	ДоговорыЛизинга.ИмяПредопределенныхДанных,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ПУСТАЯТАБЛИЦА.(, , , , ),
			|	ПУСТАЯТАБЛИЦА.(, , , ),
			|	ПУСТАЯТАБЛИЦА.(, , , , , , )
			|ИЗ
			|	Справочник.ДоговорыЛизинга КАК ДоговорыЛизинга
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДоговорыМеждуОрганизациями.Ссылка,
			|	ДоговорыМеждуОрганизациями.ВерсияДанных,
			|	ДоговорыМеждуОрганизациями.ПометкаУдаления,
			|	ДоговорыМеждуОрганизациями.Наименование,
			|	ДоговорыМеждуОрганизациями.БанковскийСчет,
			|	NULL,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.ВалютаВзаиморасчетов,
			|	ДоговорыМеждуОрганизациями.Комментарий,
			|	ДоговорыМеждуОрганизациями.ДатаНачалаДействия,
			|	ДоговорыМеждуОрганизациями.ДатаОкончанияДействия,
			|	ДоговорыМеждуОрганизациями.Организация,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.Менеджер,
			|	ДоговорыМеждуОрганизациями.НаименованиеДляПечати,
			|	NULL,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.Дата,
			|	ДоговорыМеждуОрганизациями.Номер,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.Подразделение,
			|	ДоговорыМеждуОрганизациями.ПорядокОплаты,
			|	ДоговорыМеждуОрганизациями.ПорядокРасчетов,
			|	ДоговорыМеждуОрганизациями.Согласован,
			|	ДоговорыМеждуОрганизациями.Статус,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.ТипДоговора,
			|	NULL,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.ГруппаФинансовогоУчета,
			|	NULL,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.СтатьяДвиженияДенежныхСредств,
			|	ДоговорыМеждуОрганизациями.ИдентификаторПлатежа,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	NULL,
			|	ДоговорыМеждуОрганизациями.ДополнительныеРеквизиты.(
			|		Ссылка,
			|		НомерСтроки,
			|		Свойство,
			|		Значение,
			|		ТекстоваяСтрока
			|	),
			|	ПУСТАЯТАБЛИЦА.(, , , ),
			|	ДоговорыМеждуОрганизациями.Предопределенный,
			|	ДоговорыМеждуОрганизациями.ИмяПредопределенныхДанных,
			|	ДоговорыМеждуОрганизациями.БанковскийСчетПолучателя,
			|	ДоговорыМеждуОрганизациями.ОрганизацияПолучатель,
			|	ДоговорыМеждуОрганизациями.СтатьяДвиженияДенежныхСредствПолучателя,
			|	ДоговорыМеждуОрганизациями.НаправлениеДеятельности,
			|	ДоговорыМеждуОрганизациями.УстановленСрокОплаты,
			|	ДоговорыМеждуОрганизациями.СрокОплаты,
			|	ДоговорыМеждуОрганизациями.СтавкаНДС,
			|	ДоговорыМеждуОрганизациями.ДоговорСУчастникомГОЗ,
			|	ДоговорыМеждуОрганизациями.ГосударственныйКонтракт,
			|	ДоговорыМеждуОрганизациями.ПлатежиПо275ФЗ,
			|	ДоговорыМеждуОрганизациями.ТипПлатежаФЗ275,
			|	ДоговорыМеждуОрганизациями.ПроцентОплатыЗаСчетСобственныхСредств,
			|	ДоговорыМеждуОрганизациями.РаспределениеОплатПоБанковскимСчетам,
			|	ДоговорыМеждуОрганизациями.СуммаПрибыли,
			|	ДоговорыМеждуОрганизациями.Сумма,
			|	ДоговорыМеждуОрганизациями.КалькуляцияЗатрат.(
			|		Ссылка,
			|		НомерСтроки,
			|		СтатьяКалькуляции,
			|		Сумма,
			|		СуммаКВозмещению
			|	),
			|	ДоговорыМеждуОрганизациями.ДоговорыСЗаказчиками.(
			|		Ссылка,
			|		НомерСтроки,
			|		ДоговорСЗаказчиком,
			|		Процент
			|	),
			|	ДоговорыМеждуОрганизациями.ПодтверждающиеДокументы.(
			|		Ссылка,
			|		НомерСтроки,
			|		ВидДокумента,
			|		Номер,
			|		Дата,
			|		Сумма,
			|		Файл
			|	)
			|ИЗ
			|	Справочник.ДоговорыМеждуОрганизациями КАК ДоговорыМеждуОрганизациями";
			
		КонецЕсли;
		
	КонецЕсли; 
	
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		// Создаем СКД по запросу
		СКД = бит_МеханизмПолученияДанных.СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		// СКД = СоздатьСхемуКомпоновкиПоЗапросу(ТекстЗапроса);
		
		АдресКомпоновки = ПоместитьВоВременноеХранилище(СКД, УникальныйИдентификатор);		
		
		// Инициализируем компоновщик
		ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресКомпоновки);
		Попытка
			
			Компоновщик.Инициализировать(ИсточникНастроек);
			
		Исключение
			
			ТекстСообщения =  НСтр("ru = 'Не удалось инициализировать компоновщик для отбора! Попробуйте обновить текст запроса. Описание ошибки: %1%.'");
			ТекстСообщения = бит_ОбщегоНазначенияКлиентСервер.ПодставитьПараметрыСтроки(ТекстСообщения, ОписаниеОшибки());
			бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли; 
	
КонецПроцедуры // ИнициализироватьКомпоновщик()

#КонецОбласти

#КонецЕсли
