//ОКЕЙ Назаренко Д.В. (СофтЛаб) Начало 2021-01-19 (#3997) 

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("РежимВыбораТекущихДанных") И Параметры.РежимВыбораТекущихДанных Тогда
		РежимВыбораТекущихДанных = Параметры.РежимВыбораТекущихДанных;
		Элементы.Список.РежимВыбора = РежимВыбораТекущихДанных;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если РежимВыбораТекущихДанных Тогда
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Видимость = Ложь;
		ЭтаФорма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбратьПодмена.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
// Код процедур и функций
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если РежимВыбораТекущихДанных Тогда
		Закрыть(Элементы.Список.ТекущиеДанные);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьПодмена(Команда)
	Закрыть(Элементы.Список.ТекущиеДанные);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// Код процедур и функций
#КонецОбласти

//ОКЕЙ Назаренко Д.В. (СофтЛаб) Конец 2021-01-19 (#3997) 