
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	
	
	// Вызов механизма защиты
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьВидимость();
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура управляет видимостью элементов формы.
// 
&НаСервере
Процедура УстановитьВидимость()

	ЭтоВнешний = ?(Объект.РасположениеДанных = Перечисления.бит_мпд_ВидыРасположенияДанных.ВнешняяИнформационнаяБаза,Истина,Ложь);
	
	Элементы.НастройкаПодключенияПоУмолчанию.Видимость = ЭтоВнешний;

КонецПроцедуры // УстановитьВидимость()

#КонецОбласти