#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОписаниеПеременных

Перем мНастройкиИзмерений Экспорт; // Хранит настройки дополнительных измерений.

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Отчеты.бит_ПлатежныйКалендарь.ПараметрыНаФорме();
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек,
			ЭтотОбъект[ЭлементСписка.Значение], ЭлементСписка.Значение);
	КонецЦикла;  	

	КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(
		"ВалютаУпр", Константы.бит_ВалютаУправленческогоУчета.Получить());

	//ОбщегоНазначения.ЗначениеВСтрокуXML(ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных"));
	//ОбщегоНазначения.ЗначениеВСтрокуXML(КомпоновщикНастроек.ПолучитьНастройки();

КонецПроцедуры // ПриКомпоновкеРезультата()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Период.ДатаНачала < НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя()) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,"КОРРЕКТНОСТЬ", Нстр("ru = 'Начало периода'"),,,
			Нстр("ru = 'Отчет не предназначен для анализа прошедших периодов.'"));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, , "Отчет.Период.ДатаНачала", ,Отказ); 
	КонецЕсли; 

	бит_ОтчетыСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Инициализация

мНастройкиИзмерений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_НастройкиДополнительныхИзмерений");

бит_МеханизмДопИзмерений.СформироватьЗаголовкиПолейДополнительныхИзмеренийВСКД(СхемаКомпоновкиДанных, 
					"НаборДанных1", 
					мНастройкиИзмерений);


#КонецОбласти

#КонецЕсли
