&НаКлиенте
Процедура СообщитьПользователю(сообщение);
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(сообщение);
КонецПроцедуры

&НаСервере 
Процедура ВыполнитьПроцедуруМодуля(имяПроцедуры)	
	ДокументОбъект = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.ОК_СписаниеКорректировокНаСтоимостьЗапасов"));
	Выполнить("ДокументОбъект."+имяПроцедуры);
	ЗначениеВДанныеФормы(ДокументОбъект,Объект);
	Модифицированность=Истина;   
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТаблицуНаСервере()
	Результат=Новый Структура();
	ВыполнитьПроцедуруМодуля("ЗаполнитьТаблицу()");
	Результат.Вставить("КоличествоСтрок",Объект.Таблица.Количество());
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьТаблицу(Команда)
	Результат=ЗаполнитьТаблицуНаСервере();
	
	Если Результат.КоличествоСтрок=0 Тогда  
		СообщитьПользователю("Данных нет");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	ПараметрыВыбора_ = Новый Структура("ДатаНач,ДатаКон", Объект.ДатаНач, Объект.ДатаКон);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора_, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
КонецПроцедуры 

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.Период = рс_ОбщийМодуль.ПолучитьМесяцНачисленияПоДате(Объект.Дата);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНовыйДокумент()
	рс_ОбщийМодуль.ЗаполнитьШапкуДокумента(Объект, Объект.Ссылка.Метаданные(), ПользователиКлиентСервер.ТекущийПользователь());
	Объект.бит_БК_ЦФО=Справочники.Подразделения.НайтиПоНаименованию("IFRS Adjustment");
	Объект.Дата=КонецМесяца(ТекущаяДата());
	Объект.ВидДвиженияМСФО=Перечисления.БИТ_ВидыДвиженияМСФО.КорректировкаМСФО;
	Объект.Период=рс_ОбщийМодуль.ПолучитьМесяцНачисленияПоДате(Объект.Дата);
	Модифицированность = Истина;
КонецПроцедуры

// 1c-izhtc ChuckNorris 09.09.2015 ( 
&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	Если РезультатВыбора = Неопределено Тогда Возврат; КонецЕсли;
	Объект.ДатаНач = РезультатВыбора.НачалоПериода;
	Объект.ДатаКон = РезультатВыбора.КонецПериода;
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеДокумента()
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	Если Параметры.Ключ.Пустая() Тогда
		УстановитьСостояниеДокумента();
		ЗаполнитьНовыйДокумент();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	УстановитьСостояниеДокумента();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	УстановитьСостояниеДокумента();
КонецПроцедуры
// 1c-izhtc ChuckNorris 09.09.2015 ) 