
#Область ОбработчикиСобытий

// Процедура - действие команды "СоздатьДокументыЗатрат".
// 
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОчиститьСообщения();
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокДокументов = СоздатьДокументыЗатрат(ПараметрКоманды);
	
	Для Каждого Док Из СписокДокументов Цикл
		ПоказатьЗначение(,Док);		
	КонецЦикла;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура вызывает необходимый метод менеджера для создания документов затрат.
// 
// Параметры:
// 	ДокЗаявка - ДокументСсылка.бит_ЗаявкаНаЗатраты - документ
//  , на основании расходных позиций которого создаются документы.
//
&НаСервере
Функция  СоздатьДокументыЗатрат(ДокЗаявка)
	
	СписокДокументов = Документы.бит_ЗаявкаНаЗатраты.СоздатьДокументыЗатратПоЗаявке(ДокЗаявка);
	Возврат СписокДокументов;
	
КонецФункции

#КонецОбласти

