
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	 ПараметрыФормы = Новый Структура;
	 ПараметрыФормы.Вставить("Процесс", ПараметрКоманды);
	 
	 ОткрытьФорму("Отчет.бит_ОтчетСтатусПроцесса.Форма"
	               , ПараметрыФормы
				   , ПараметрыВыполненияКоманды.Источник
				   , ПараметрыВыполненияКоманды.Уникальность
				   , ПараметрыВыполненияКоманды.Окно);
	
	
КонецПроцедуры

#КонецОбласти