
#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// НастройкиПрограммыКлиент.ОткрытьПанельНастроек(ПараметрыВыполненияКоманды, "НастройкиРаботыСФайлами");
	КраткоеИмяФормы = "НастройкиРаботыСФайлами";
	
	ПолноеИмяФормы = "Обработка.бит_НастройкиРаботыСФайлами.Форма." + КраткоеИмяФормы;
	
	ФормаПараметры = Новый Структура("ТекущийРаздел", КраткоеИмяФормы);
	
	ФормаВладелец     = ПараметрыВыполненияКоманды.Источник;
	ФормаУникальность = ПолноеИмяФормы;
	ФормаОкно         = ПараметрыВыполненияКоманды.Окно;
	Если ФормаОкно = Неопределено Тогда
		ФормаУникальность = ФормаУникальность + ".ОтдельноеОкно";
	КонецЕсли;
	
	ОткрытьФорму(ПолноеИмяФормы, ФормаПараметры, ФормаВладелец, ФормаУникальность, ФормаОкно);
	
КонецПроцедуры

#КонецОбласти

