
#Область ОбработчикиСобытийФормы
     
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	МетаданныеОбъекта = Метаданные.РегистрыСведений.бит_НастройкиПрограммы;
	
	// Вызов механизма защиты
		
	
	бит_РаботаСДиалогамиСервер.ФормаСпискаРегистраПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект);
	
	Если фОтказ Тогда
		Возврат;
	КонецЕсли;
	
	РедактироватьГруппуНастроек = Истина;
	
КонецПроцедуры // ПриСозданииНаСервере()
           
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда
		Отказ = Истина;
		Возврат;	
	КонецЕсли;
	
	Элементы.ФормаРедактироватьЗаписьГруппуЗаписей.Пометка = РедактироватьГруппуНастроек;
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если РедактироватьГруппуНастроек Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		ОткрытьФормуРедактированияГруппыНастроек(ТекущиеДанные);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если РедактироватьГруппуНастроек
		И НЕ Копирование Тогда
		
		Отказ = Истина;
		
		ОткрытьФормуРедактированияГруппыНастроек();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	Если РедактироватьГруппуНастроек Тогда
		
		Отказ = Истина;
		
		ТекущиеДанные = Элементы.Список.ТекущиеДанные;
		
		ОткрытьФормуРедактированияГруппыНастроек(ТекущиеДанные);
		
	КонецЕсли;	
	
КонецПроцедуры
 
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РедактироватьЗаписьГруппуЗаписей(Команда)
	
	РедактироватьГруппуНастроек = НЕ РедактироватьГруппуНастроек;
	
	Элементы.ФормаРедактироватьЗаписьГруппуЗаписей.Пометка = РедактироватьГруппуНастроек;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура открывает форму редактирования группы настроек в дереве.
// 
// Параметры:
// 	ТекущиеДанные - строка таблицы - источник параметров для открываемой формы.
// 
&НаКлиенте
Процедура ОткрытьФормуРедактированияГруппыНастроек(ТекущиеДанные = Неопределено)
	
	ПараметрыФормы = Новый Структура;
	
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы.Вставить("Период", ТекущаяДата());
	Иначе
		ПараметрыФормы.Вставить("Период"				  , ТекущиеДанные.Период);
		ПараметрыФормы.Вставить("СтруктурноеПодразделение", ТекущиеДанные.СтруктурноеПодразделение);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.бит_НастройкиПрограммы.Форма.ФормаРедактированияНастроекУправляемая",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);
	
КонецПроцедуры // ОткрытьФормуРедактированияГруппыНастроек()

#КонецОбласти

