#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.КодОперацииПрослеживаемости) Тогда
		КодОперацииПрослеживаемости = Параметры.КодОперацииПрослеживаемости;
		Элементы.НадписьКодОперацииПрослеживаемости.Заголовок = КодОперацииПрослеживаемостиНаименованиеНаСервере();
	КонецЕсли;
	
	ЗаполнитьСписокВыбораКодаОперацииПрослеживаемости();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ПеренестиВДокумент Тогда
		ОповеститьОВыборе(КодОперацииПрослеживаемости);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы И Модифицированность Тогда
		
		Отказ = Истина;
	
	ИначеЕсли Модифицированность И Не ПеренестиВДокумент Тогда
		
		Отказ = Истина;
		
		Оповещение = Новый ОписаниеОповещения("ВопросСохраненияДанныхЗавершение", ЭтотОбъект);
		ТекстВопроса = НСтр("ru = 'Данные были изменены. Сохранить изменения?'");
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
		
	ИначеЕсли ПеренестиВДокумент Тогда
		
		ОбработкаПроверкиЗаполненияНаКлиенте(Отказ);
		Если Отказ Тогда
			Модифицированность = Истина;
			ПеренестиВДокумент = Ложь;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура КодОперацииПрослеживаемостиПриИзменении(Элемент)
	Модифицированность = Истина;
	Элементы.НадписьКодОперацииПрослеживаемости.Заголовок = КодОперацииПрослеживаемостиНаименованиеНаСервере();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ПеренестиВДокумент = Истина;
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Модифицированность = Ложь;
	ПеренестиВДокумент = Ложь;
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере 
Процедура ЗаполнитьСписокВыбораКодаОперацииПрослеживаемости()
	
	Элементы.КодОперацииПрослеживаемости.СписокВыбора.Очистить();
	
	МассивКодов = Новый Массив();
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.ПередачаВПроизводство);
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.ЗахоронениеОбезвреживаниеУтилизацияТовара);
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.УничтожениеУтратаВследствиеДействияНепреодолимойСилы);
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.КонфискацияГосударством);
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.НедостачаВыявленнаяВХодеИнвентаризации);
	МассивКодов.Добавить(Справочники.КодыОперацийПрослеживаемости.ПередачаНеСвязаннаяСРеализацией);
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КодыОперацийПрослеживаемости.Код + "" - "" + КодыОперацийПрослеживаемости.Наименование КАК Представление,
	|	КодыОперацийПрослеживаемости.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.КодыОперацийПрослеживаемости КАК КодыОперацийПрослеживаемости
	|ГДЕ
	|	КодыОперацийПрослеживаемости.Ссылка В(&МассивКодов)";
	Запрос.УстановитьПараметр("МассивКодов", МассивКодов);
	Результат = Запрос.Выполнить().Выгрузить();
	Индекс = 0;
	Для каждого СтрокаКода Из Результат Цикл
		Элементы.КодОперацииПрослеживаемости.СписокВыбора.Вставить(Индекс,СтрокаКода.Ссылка, СтрокаКода.Представление);
		Индекс = Индекс + 1;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПроверкиЗаполненияНаКлиенте(Отказ)

	Если Не ЗначениеЗаполнено(КодОперацииПрослеживаемости) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
			"Поле", "Заполнение", НСтр("ru = 'Причина списания в системе прослеживаемости'"));
		Поле = "КодОперацииПрослеживаемости";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, , Поле, "", Отказ);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция КодОперацииПрослеживаемостиНаименованиеНаСервере()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КодОперацииПрослеживаемости, "Наименование");
КонецФункции

&НаКлиенте
Процедура ВопросСохраненияДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Истина;
		Закрыть();
	ИначеЕсли Результат = КодВозвратаДиалога.Нет Тогда
		Модифицированность = Ложь;
		ПеренестиВДокумент = Ложь;
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
