// СофтБаланс Начало Кузнецова С. [15.01.2014] 
Перем ЭлементРасшифровки Экспорт;
// СофтБаланс Окончание Кузнецова С. [15.01.2014]
// СофтБаланс Начало Кузнецова С. [17.01.2014] 
Перем МассивПоказателейДляОтбора Экспорт;
// СофтБаланс Окончание Кузнецова С. [17.01.2014]

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	БухгалтерскиеОтчетыВызовСервера.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецЕсли

// СофтБаланс Начало Кузнецова С. [15.01.2014] 
ЭлементРасшифровки = "";
// СофтБаланс Окончание Кузнецова С. [15.01.2014]
// СофтБаланс Начало Кузнецова С. [17.01.2014] 
МассивПоказателейДляОтбора = Новый Массив; 
// СофтБаланс Окончание Кузнецова С. [17.01.2014]
