#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РедактируемыйДокументСсылка = Параметры.РедактируемыйДокументСсылка;
	Сотрудник = Параметры.Сотрудник;
	ИспользоватьЗамещение = Параметры.ИспользоватьЗамещение;
	Организация = Параметры.Организация;
	
	ДанныеИзВременногоХранилищаВДанныеФормы(Параметры.АдресВоВременномХранилище);
	
	УстановитьЗаголовокФормы();
	УстановитьВидимостьКолонок();
	УстановитьПараметрыВыбораЗаявлений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИзменениеДанныхФизическогоЛица" И Не ТолькоПросмотр Тогда 
		ЗаполнитьИзменившиесяДанныеФизическогоЛица(Параметр);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьИЗакрыть", ЭтотОбъект);
	ОбщегоНазначенияКлиент.ПоказатьПодтверждениеЗакрытияФормы(Оповещение, Отказ, ЗавершениеРаботы);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаявлениеОПродолженииПриИзменении(Элемент)
	
	ЗаявлениеПриИзмененииНаСервере("ЗаявлениеОПродолжении");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеОПредоставленииПриИзменении(Элемент)
	
	ЗаявлениеПриИзмененииНаСервере("ЗаявлениеОПредоставлении");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМероприятия

&НаКлиенте
Процедура МероприятияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.Мероприятия.ТекущиеДанные;
		ТекущиеДанные.Идентификатор = Строка(Новый УникальныйИдентификатор);
		ТекущиеДанные.СотрудникЗаписи = Сотрудник;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияПослеУдаления(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияВидМероприятияПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияДатаОтменыПриИзменении(Элемент)
	
	УстановитьВидимостьКолонок();
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияНаименованиеДокументаОснованияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияНаименованиеДокументаОснованияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаОбработкаВыбора(
		Элементы.Мероприятия.ТекущиеДанные.НаименованиеДокументаОснования, ВыбранноеЗначение, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура МероприятияНаименованиеДокументаОснованияАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	ЭлектронныеТрудовыеКнижкиКлиент.НаименованиеДокументаАвтоПодбор(
		Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	
	ВыбратьИЗакрыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();	
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьДанныеФизическогоЛица(Команда)
	
	ПараметрыФормы = Новый Структура("Ключ, АктивнаяСтраница, РедактируемоеПоле", Сотрудник, "ЛичныеДанные");
	ОткрытьФорму("Справочник.ФизическиеЛица.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДанныеИзВременногоХранилищаВДанныеФормы(АдресВоВременномХранилище)
	
	Модифицированность = Ложь;
	
	ДанныеДокументаПоСотруднику = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	
	Если ДанныеДокументаПоСотруднику = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не удалось получить редактируемые данные.'");	
	КонецЕсли;
	
	Сотрудник = ДанныеДокументаПоСотруднику.Сотрудник;
	Фамилия = ДанныеДокументаПоСотруднику.Фамилия;
	Имя = ДанныеДокументаПоСотруднику.Имя;
	Отчество = ДанныеДокументаПоСотруднику.Отчество;
	СтраховойНомерПФР = ДанныеДокументаПоСотруднику.СтраховойНомерПФР;
	ДатаРождения = ДанныеДокументаПоСотруднику.ДатаРождения;
	ЗаявлениеОПродолжении = ДанныеДокументаПоСотруднику.ЗаявлениеОПродолжении;
	ЗаявлениеОПредоставлении = ДанныеДокументаПоСотруднику.ЗаявлениеОПредоставлении;
	ЗаявлениеОПродолженииОтмена = ДанныеДокументаПоСотруднику.ЗаявлениеОПродолженииОтмена;
	ЗаявлениеОПредоставленииОтмена = ДанныеДокументаПоСотруднику.ЗаявлениеОПредоставленииОтмена;
	
	Мероприятия.Очистить();
	
	Для Каждого СтрокаТаблицы Из ДанныеДокументаПоСотруднику.Мероприятия Цикл
		СтрокаТаблицыФормы = Мероприятия.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТаблицыФормы, СтрокаТаблицы);
	КонецЦикла;	
	
	Мероприятия.Сортировать("ДатаМероприятия");
	
КонецПроцедуры	

&НаСервере
Процедура УстановитьЗаголовокФормы()
	
	Заголовок = НСтр("ru = 'Мероприятия'");
	ИнфонадписьЗаголовокКарточки = НСтр("ru = 'Данные застрахованного лица'");
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьИЗакрыть(Результат = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	АдресВоВременномХранилище = ДанныеСотрудникаВоВременноеХранилище();
	
	ПараметрыОповещения = Новый Структура("РедактируемыйДокументСсылка, Сотрудник, АдресВоВременномХранилище");
	ПараметрыОповещения.РедактируемыйДокументСсылка = РедактируемыйДокументСсылка;
	ПараметрыОповещения.Сотрудник = Сотрудник;
	ПараметрыОповещения.АдресВоВременномХранилище = АдресВоВременномХранилище;	
	
	Оповестить("РедактированиеМероприятийПоСотруднику", ПараметрыОповещения, ЭтаФорма);
	
	Модифицированность = Ложь;

	Закрыть();
	
КонецПроцедуры

&НаСервере 
Функция ДанныеСотрудникаВоВременноеХранилище()	
	
	ДанныеСотрудника = Новый Структура;
	ДанныеСотрудника.Вставить("Сотрудник", Сотрудник);
	ДанныеСотрудника.Вставить("СтраховойНомерПФР", СтраховойНомерПФР);
	ДанныеСотрудника.Вставить("Фамилия", Фамилия);
	ДанныеСотрудника.Вставить("Имя", Имя);
	ДанныеСотрудника.Вставить("Отчество", Отчество);
	ДанныеСотрудника.Вставить("ДатаРождения", ДатаРождения);
	ДанныеСотрудника.Вставить("ЗаявлениеОПродолжении", ЗаявлениеОПродолжении);
	ДанныеСотрудника.Вставить("ЗаявлениеОПредоставлении", ЗаявлениеОПредоставлении);
	ДанныеСотрудника.Вставить("ЗаявлениеОПродолженииОтмена", ЗаявлениеОПродолженииОтмена);
	ДанныеСотрудника.Вставить("ЗаявлениеОПредоставленииОтмена", ЗаявлениеОПредоставленииОтмена);
	ДанныеСотрудника.Вставить("Модифицированность", Модифицированность);
	ДанныеСотрудника.Вставить("РедактируемыйДокументСсылка", РедактируемыйДокументСсылка);
	ДанныеСотрудника.Вставить("ИзменилисьДанныеФизическогоЛица", ИзменилисьДанныеФизическогоЛица);
	
	СписокСвойств = ДоступныеПоляВсехВидовМероприятий();
	ДоступныеПоля = ДоступныеПоляВидовМероприятий();
	
	МероприятияСотрудника = Новый Массив;	
	ДанныеСотрудника.Вставить("Мероприятия", МероприятияСотрудника);
	
	СтруктураПолейМероприятия = Документы.СведенияОТрудовойДеятельностиРаботниковСЗВ_ТД.СтруктураПолейМероприятий();
	Для Каждого Мероприятие Из Мероприятия Цикл
		Если Не ЗначениеЗаполнено(Мероприятие.ВидМероприятия) Тогда
			Продолжить;
		КонецЕсли;
		СтруктураПолей = ОбщегоНазначения.СкопироватьРекурсивно(СтруктураПолейМероприятия);
		ЗаполнитьЗначенияСвойств(СтруктураПолей, Мероприятие, СписокСвойств + "," + ДоступныеПоля[Мероприятие.ВидМероприятия]);
		СтруктураПолей.Сотрудник = Сотрудник;
		МероприятияСотрудника.Добавить(СтруктураПолей);
	КонецЦикла;	
	
	Возврат ПоместитьВоВременноеХранилище(ДанныеСотрудника);
	
КонецФункции	

&НаКлиенте
Процедура ЗаполнитьИзменившиесяДанныеФизическогоЛица(ДанныеФизическогоЛица)	
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, ДанныеФизическогоЛица);
	ИзменилисьДанныеФизическогоЛица = Истина;
	
КонецПроцедуры	

&НаСервере 
Процедура УстановитьВидимостьКолонок()
	
	ДоступныеКолонки = СтрРазделить(ДоступныеПоляВсехВидовМероприятий(), ",");
	
	ДоступныеПоля = ДоступныеПоляВидовМероприятий();
	ВидыМероприятий = ОбщегоНазначения.ВыгрузитьКолонку(Мероприятия, "ВидМероприятия", Истина);
	Для Каждого ВидМероприятия Из ВидыМероприятий Цикл 
		ИменаПолей = ДоступныеПоля[ВидМероприятия];
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ДоступныеКолонки, СтрРазделить(ИменаПолей, ","), Истина);
	КонецЦикла;
	
	Отбор = Новый Структура("ДатаОтмены", Дата(1, 1, 1));
	Если Мероприятия.НайтиСтроки(Отбор).Количество() = Мероприятия.Количество() Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ДоступныеКолонки, "Идентификатор");
	КонецЕсли;
	
	Колонки = Мероприятия.Выгрузить(Новый Массив).Колонки;
	Для Каждого Колонка Из Колонки Цикл 
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, 
			"Мероприятия" + Колонка.Имя, "Видимость", ДоступныеКолонки.Найти(Колонка.Имя) <> Неопределено);
	КонецЦикла;
	
	Если Не ИспользоватьЗамещение Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МероприятияКодПоРееструДолжностей", "Видимость", Ложь);
	КонецЕсли;
	
	Если Не ОбщегоНазначения.ПодсистемаСуществует("ЗарплатаКадрыРасширеннаяПодсистемы") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "МероприятияРазрядКатегория", "Видимость", Ложь);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере 
Функция ДоступныеПоляВсехВидовМероприятий()
	
	Возврат ЭлектронныеТрудовыеКнижки.ДоступныеПоляВсехВидовМероприятий() + ",Идентификатор";
	
КонецФункции

&НаСервере 
Функция ДоступныеПоляВидовМероприятий()
	
	Возврат ЭлектронныеТрудовыеКнижки.ДоступныеПоляВидовМероприятий();
	
КонецФункции

&НаСервере 
Процедура ЗаявлениеПриИзмененииНаСервере(ИмяПоля)
	
	Заявление = ЭтаФорма[ИмяПоля];
	Если Не ЗначениеЗаполнено(Заявление) Тогда
		ЭтаФорма[ИмяПоля + "Отмена"] = Ложь;
		Возврат;
	КонецЕсли;
	
	ВидЗаявления = ?(ИмяПоля = "ЗаявлениеОПродолжении",
		Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки,
		Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме);
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", Заявление);
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("ВидЗаявления", ВидЗаявления);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаявлениеОПредоставленииСведенийОТрудовойДеятельностиСотрудники.ЗаявлениеОтозвано КАК ЗаявлениеОтозвано
	               |ИЗ
	               |	Документ.ЗаявлениеОПредоставленииСведенийОТрудовойДеятельности.Сотрудники КАК ЗаявлениеОПредоставленииСведенийОТрудовойДеятельностиСотрудники
	               |ГДЕ
	               |	ЗаявлениеОПредоставленииСведенийОТрудовойДеятельностиСотрудники.Ссылка = &Ссылка
	               |	И ЗаявлениеОПредоставленииСведенийОТрудовойДеятельностиСотрудники.Сотрудник.ФизическоеЛицо = &Сотрудник
	               |	И ЗаявлениеОПредоставленииСведенийОТрудовойДеятельностиСотрудники.ВидЗаявления = &ВидЗаявления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда 
		ТекстСообщения = НСтр("ru = 'Выбранный документ не содержит заявления данного типа по сотруднику.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		ЭтаФорма[ИмяПоля] = Неопределено;
		ЭтаФорма[ИмяПоля + "Отмена"] = Ложь;
		Возврат;
	КонецЕсли;
	
	ЭтаФорма[ИмяПоля + "Отмена"] = Выборка.ЗаявлениеОтозвано;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыВыбораЗаявлений()
	
	ПараметрыВыбора = Новый Массив;
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", Организация);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Сотрудник", Сотрудник);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидЗаявления", Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.ВедениеБумажнойТрудовойКнижки);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.ЗаявлениеОПродолжении.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
	ПараметрыВыбора = Новый Массив;
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Организация", Организация);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.Сотрудник", Сотрудник);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	ПараметрВыбора = Новый ПараметрВыбора("Отбор.ВидЗаявления", Перечисления.ВидыЗаявленийОПредоставленииСведенийОТрудовойДеятельности.СведенияОТрудовойДеятельностиВЭлектроннойФорме);
	ПараметрыВыбора.Добавить(ПараметрВыбора);
	
	Элементы.ЗаявлениеОПредоставлении.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	
КонецПроцедуры

#КонецОбласти