
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	ТекстПредупреждения = "";
	Если НЕ ЗначениеЗаполнено(СчетУчета) Тогда
		ТекстПредупреждения = "Заполните значение параметра ""Счет учета первоначальной стоимости ICLL!""";	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СчетНачисленияАмортизации) Тогда
		ТекстПредупреждения = ТекстПредупреждения + " 
		|Заполните значение параметра ""Счет накопленной амортизации ICLL!""";	
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(СчетСниженияСтоимости) Тогда
		ТекстПредупреждения = ТекстПредупреждения + " 
		|Заполните значение параметра ""Счет накопленного обесценения ICLL!""";	
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстПредупреждения) Тогда
		Сообщить(ТекстПредупреждения);
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	ПараметрДанных.Значение = НачалоПериода;
	ПараметрДанных.Использование = ЗначениеЗаполнено(НачалоПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	ПараметрДанных.Значение = КонецДня(КонецПериода);
	ПараметрДанных.Использование = ЗначениеЗаполнено(КонецПериода);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
	ПараметрДанных.Значение = Организация;
	ПараметрДанных.Использование = ЗначениеЗаполнено(Организация);
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетУчета");
	ПараметрДанных.Значение = СчетУчета;
	ПараметрДанных.Использование = ЗначениеЗаполнено("СчетУчета");
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетСниженияСтоимости");
	ПараметрДанных.Значение = СчетСниженияСтоимости;
	ПараметрДанных.Использование = ЗначениеЗаполнено("СчетСниженияСтоимости");
	
	ПараметрДанных = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СчетНачисленияАмортизации");
	ПараметрДанных.Значение = СчетНачисленияАмортизации;
	ПараметрДанных.Использование = ЗначениеЗаполнено("СчетНачисленияАмортизации");
КонецПроцедуры
