&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// вызов механизма справочной информации
	//бит_си_ОбщегоНазначения.УстановитьПодменюСИ(ЭтаФорма, ЭтаФорма);
	ИжТиСи_СВД_Сервер.ОК_ВывестиРеквизиты(ЭтаФорма, "РегистрСведений.бит_му_НРП_ВНА.ФормаСписка");
КонецПроцедуры

// Процедура - обработчик события ""Нажатие"" кнопки ""ОткрытьСИ"" коммандной панели ""ДействияФормы"". 
// Открывает справку по данной форме.
//
&НаКлиенте
Процедура бит_си_ДействияФормыОткрытьСИ(Команда)
	//бит_си_ОбщегоНазначения.ОткрытьСИ(Команда);
	Форма = ПолучитьФорму("Обработка.бит_си_СправочнаяИнформация.Форма.ФормаУправляемая", Новый Структура("ПараметрОткрытия", "РегистрСведений.бит_му_НРП_ВНА.ФормаСписка"), ЭтаФорма);
	Форма.Открыть();
КонецПроцедуры
