////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьНадписьРабочегоКаталога();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура КомандаУстановитьРасширениеРаботыСКриптографиейНаКлиенте(Команда)
	Если Не ПодключитьРасширениеРаботыСКриптографией() Тогда
		УстановитьРасширениеРаботыСКриптографией();
		ПодключитьРасширениеРаботыСКриптографией();
		СтрокаСообщения = НСтр("ru = 'Расширение работы с криптографией успешно установлено'");
	Иначе
		СтрокаСообщения = НСтр("ru = 'Расширение работы с криптографией было установлено ранее'");
	КонецЕсли;
	Предупреждение(СтрокаСообщения);
КонецПроцедуры
 
&НаКлиенте
Процедура КомандаУстановитьРасширениеРаботыСФайлами(Команда)
	Если Не ПодключитьРасширениеРаботыСФайлами() Тогда
		УстановитьРасширениеРаботыСфайлами();
		ПодключитьРасширениеРаботыСФайлами();
		СтрокаСообщения = НСтр("ru = 'Расширение работы с файлами успешно установлено'");
	Иначе
		СтрокаСообщения = НСтр("ru = 'Расширение работы с файлами было установлено ранее'");
	КонецЕсли;
	Предупреждение(СтрокаСообщения);
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРабочийКаталогПользователя(Команда)
	ОткрытьФормуМодально("ОбщаяФорма.НастройкаЛокальногоКэшаФайлов");
	ОбновитьНадписьРабочегоКаталога();
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ОбновитьНадписьРабочегоКаталога()
	РабочийКаталогПользователя = ФайловыеФункцииКлиентПовтИсп.ПолучитьПерсональныеНастройкиРаботыСФайлами().ПутьКЛокальномуКэшуФайлов;
	Если Не ПустаяСтрока(РабочийКаталогПользователя) Тогда
		Элементы.НадписьРабочегоКаталога.Заголовок = НСтр("ru = 'Рабочий каталог обмена: '")+РабочийКаталогПользователя;
	Иначе
		Элементы.НадписьРабочегоКаталога.Заголовок = НСтр("ru = 'Рабочий каталог обмена не настроен'");
	КонецЕсли;	

КонецПроцедуры
