
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	
	
	// Вызов механизма защиты
	
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	// 1c-izhtc, ChuckNorris, 27.07.2015 ( 
	ИжТиСи_СВД_Сервер.ОК_ВывестиРеквизиты(ЭтаФорма, "Справочник.бит_му_ВидыРБП.ФормаЭлементаУправляемая");
	// 1c-izhtc, ChuckNorris, 27.07.2015 )
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

