
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 
	Если Параметры.Свойство("ФВБ") И
		 ЗначениеЗаполнено(Параметры.ФВБ)
	Тогда 
		Элементы.КомпоновщикНастроекПользовательскиеНастройки.Видимость   = Ложь;
		Элементы.КомпоновщикНастроекПользовательскиеНастройки.Доступность = Ложь;
		
		Отчет.ФВБ = Параметры.ФВБ;	
		
	КонецЕсли;
	
КонецПроцедуры
