

// BIT Amerkulov 03072014 {
Перем ТаблицаДвиженийМСФО;  // Хранит движения, которые необходимо оставлять при снятии пометки удаления
// }
// BIT Amerkulov 03092014 {
Перем ТребуетсяПерезапись Экспорт;  
Перем глРежимЗаписи Экспорт;
// }

Процедура ОбработкаПроведения(Отказ, Режим)

	//{ bit SVKushnirenko Bit 27.01.2017 #2657
	ЭтотОбъект.Движения.бит_КонтрольныеЗначенияБюджетов.ДополнительныеСвойства.Вставить("бит_БК_УстановкаСтатусаПослеПроведения", Истина);
	//} bit SVKushnirenko Bit 27.01.2017 #2657
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр бит_ок_ОборотыАксапты 
	Движения.бит_ок_ОборотыАксапты.Записывать = Истина;
	Движения.бит_ок_ОборотыАксапты.Очистить();
	Для Каждого ТекСтрокаОборотыАксапты Из ОборотыАксапты Цикл
		Движение = Движения.бит_ок_ОборотыАксапты.Добавить();
		
		ЗаполнитьЗначенияСвойств(Движение, ТекСтрокаОборотыАксапты); //***БИТ***Теплова***
		
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.ТипДокумента = ТипДокумента;
		Движение.Ваучер = Ваучер;
		Движение.СчетДт = ТекСтрокаОборотыАксапты.СчетДт;
		Движение.СчетКт = ТекСтрокаОборотыАксапты.СчетКт;
		Движение.СубконтоАксаптаДт1 = ТекСтрокаОборотыАксапты.СубконтоАксаптаДт1;
		Движение.СубконтоАксаптаДт2 = ТекСтрокаОборотыАксапты.СубконтоАксаптаДт2;
		Движение.СубконтоАксаптаДт3 = ТекСтрокаОборотыАксапты.СубконтоАксаптаДт3;
		Движение.СубконтоАксаптаКт1 = ТекСтрокаОборотыАксапты.СубконтоАксаптаКт1;
		Движение.СубконтоАксаптаКт2 = ТекСтрокаОборотыАксапты.СубконтоАксаптаКт2;
		Движение.СубконтоАксаптаКт3 = ТекСтрокаОборотыАксапты.СубконтоАксаптаКт3;
		Движение.Субконто1СДт1 = ТекСтрокаОборотыАксапты.Субконто1СДт1;
		Движение.Субконто1СДт2 = ТекСтрокаОборотыАксапты.Субконто1СДт2;
		Движение.Субконто1СДт3 = ТекСтрокаОборотыАксапты.Субконто1СДт3;
		Движение.Субконто1СКт1 = ТекСтрокаОборотыАксапты.Субконто1СКт1;
		Движение.Субконто1СКт2 = ТекСтрокаОборотыАксапты.Субконто1СКт2;
		Движение.Субконто1СКт3 = ТекСтрокаОборотыАксапты.Субконто1СКт3;
		Движение.Сумма = ТекСтрокаОборотыАксапты.Сумма;
		
	КонецЦикла;
	
	//БИТ Тртилек 09.10.2012 записываем движения по международному для создания движений в открытом периоде
	Движения.бит_Дополнительный_2.Записывать = Истина;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

//***БИТ*Теплова***(
Процедура ПриЗаписи(Отказ) 
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-04-04 (#3124)
	бтСсылкаНаДокументОперация = ДополнительныеСвойства.ок_ОперацияБух;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-04-04 (#3124)
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-15 (#3101)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-15 (#3101)
		
	Если ЗначениеЗаполнено(бтСсылкаНаДокументОперация) И ЭтотОбъект.Проведен Тогда
		Документ = бтСсылкаНаДокументОперация.ПолучитьОбъект();
		Документ.ПометкаУдаления = НЕ бтИсправление;
		Если НЕ бтИсправление Тогда
			ДвиженияОперация = Документ.Движения.Хозрасчетный;
			ДвиженияОперация.Записывать = Истина;
			ДвиженияОперация.Очистить();
			ДвиженияОперация.Записать();
		КонецЕсли;
		Документ.Записать(РежимЗаписиДокумента.Запись);
	ИначеЕсли ЗначениеЗаполнено(бтСсылкаНаДокументОперация) И НЕ ЭтотОбъект.Проведен Тогда
		Документ = бтСсылкаНаДокументОперация.ПолучитьОбъект();
		Документ.ПометкаУдаления = НЕ Ссылка.Проведен;
		ДвиженияОперация = Документ.Движения.Хозрасчетный;
		ДвиженияОперация.Записывать = Истина;
		ДвиженияОперация.Очистить();
		ДвиженияОперация.Записать();
		Документ.Записать(РежимЗаписиДокумента.Запись);
		Если ЭтотОбъект.ПометкаУдаления и бтИсправление Тогда
			бтИсправление = Ложь;
			ЭтотОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;
	КонецЕсли;
	
	// BIT Amerkulov 03072014 {
	
	Если ТаблицаДвиженийМСФО.Количество() Тогда
		Движения.бит_Дополнительный_2.Загрузить(ТаблицаДвиженийМСФО);
		Движения.бит_Дополнительный_2.Записывать = Истина;
		Движения.бит_Дополнительный_2.Записать();
		// BIT Amerkulov 03092014 ++			
		ТаблицаДвиженийМСФО.Очистить();
		// BIT Amerkulov 03092014 --			
	КонецЕсли;              
	

	// }
	
	
КонецПроцедуры
//***БИТ*Теплова***)

// БИТ Тртилек 05.10.2012 Процедура - обработчик события "ОбработкаУдаленияПроведения"
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	
	//{ bit SVKushnirenko Bit 27.01.2017 #2657
	ЭтотОбъект.Движения.бит_КонтрольныеЗначенияБюджетов.ДополнительныеСвойства.Вставить("бит_БК_УстановкаСтатусаПередУдалением", Истина);
	//} bit SVKushnirenko Bit 27.01.2017 #2657
	
	бит_ОбщегоНазначения.УдалитьДвиженияРегистратора(ЭтотОбъект, Отказ);

КонецПроцедуры

//***БИТ*Теплова***)


// BIT Amerkulov 03072014 {
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-04-04 (#3124)
	Перем бтСсылкаНаДокументОперация;
	
	Если Не ДополнительныеСвойства.Свойство("ок_ОперацияБух",	бтСсылкаНаДокументОперация) Тогда 
		Если ЗначениеЗаполнено(Ссылка) Тогда 
			ДополнительныеСвойства.Вставить("ок_ОперацияБух",	Документы.бит_ок_ОперацияАксапты.ПолучитьСвязаннуюОперациюБУХ(Ссылка));
			бтСсылкаНаДокументОперация = ДополнительныеСвойства.ок_ОперацияБух;
		Иначе
			ДополнительныеСвойства.Вставить("ок_ОперацияБух");
		КонецЕсли;		
	КонецЕсли;	 
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-04-04 (#3124)
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-10-15 (#3101)
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-10-15 (#3101)
	
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос("Выбрать Док.ПометкаУдаления, Док.Проведен Из Документ.бит_ок_ОперацияАксапты КАК Док Где Док.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		// BIT Amerkulov 16022015 ++	
		Если Выборка.Следующий()  Тогда	
			Если РежимЗаписи = РежимЗаписиДокумента.Запись 
				//ИЛИ  РежимЗаписи = РежимЗаписиДокумента.Проведение И Выборка.Проведен = Ложь 
				Тогда			
				Движения.бит_Дополнительный_2.Прочитать();
				ТаблицаДвиженийМСФО = Движения.бит_Дополнительный_2.Выгрузить(); 	
			КонецЕсли;		
		КонецЕсли;
		// BIT Amerkulov 16022015 --	
	КонецЕсли;
	
	// BIT Amerkulov 03092014 ++	
	глРежимЗаписи 	= РежимЗаписи;
	// BIT Amerkulov 03092014 --	
	
	// BIT Amerkulov 16022015 ++	
	Если ПометкаУдаления = Истина И ЗначениеЗаполнено(бтСсылкаНаДокументОперация) Тогда
		Документ = бтСсылкаНаДокументОперация.ПолучитьОбъект();
		Документ.ПометкаУдаления = Истина;
		ДвиженияОперация = Документ.Движения.Хозрасчетный;
		ДвиженияОперация.Записывать = Истина;
		ДвиженияОперация.Очистить();
		ДвиженияОперация.Записать();
		Документ.Записать(РежимЗаписиДокумента.Запись);
		бтИсправление = Ложь;
	КонецЕсли;	
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		бтИсправление = Ложь;
	КонецЕсли;		
	// BIT Amerkulov 16022015 --	
	
	//БИТ АКриштопов 07042016 ++ Временная решение
	Попытка
		Движения.бит_ОборотыПоБюджетам.ОбменДанными.Загрузка = Истина;
	Исключение
	КонецПопытки;
	//БИТ АКриштопов 07042016 --
КонецПроцедуры
	
ТаблицаДвиженийМСФО = Новый ТаблицаЗначений;
// }

