#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// Заполняет список команд печати.
//
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет, есть ли не оплаченные или не закрытые документы планирования 
// по проекту договора.
//
Функция ОпределитьНаличиеНеЗакрытыхДокументов(ПроектСсылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("ЕстьДокументыЗаявкиНаРасходДС", Ложь);
	Результат.Вставить("ЕстьДокументыЗаявкиНаЗатраты", Ложь);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПроектДоговора", ПроектСсылка);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ДоговорКонтрагента
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.бит_ПроектДоговора = &ПроектДоговора
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВЫБОР
		|		КОГДА ПланируемыеЗатратыОстатки.СуммаОстаток > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьДокументыЗаявкиНаЗатраты,
		|	ВЫБОР
		|		КОГДА ПланируемыйРасходДенежныхСредствОстатки.СуммаОстаток > 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьДокументыЗаявкиНаРасходДС
		|ИЗ
		|	РегистрНакопления.бит_ПланируемыеЗатраты.Остатки(
		|			,
		|			ДоговорКонтрагента В
		|				(ВЫБРАТЬ
		|					ДоговорКонтрагента.Ссылка КАК Ссылка
		|				ИЗ
		|					ДоговорКонтрагента КАК ДоговорКонтрагента)) КАК ПланируемыеЗатратыОстатки,
		|	РегистрНакопления.бит_ПланируемыйРасходДенежныхСредств.Остатки(
		|			,
		|			ДоговорКонтрагента В
		|				(ВЫБРАТЬ
		|					ДоговорКонтрагента.Ссылка КАК Ссылка
		|				ИЗ
		|					ДоговорКонтрагента КАК ДоговорКонтрагента)) КАК ПланируемыйРасходДенежныхСредствОстатки";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	ЗаполнитьЗначенияСвойств(Результат, Выборка);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
