#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Возвращает ответственного за центр результата
// Параметры
//  <Отбор>  - структура("СтатьяОборотов,ОбъектСтроительства,ЦФО")
// Возвращаемое значение:
//   <Инициатор>   - <описание возвращаемого значения>
//
Функция ПолучитьОЦР(отбор)   Экспорт

	Менеджер=РегистрыСведений.ОК_БК_ОтветственныеЗаЦентрРезультата.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(менеджер,отбор);
	Менеджер.Прочитать();
	возврат Менеджер.Инициатор;	

КонецФункции // ПолучитьОЦР()

#КонецЕсли