////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеПараметровСоединения = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ПолучитьПараметрыСоединения();
	
	ИмяПользователяSQL = ДанныеПараметровСоединения.ИмяПользователя;
	ПарольПользователяSQL = ДанныеПараметровСоединения.Пароль;
	СерверSQL = ДанныеПараметровСоединения.Сервер;
	БазаSQL = ДанныеПараметровСоединения.База;
	СтрокаСоединенияSQL = ДанныеПараметровСоединения.СтрокаСоединения;
	СУБД = ДанныеПараметровСоединения.СУБД;
	ИмяТаблицы = "dbo_ExportDataTo1cPaymOrder";
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ИмяПользователяSQLПриИзменении(Элемент)
	
	СоздатьСтрокуСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПользователяSQLПриИзменении(Элемент)
	
	СоздатьСтрокуСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура СерверSQLПриИзменении(Элемент)
	
	СоздатьСтрокуСоединения();
	
КонецПроцедуры

&НаКлиенте
Процедура БазаSQLПриИзменении(Элемент)
	
	СоздатьСтрокуСоединения();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаКлиенте
Процедура OK(Команда)
	
	ЗаписатьПараметрыСоединения();
	Оповестить("СБ_ОбновленыПараметрыВнешнегоИсточника", "dbo_ExportDataTo1cPaymOrder"); 
	Закрыть();
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
Процедура ЗаписатьПараметрыСоединения()
	
	НаборЗаписей = РегистрыСведений.бит_ок_НастройкиМеханизмаИмпортаДанных.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Группа.Установить(СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек());
	
	Запись = НаборЗаписей.Добавить();
	Запись.Группа = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек();
	Запись.ИмяНастройки = "ИмяПользователя";
	Запись.Значение = ИмяПользователяSQL;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Группа = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек();
	Запись.ИмяНастройки = "Пароль";
	Запись.Значение = ПарольПользователяSQL;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Группа = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек();
	Запись.ИмяНастройки = "Сервер";
	Запись.Значение = СерверSQL;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Группа = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек();
	Запись.ИмяНастройки = "База";
	Запись.Значение = БазаSQL;
	
	Запись = НаборЗаписей.Добавить();
	Запись.Группа = СБ_ЗагрузкаПД_AXAPTA_УправлениеИсточником.ИмяГруппыХраненияНастроек();
	Запись.ИмяНастройки = "СтрокаСоединения";
	Запись.Значение = СтрокаСоединенияSQL;
		
	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСтрокуСоединения()
	
	Результат = "DRIVER={SQL Server};";
	
	Если НЕ ПустаяСтрока(СерверSQL) Тогда
		
		Результат = Результат 
				  + "SERVER="
				  + СерверSQL
				  + ";";
				  
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ИмяПользователяSQL) Тогда
		
		Результат = Результат 
				  + "UID="
				  + ИмяПользователяSQL
				  + ";";
				  
	КонецЕсли;
			  
	Если НЕ ПустаяСтрока(ПарольПользователяSQL) Тогда
		
		Результат = Результат 
				  + "PWD="
				  + ПарольПользователяSQL
				  + ";";
				  
	КонецЕсли;
			  
	Если НЕ ПустаяСтрока(БазаSQL) Тогда
		
		Результат = Результат 
				  + "DATABASE="
				  + БазаSQL
				  + ";";
				  
	КонецЕсли;
	
	Результат = Результат + "LANGUAGE=us_english";
	
	СтрокаСоединенияSQL = Результат;
	
КонецПроцедуры



