
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Вставить содержимое обработчика
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПродуктивПриИзменении(Элемент)
	
	Если НЕ Запись.Продуктив 
		И ЗначениеЗаполнено(Запись.ДатаПередачиВПродуктив) Тогда
	
		Запись.ДатаПередачиВПродуктив = Неопределено;
		
	ИначеЕсли Запись.Продуктив
		И НЕ ЗначениеЗаполнено(Запись.ДатаПередачиВПродуктив) Тогда
		
		Запись.ДатаПередачиВПродуктив = ТекущаяДата();
		
	КонецЕсли; 
	
	УправлениеФормой();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
// Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
	
	Элементы.ДатаПередачиВПродуктив.АвтоОтметкаНезаполненного = Запись.Продуктив;
	Элементы.ДатаПередачиВПродуктив.Доступность = Запись.Продуктив;
	Если НЕ Элементы.ДатаПередачиВПродуктив.АвтоОтметкаНезаполненного Тогда
		Элементы.ДатаПередачиВПродуктив.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти