
//БИТ Изюмов А.В. 06.08.12 процедура устанавливает нужный префикс для основных средств
Процедура бит_му_ПриУстановкеНовогоКодаСправочникаОСПриУстановкеНовогоКода(Источник, СтандартнаяОбработка, Префикс) Экспорт
	
	Если ТипЗнч(Источник) = Тип("СправочникОбъект.ОсновныеСредства") И Источник.бит_му_ТолькоМСФО = Истина Тогда 
		Префикс = "МУ";
	КонецЕсли;
	
КонецПроцедуры

//БИТ Изюмов А.В. 06.08.12 установка родителя
Процедура бит_му_ПередЗаписьюСправочникаОСПередЗаписью(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ТипЗнч(Источник) = Тип("СправочникОбъект.ОсновныеСредства") Тогда
		Возврат;
	КонецЕсли;
	
	//Получаем группу МСФО
	// +СБ. Кузнецова С. 2014-11-12 
	//Отбор = Новый Структура("Группа,ИмяНастройки","Группа ОС МСФО","Группа ОС МСФО");
	Отбор = Новый Структура("Группа,ИмяНастройки, СБ_ПорядковыйНомерЗначения","Группа ОС МСФО","Группа ОС МСФО", 0);
	// -СБ. Кузнецова С.
	Структура = РегистрыСведений.бит_му_Настройки.Получить(Отбор);
	Если Структура.Количество() = 0 ИЛИ НЕ ЗначениеЗаполнено(Структура.Значение) Тогда 
		ВызватьИсключение "Не установлено значение настройки <Группа ОС МСФО> в регистре <Настройки МСФО>";
	иначе
		ГруппаМСФО = Структура.Значение; 
	КонецЕсли;
	
	Если Источник.бит_му_ТолькоМСФО = Истина  Тогда 
		Если НЕ Источник.ЭтоНовый() Тогда
			Префикс = "МУ";
			//если не установлен номер с префиксом , очищаем код чтобы сработала подписка ПриУстановкеНовогоНомера
			Если НЕ Лев(Источник.Код,2) = Префикс Тогда
				Источник.Код = "";
			КонецЕсли;
		КонецЕсли;	
		//и отправляем в группу МСФО
		
		//ОК Калинин М. 071112
		//Источник.Родитель = ГруппаМСФО;
		Если не Источник.ПринадлежитЭлементу(ГруппаМСФО) Тогда 
			Источник.Родитель = ГруппаМСФО;
		конецесли;		
		//ОК Калинин М. 

		
	Иначе 
		//проверяем на родителя
		//ОК Калинин М. 071112
		//Если Источник.Родитель = ГруппаМСФО Тогда 
		Если Источник.ПринадлежитЭлементу(ГруппаМСФО) Тогда 
		//ОК Калинин М. 
			Сообщить("В группе <"+ГруппаМСФО+"> может быть записан элемент с установленным свойством <Только МСФО>", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

//БИТ Изюмов А.В. 06.08.12 процедура получает движения документов из подбора для принятия к учету 
Функция бит_му_ПолучитьДвиженияПоХозрасчетномуРегистру(ОбъектСтроительства,МассивДокументов, ДокументОСИзПодбора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаСопоставления.ДокументБУ,
	               |	ТаблицаСопоставления.ВНА
	               |ПОМЕСТИТЬ ВТТаблицаСопоставления
	               |ИЗ
	               |	&ТаблицаСопоставления КАК ТаблицаСопоставления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВложенныйЗапрос.СчетКт,
	               |	ВложенныйЗапрос.СубконтоКт1,
	               |	ВложенныйЗапрос.СчетДт,
	               |	ВложенныйЗапрос.СубконтоДт1,
	               |	ВложенныйЗапрос.СубконтоДт2,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.ДокументРСБУ,
	               |	ВложенныйЗапрос.СтатьяЗатрат,
	               |	ВложенныйЗапрос.ОбъектСтроительства,
	               |	Комплектация.АналитикаРСБУ,
	               |	Комплектация.ДокументРСБУ КАК ДокументРСБУКоплектация,
	               |	ВложенныйЗапрос.ОсновноеСредство,
	               |	ВложенныйЗапрос.Подразделение
	               |ИЗ
	               |	ВТТаблицаСопоставления КАК ВТТаблицаСопоставления
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ВложенныйЗапрос.СчетКт КАК СчетКт,
	               |			ВложенныйЗапрос.СубконтоКт1 КАК СубконтоКт1,
	               |			ВЫБОР
	               |				КОГДА ВложенныйЗапрос.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |						И ВложенныйЗапрос.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ВложенныйЗапрос.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |									ИЛИ ВложенныйЗапрос.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |								ТОГДА ВложенныйЗапрос.СчетДт
	               |							ИНАЧЕ ВложенныйЗапрос.СчетКт
	               |						КОНЕЦ
	               |				ИНАЧЕ ВложенныйЗапрос.СчетДт
	               |			КОНЕЦ КАК СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1 КАК СубконтоДт1,
	               |			ВложенныйЗапрос.СубконтоДт2 КАК СубконтоДт2,
	               |			СУММА(ВложенныйЗапрос.Сумма) КАК Сумма,
	               |			ВложенныйЗапрос.ДокументРСБУ КАК ДокументРСБУ,
	               |			ВложенныйЗапрос.СтатьяЗатрат КАК СтатьяЗатрат,
	               |			ВложенныйЗапрос.ОбъектСтроительства КАК ОбъектСтроительства,
	               |			ВложенныйЗапрос.ОсновноеСредство КАК ОсновноеСредство,
	               |			NULL КАК Подразделение
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ВЫБОР
	               |					КОГДА ХозрасчетныйДвиженияССубконто.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования)
	               |							И ХозрасчетныйДвиженияССубконто.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств)
	               |							И ХозрасчетныйДвиженияССубконто.СчетКт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков)
	               |						ТОГДА ВЫБОР
	               |								КОГДА ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования)
	               |										ИЛИ ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств)
	               |										ИЛИ ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков)
	               |									ТОГДА ХозрасчетныйДвиженияССубконто.СчетДт
	               |								ИНАЧЕ ХозрасчетныйДвиженияССубконто.СчетКт
	               |							КОНЕЦ
	               |					ИНАЧЕ ХозрасчетныйДвиженияССубконто.СчетКт
	               |				КОНЕЦ КАК СчетКт,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СубконтоКт1,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоКт2 КАК СубконтоКт2,
	               |				ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ВЫБОР
	               |					КОГДА ХозрасчетныйДвиженияССубконто.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |							И ХозрасчетныйДвиженияССубконто.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |						ТОГДА ВЫБОР
	               |								КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |									ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |								ИНАЧЕ ВЫБОР
	               |										КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |											ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |										ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |									КОНЕЦ
	               |							КОНЕЦ
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |							ИНАЧЕ ВЫБОР
	               |									КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства)
	               |										ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |									ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |								КОНЕЦ
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СубконтоДт1,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.СтатьиЗатрат)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт2
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.СтатьиЗатрат)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СубконтоДт2,
	               |				ВЫБОР
	               |					КОГДА ХозрасчетныйДвиженияССубконто.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования)
	               |							ИЛИ ХозрасчетныйДвиженияССубконто.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств)
	               |							ИЛИ ХозрасчетныйДвиженияССубконто.СчетКт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков)
	               |						ТОГДА ВЫБОР
	               |								КОГДА ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |										ИЛИ ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |									ТОГДА ХозрасчетныйДвиженияССубконто.Сумма
	               |								ИНАЧЕ -ХозрасчетныйДвиженияССубконто.Сумма
	               |							КОНЕЦ
	               |					ИНАЧЕ ХозрасчетныйДвиженияССубконто.Сумма
	               |				КОНЕЦ КАК Сумма,
	               |				ХозрасчетныйДвиженияССубконто.Регистратор КАК ДокументРСБУ,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.СтатьиЗатрат)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт2
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.СтатьиЗатрат)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СтатьяЗатрат,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОбъектСтроительства,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОсновноеСредство
	               |			ИЗ
	               |				РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |						,
	               |						,
	               |						Счет В (&СписокСчетов)
	               |							И Регистратор В (&СписокДокументов)
	               |							И НЕ(СчетДт В (&СписокСчетовКт)
	               |									И СчетКт В (&СписокСчетовКт)),
	               |						,
	               |						) КАК ХозрасчетныйДвиженияССубконто
	               |			ГДЕ
	               |				ХозрасчетныйДвиженияССубконто.Сумма <> 0) КАК ВложенныйЗапрос
	               |		ГДЕ
	               |			ВложенныйЗапрос.СчетКт В(&СписокСчетовКт)
	               |			И ВложенныйЗапрос.ОбъектСтроительства В ИЕРАРХИИ(&ОбъектСтроительства)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВложенныйЗапрос.ДокументРСБУ,
	               |			ВложенныйЗапрос.СтатьяЗатрат,
	               |			ВложенныйЗапрос.СчетКт,
	               |			ВложенныйЗапрос.СубконтоКт1,
	               |			ВложенныйЗапрос.СубконтоДт2,
	               |			ВложенныйЗапрос.ОбъектСтроительства,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.ОсновноеСредство,
	               |			ВЫБОР
	               |				КОГДА ВложенныйЗапрос.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |						И ВложенныйЗапрос.СчетДт <> ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |					ТОГДА ВЫБОР
	               |							КОГДА ВложенныйЗапрос.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ОСвОрганизации)
	               |									ИЛИ ВложенныйЗапрос.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.МЦвОрганизации)
	               |								ТОГДА ВложенныйЗапрос.СчетДт
	               |							ИНАЧЕ ВложенныйЗапрос.СчетКт
	               |						КОНЕЦ
	               |				ИНАЧЕ ВложенныйЗапрос.СчетДт
	               |			КОНЕЦ
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.СубконтоДт2,
	               |			СУММА(ВложенныйЗапрос.Сумма),
	               |			ВложенныйЗапрос.Регистратор,
	               |			ВложенныйЗапрос.СтатьяЗатрат,
	               |			ВложенныйЗапрос.ОбъектСтроительства,
	               |			ВложенныйЗапрос.ОсновноеСредство,
	               |			ВложенныйЗапрос.Подразделение
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	               |				ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	               |				ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.СтатьиЗатрат)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт2
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.СтатьиЗатрат)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СтатьяЗатрат,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОбъектСтроительства,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОсновноеСредство,
	               |				ХозрасчетныйДвиженияССубконто.ПодразделениеДт КАК Подразделение
	               |			ИЗ
	               |				РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |						,
	               |						,
	               |						СчетДт В (&СписокСчетовКт)
	               |							И СчетКт В (&СписокСчетовКт)
	               |							И Регистратор В (&СписокДокументов),
	               |						,
	               |						) КАК ХозрасчетныйДвиженияССубконто
	               |			ГДЕ
	               |				ХозрасчетныйДвиженияССубконто.Сумма <> 0
	               |			
	               |			ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |			ВЫБРАТЬ
	               |				ХозрасчетныйДвиженияССубконто.СчетКт,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоКт1,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоКт2,
	               |				-ХозрасчетныйДвиженияССубконто.Сумма,
	               |				ХозрасчетныйДвиженияССубконто.Регистратор,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.СтатьиЗатрат)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.СтатьиЗатрат)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт2
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОбъектыСтроительства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ,
	               |				ХозрасчетныйДвиженияССубконто.ПодразделениеКт
	               |			ИЗ
	               |				РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |						,
	               |						,
	               |						СчетДт В (&СписокСчетовКт)
	               |							И СчетКт В (&СписокСчетовКт)
	               |							И Регистратор В (&СписокДокументов),
	               |						,
	               |						) КАК ХозрасчетныйДвиженияССубконто
	               |			ГДЕ
	               |				ХозрасчетныйДвиженияССубконто.Сумма <> 0) КАК ВложенныйЗапрос
	               |		ГДЕ
	               |			ВложенныйЗапрос.ОбъектСтроительства В ИЕРАРХИИ(&ОбъектСтроительства)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВложенныйЗапрос.СубконтоДт2,
	               |			ВложенныйЗапрос.Регистратор,
	               |			ВложенныйЗапрос.СтатьяЗатрат,
	               |			ВложенныйЗапрос.ОбъектСтроительства,
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.ОсновноеСредство,
	               |			ВложенныйЗапрос.Подразделение,
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ЗНАЧЕНИЕ(ПланСчетов.бит_Дополнительный_2.Служебный),
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.СубконтоДт2,
	               |			СУММА(ВложенныйЗапрос.Сумма),
	               |			ВложенныйЗапрос.Регистратор,
	               |			ВложенныйЗапрос.СтатьяЗатрат,
	               |			ВложенныйЗапрос.ОбъектСтроительства,
	               |			ВложенныйЗапрос.ОсновноеСредство,
	               |			NULL
	               |		ИЗ
	               |			(ВЫБРАТЬ
	               |				ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |				ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	               |				ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	               |				ХозрасчетныйДвиженияССубконто.Регистратор КАК Регистратор,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт2) = ТИП(Справочник.СтатьиЗатрат)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт2
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт2) = ТИП(Справочник.СтатьиЗатрат)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК СтатьяЗатрат,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОбъектыСтроительства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ХозрасчетныйДвиженияССубконто.СубконтоДт1.Объект
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОбъектСтроительства,
	               |				ВЫБОР
	               |					КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоДт1) = ТИП(Справочник.ОсновныеСредства)
	               |						ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					ИНАЧЕ ВЫБОР
	               |							КОГДА ТИПЗНАЧЕНИЯ(ХозрасчетныйДвиженияССубконто.СубконтоКт1) = ТИП(Справочник.ОсновныеСредства)
	               |								ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |							ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
	               |						КОНЕЦ
	               |				КОНЕЦ КАК ОсновноеСредство
	               |			ИЗ
	               |				РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |						,
	               |						,
	               |						СчетДт В (&СписокСчетовОС)
	               |							И СчетКт В (&СписокСчетовСлужебный)
	               |							И Регистратор В (&СписокДокументов),
	               |						,
	               |						) КАК ХозрасчетныйДвиженияССубконто
	               |			ГДЕ
	               |				ХозрасчетныйДвиженияССубконто.Сумма <> 0) КАК ВложенныйЗапрос
	               |		ГДЕ
	               |			ВложенныйЗапрос.ОбъектСтроительства В ИЕРАРХИИ(&ОбъектСтроительства)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			ВложенныйЗапрос.СчетДт,
	               |			ВложенныйЗапрос.СубконтоДт2,
	               |			ВложенныйЗапрос.Регистратор,
	               |			ВложенныйЗапрос.СтатьяЗатрат,
	               |			ВложенныйЗапрос.ОбъектСтроительства,
	               |			ВложенныйЗапрос.СубконтоДт1,
	               |			ВложенныйЗапрос.ОсновноеСредство,
	               |			ВложенныйЗапрос.СубконтоДт1) КАК ВложенныйЗапрос
	               |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |				бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
	               |				бит_му_КомплектацияОС.ДокументРСБУ КАК ДокументРСБУ
	               |			ИЗ
	               |				РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
	               |			ГДЕ
	               |				бит_му_КомплектацияОС.ДокументРСБУ В(&СписокДокументов)
	               |				И бит_му_КомплектацияОС.АналитикаРСБУ В ИЕРАРХИИ(&ОбъектСтроительства)
	               |			
	               |			СГРУППИРОВАТЬ ПО
	               |				бит_му_КомплектацияОС.АналитикаРСБУ,
	               |				бит_му_КомплектацияОС.ДокументРСБУ) КАК Комплектация
	               |			ПО ВложенныйЗапрос.ОбъектСтроительства = Комплектация.АналитикаРСБУ
	               |				И ВложенныйЗапрос.ДокументРСБУ = Комплектация.ДокументРСБУ
	               |		ПО ВТТаблицаСопоставления.ДокументБУ = ВложенныйЗапрос.ДокументРСБУ
	               |			И ВТТаблицаСопоставления.ВНА = ВложенныйЗапрос.ОсновноеСредство
	               |ГДЕ
	               |	Комплектация.АналитикаРСБУ ЕСТЬ NULL 
	               |	И Комплектация.ДокументРСБУ ЕСТЬ NULL ";
				   
				   
	СписокСчетов = Новый СписокЗначений();
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.МЦвОрганизации);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков);
	
	СписокСчетовКт = Новый СписокЗначений();
	СписокСчетовКт.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования);
	СписокСчетовКт.Добавить(ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств);
	СписокСчетовКт.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеЗемельныхУчастков);
	
	СписокСчетовКтВводОстатков = Новый СписокЗначений();
	СписокСчетовКтВводОстатков.Добавить(ПланыСчетов.Хозрасчетный.ОсновныеСредства);
	СписокСчетовКтВводОстатков.Добавить(ПланыСчетов.Хозрасчетный.АмортизацияОсновныхСредств);
	СписокСчетовКтВводОстатков.Добавить(ПланыСчетов.Хозрасчетный.ДоходныеВложенияВ_МЦ);
	СписокСчетовКтВводОстатков.Добавить(ПланыСчетов.Хозрасчетный.Материалы);
	
	СписокСчетовОС = Новый СписокЗначений();
	СписокСчетовОС.Добавить(ПланыСчетов.Хозрасчетный.ОСвОрганизации);
	СписокСчетовОС.Добавить(ПланыСчетов.Хозрасчетный.МЦвОрганизации);
	
    СписокСчетовСлужебный  = Новый СписокЗначений();
	СписокСчетовСлужебный.Добавить(ПланыСчетов.Хозрасчетный.Вспомогательный);
	
	Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);	
	Запрос.УстановитьПараметр("СписокСчетовКт",СписокСчетовКт);			   
	Запрос.УстановитьПараметр("СписокСчетовКтВводОстатков",СписокСчетовКтВводОстатков);
	Запрос.УстановитьПараметр("СписокДокументов",МассивДокументов);
	Запрос.УстановитьПараметр("ОбъектСтроительства",ОбъектСтроительства);
	Запрос.УстановитьПараметр("СписокСчетовОС",СписокСчетовОС);
	Запрос.УстановитьПараметр("СписокСчетовСлужебный",СписокСчетовСлужебный);
	Запрос.УстановитьПараметр("ТаблицаСопоставления",ДокументОСИзПодбора);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции

//БИТ Изюмов А.В. 06.08.12 функция сопоставляет счета РСБУ-МСФО из правил трансляции 
Функция СоздатьТаблицуСоотвествияСчетовРСБУиМСФО(Организация, ДатаСреза) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ПОМЕСТИТЬ ВТДебетКредит
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""ДтКт""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ПОМЕСТИТЬ ВТСчетРСБУ
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Хозрасчетный_Счет""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение В ИЕРАРХИИ(&СписокСчетов)
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ПОМЕСТИТЬ ВТСчетМСФО
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""бит_Дополнительный_2_Счет""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ПОМЕСТИТЬ ВТСтатьи
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Хозрасчетный_Субконто1""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Хозрасчетный_Субконто2""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Хозрасчетный_Субконто3""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение1""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение2""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИД,
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.Значение
	               |ИЗ
	               |	Справочник.бит_ПравилаТрансляции.ЗначенияРеквизитов КАК бит_ПравилаТрансляцииЗначенияРеквизитов
	               |ГДЕ
	               |	бит_ПравилаТрансляцииЗначенияРеквизитов.ИмяКолонки = ""Значение3""
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Значение ССЫЛКА Справочник.СтатьиЗатрат
	               |	И бит_ПравилаТрансляцииЗначенияРеквизитов.Ссылка В
	               |			(ВЫБРАТЬ
	               |				бит_НазначениеПравилТрансляцииСрезПоследних.ПравилоТрансляции
	               |			ИЗ
	               |				РегистрСведений.бит_НазначениеПравилТрансляции.СрезПоследних(&ДатаСреза, СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = ЗНАЧЕНИЕ(Справочник.бит_ГруппыСтруктурныхПодразделений.ПустаяСсылка)
	               |					ИЛИ СтруктурноеПодразделение = &Организация) КАК бит_НазначениеПравилТрансляцииСрезПоследних)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТСтатьи.ИД,
	               |	МАКСИМУМ(ВТСтатьи.Значение) КАК Значение
	               |ПОМЕСТИТЬ ВТСтатьиЗатрат
	               |ИЗ
	               |	ВТСтатьи КАК ВТСтатьи
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТСтатьи.ИД
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТСчетМСФО.Значение КАК СчетМСФО,
	               |	ВТСчетРСБУ.Значение КАК СчетРСБУ,
	               |	ЕСТЬNULL(ВТСтатьиЗатрат.Значение, ЗНАЧЕНИЕ(Справочник.СтатьиЗатрат.ПустаяСсылка)) КАК СтатьяЗатрат
	               |ИЗ
	               |	ВТСчетРСБУ КАК ВТСчетРСБУ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСтатьиЗатрат КАК ВТСтатьиЗатрат
	               |		ПО ВТСчетРСБУ.ИД = ВТСтатьиЗатрат.ИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТДебетКредит КАК ВТДебетКредит
	               |		ПО ВТСчетРСБУ.ИД = ВТДебетКредит.ИД
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСчетМСФО КАК ВТСчетМСФО
	               |		ПО ВТСчетРСБУ.ИД = ВТСчетМСФО.ИД
	               |ГДЕ
	               |	ВТДебетКредит.Значение <> ЗНАЧЕНИЕ(Перечисление.бит_ВидыСоответствия.Кредит)
	               |	И (НЕ ВТСчетМСФО.Значение ЕСТЬ NULL )";

	СписокСчетов = Новый СписокЗначений();
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовПриродопользования);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств);
	
	Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);			   
	Запрос.УстановитьПараметр("ДатаСреза",ДатаСреза);			   
	Запрос.УстановитьПараметр("Организация",Организация);			   
	
	Возврат Запрос.Выполнить().Выгрузить();

	
КонецФункции // СоздатьТаблицуСоотвествияСчетовРСБУиМСФО()

//БИТ Тртилек 13.09.2012 Получим соответствие документ-основноесредство из таблицы подбора
Функция бит_му_ПолучитьСоотношениеДокументОсновноеСредство(Таблица) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВнешняяТаблицаСоответствия.ДокументБУ,
	               |	ВЫБОР
	               |		КОГДА ВнешняяТаблицаСоответствия.ВНА = НЕОПРЕДЕЛЕНО
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
				   |  		КОГДА ВнешняяТаблицаСоответствия.ВНА ЕСТЬ NULL
	               |			ТОГДА ЗНАЧЕНИЕ(Справочник.ОсновныеСредства.ПустаяСсылка)
				   |		ИНАЧЕ ВнешняяТаблицаСоответствия.ВНА
	               |	КОНЕЦ КАК ВНА
	               |ПОМЕСТИТЬ ВТТаблицаСоответствия
	               |ИЗ
	               |	&ТаблицаОбработки КАК ВнешняяТаблицаСоответствия
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТаблицаСоответствия.ДокументБУ,
	               |	ВТТаблицаСоответствия.ВНА
	               |ИЗ
	               |	ВТТаблицаСоответствия КАК ВТТаблицаСоответствия
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТТаблицаСоответствия.ДокументБУ,
	               |	ВТТаблицаСоответствия.ВНА";
				   
				   
	Запрос.УстановитьПараметр("ТаблицаОбработки", Таблица);							
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции
    
//БИТ Тртилек 20.12.12 В процедуре вызывается форма дозаполнения недостающих настроек МСФО
//МассивНастроек - массив строковых значений настроек
//ИмяГруппы - строковое значение
Функция ДозаполнитьНедостающиеНастройки(МассивНастроек, ИмяГруппы, ВызовСКлиента = Ложь) Экспорт
	
	// 1c-izhtc spawn 12.08.15 (
	Если НЕ ВызовСКлиента Тогда 
		ВызватьИсключение "Необходимо использовать процедуру ДозаполнитьНедостающиеНастройки из общего модуля бит_му_ОбщийКлиент!";
	КонецЕсли;
	// 1c-izhtc spawn 12.08.15 )
	
	НаборНастроек = РегистрыСведений.бит_му_Настройки.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.Группа.Установить(ИмяГруппы);
	НаборНастроек.Прочитать();
	
	ТаблицаИмеющихсяНастроек = НаборНастроек.Выгрузить();
	
	ТаблицаДоНастроек = Новый ТаблицаЗначений;
	ТаблицаДоНастроек.Колонки.Добавить("ИмяНастройки");
	ТаблицаДоНастроек.Колонки.Добавить("Значение");
	
	Для Каждого ПроверяемаяНастройка Из МассивНастроек Цикл
		
		НайденнаяСтрока = ТаблицаИмеющихсяНастроек.Найти(ПроверяемаяНастройка, "ИмяНастройки");
		
		Если НайденнаяСтрока = Неопределено Тогда
			НоваяСтрока = ТаблицаДоНастроек.Добавить();
			НоваяСтрока.ИмяНастройки = ПроверяемаяНастройка;       
		КонецЕсли;
		
	КонецЦикла;
	
	Если ТаблицаДоНастроек.Количество() > 0 Тогда
		
		// 1c-izhtc spawn 12.08.15 (
		//ФормаДозаполнения = ПолучитьФорму("ОбщаяФорма.бит_му_ФормаДозаполненияНастроек");
		//
		//ЗначениеВДанныеФормы(ТаблицаДоНастроек , ФормаДозаполнения.ТЧНедостающиеНастройки);
		//ФормаДозаполнения.Группа = ИмяГруппы;
		//
		//ФормаДозаполнения.ОткрытьМодально();
		Возврат ПоместитьВоВременноеХранилище(ТаблицаДоНастроек, Новый УникальныйИдентификатор);
		// 1c-izhtc spawn 12.08.15 )
		
	КонецЕсли;
	
	Возврат Неопределено; // 1c-izhtc spawn 12.08.15
	
КонецФункции

// BIT Avseenkov 15052014 /Доработка функцонала по уастку основных средств {
Функция бит_му_ПолучитьДвиженияПоХозрасчетномуРегистру07_0804(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Комплектация.АналитикаРСБУ,
	               |	Комплектация.ДокументРСБУ КАК ДокументРСБУ1,
	               |	ВложенныйЗапрос.Сумма,
	               |	ВложенныйЗапрос.ДокументРСБУ,
	               |	ВложенныйЗапрос.ОбъектСтроительства,
	               |	ВложенныйЗапрос.СубконтоДт1,
	               |	ВложенныйЗапрос.СчетКт,
	               |	ВложенныйЗапрос.СубконтоКт1,
	               |	ВложенныйЗапрос.СубконтоДт2,
	               |	ВложенныйЗапрос.СубконтоКт2,
	               |	ВложенныйЗапрос.СчетРСБУ,
	               |	ВложенныйЗапрос.СчетДт
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Сумма КАК Сумма,
	               |		ВложенныйЗапрос.ДокументРСБУ КАК ДокументРСБУ,
	               |		ВложенныйЗапрос.ОбъектСтроительства КАК ОбъектСтроительства,
	               |		ВложенныйЗапрос.СубконтоДт1 КАК СубконтоДт1,
	               |		ВложенныйЗапрос.СчетКт КАК СчетКт,
	               |		ВложенныйЗапрос.СубконтоКт1 КАК СубконтоКт1,
	               |		ВложенныйЗапрос.СубконтоДт2 КАК СубконтоДт2,
	               |		ВложенныйЗапрос.СубконтоКт2 КАК СубконтоКт2,
	               |		ВложенныйЗапрос.СчетРСБУ КАК СчетРСБУ,
	               |		ВложенныйЗапрос.СчетДт КАК СчетДт
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	               |						ИЛИ ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.МодернизацияОС
	               |					ТОГДА ХозрасчетныйДвиженияССубконто.СчетКт
	               |				ИНАЧЕ ХозрасчетныйДвиженияССубконто.СчетДт
	               |			КОНЕЦ КАК СчетРСБУ,
	               |			ХозрасчетныйДвиженияССубконто.СубконтоДт1 КАК СубконтоДт1,
	               |			ХозрасчетныйДвиженияССубконто.СубконтоДт2 КАК СубконтоДт2,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	               |						ИЛИ ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.МодернизацияОС
	               |					ТОГДА ХозрасчетныйДвиженияССубконто.СчетДт
	               |				ИНАЧЕ ХозрасчетныйДвиженияССубконто.СчетКт
	               |			КОНЕЦ КАК СчетКт,
	               |			ХозрасчетныйДвиженияССубконто.Сумма КАК Сумма,
	               |			ХозрасчетныйДвиженияССубконто.Регистратор КАК ДокументРСБУ,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	               |						ИЛИ ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.МодернизацияОС
	               |					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2.Объект
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств)
	               |							ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |						ИНАЧЕ ХозрасчетныйДвиженияССубконто.СубконтоДт2.Объект
	               |					КОНЕЦ
	               |			КОНЕЦ КАК ОбъектСтроительства,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	               |						ИЛИ ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.МодернизацияОС
	               |					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |				ИНАЧЕ ВЫБОР
	               |						КОГДА ХозрасчетныйДвиженияССубконто.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.СтроительствоОбъектовОсновныхСредств)
	               |							ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт1
	               |						ИНАЧЕ ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |					КОНЕЦ
	               |			КОНЕЦ КАК СубконтоКт1,
	               |			ВЫБОР
	               |				КОГДА ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.ПринятиеКУчетуОС
	               |						ИЛИ ХозрасчетныйДвиженияССубконто.Регистратор ССЫЛКА Документ.МодернизацияОС
	               |					ТОГДА ХозрасчетныйДвиженияССубконто.СубконтоКт2.Объект
	               |				ИНАЧЕ ХозрасчетныйДвиженияССубконто.СубконтоДт1
	               |			КОНЕЦ КАК СубконтоКт2,
	               |			ХозрасчетныйДвиженияССубконто.СчетДт КАК СчетДт
	               |		ИЗ
	               |			РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	               |					,
	               |					,
	               |					Счет В (&СписокСчетов)
	               |						И Регистратор В (&СписокДокументов),
	               |					,
	               |					) КАК ХозрасчетныйДвиженияССубконто
	               |		ГДЕ
	               |			ХозрасчетныйДвиженияССубконто.Сумма <> 0) КАК ВложенныйЗапрос) КАК ВложенныйЗапрос
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			бит_му_КомплектацияОС.АналитикаРСБУ КАК АналитикаРСБУ,
	               |			бит_му_КомплектацияОС.ДокументРСБУ КАК ДокументРСБУ
	               |		ИЗ
	               |			РегистрНакопления.бит_му_КомплектацияОС КАК бит_му_КомплектацияОС
	               |		ГДЕ
	               |			бит_му_КомплектацияОС.ДокументРСБУ В(&СписокДокументов)
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			бит_му_КомплектацияОС.АналитикаРСБУ,
	               |			бит_му_КомплектацияОС.ДокументРСБУ) КАК Комплектация
	               |		ПО ВложенныйЗапрос.ДокументРСБУ = Комплектация.ДокументРСБУ
	               |			И ВложенныйЗапрос.ОбъектСтроительства = Комплектация.АналитикаРСБУ
	               |ГДЕ
	               |	Комплектация.АналитикаРСБУ ЕСТЬ NULL 
	               |	И Комплектация.ДокументРСБУ ЕСТЬ NULL ";
				   
				   
	СписокСчетов = Новый СписокЗначений();
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОборудованиеКУстановке);
	//СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеОбъектовОсновныхСредств);
	СписокСчетов.Добавить(ПланыСчетов.Хозрасчетный.ПриобретениеКомпонентовОсновныхСредств);    //ОК Довбешка Т. 17.04.2017 исправление ошибки после обновления релиза
	Запрос.УстановитьПараметр("СписокСчетов",СписокСчетов);	
	Запрос.УстановитьПараметр("СписокДокументов",МассивДокументов);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
	
КонецФункции


// BIT AMerkulov 10072014
Функция ПолучитьСоставПериметраКонсолидацииСУсловиямиДляОсновногоПараметра(ПериметрКонсолидации, ПериодНачало, ПериодКонец) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |ИЗ
	               |	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(
	               |			&ПериодКонец,
	               |			ПериметрКонсолидации = &ПериметрКонсолидации
	               |				И НЕ Организация В
	               |						(ВЫБРАТЬ
	               |							бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |						ИЗ
	               |							РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&ПериодКонец, ПериметрКонсолидации = &ПериметрКонсолидации
	               |								И НЕ Организация В
	               |										(ВЫБРАТЬ
	               |											бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |										ИЗ
	               |											РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&НачалоПериод, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |										ГДЕ
	               |											(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &НачалоПериод
	               |												ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата))) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |			
	               |						ОБЪЕДИНИТЬ ВСЕ
	               |			
	               |						ВЫБРАТЬ
	               |							бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |						ИЗ
	               |							РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&ПериодКонец, ПериметрКонсолидации = &ПериметрКонсолидации
	               |								И НЕ Организация В
	               |										(ВЫБРАТЬ
	               |											бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |										ИЗ
	               |											РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&ПериодКонец, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |										ГДЕ
	               |											(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ПериодКонец
	               |												ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата))) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |						ГДЕ
	               |							НАЧАЛОПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &НачалоПериод)) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |ГДЕ
	               |	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ПериодКонец
	               |			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("НачалоПериод", 			ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", 	ПериодКонец);
	Запрос.УстановитьПараметр("ПустаяДата",				Дата('00010101'));
	Запрос.УстановитьПараметр("ПериметрКонсолидации", 	ПериметрКонсолидации);

	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

// BIT Amerkulov 13072014 /Использование периметров ++
Функция ПолучитьСоставПериметраКонсолидацииСУсловиями(ПериметрКонсолидации, ПериодНачало, ПериодКонец) Экспорт

	ТекстЗапроса = "ВЫБРАТЬ
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Период,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания
	               |ПОМЕСТИТЬ ВР_Итог
	               |ИЗ
	               |	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(
	               |			&ПериодКонец,
	               |			ПериметрКонсолидации = &ПериметрКонсолидации
	               |				И НЕ Организация В
	               |						(ВЫБРАТЬ
	               |							бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |						ИЗ
	               |							РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&НачалоПериод, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |						ГДЕ
	               |							(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ПериодКонец
	               |								ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата))) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |ГДЕ
	               |	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &НачалоПериод
	               |			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Период
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация,
	               |	&ПустаяДата,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания
	               |ИЗ
	               |	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(
	               |			&ПериодКонец,
	               |			ПериметрКонсолидации = &ПериметрКонсолидации
	               |				И НЕ Организация В
	               |						(ВЫБРАТЬ
	               |							бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	               |						ИЗ
	               |							РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&ПериодКонец, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |						ГДЕ
	               |							(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &ПериодКонец
	               |								ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата))) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	               |ГДЕ
	               |	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &НачалоПериод
	               |			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = &ПустаяДата)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация,
	               |	бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВР_Итог.Организация,
	               |	МАКСИМУМ(ВР_Итог.Период) КАК Период,
	               |	МАКСИМУМ(ВР_Итог.ДатаОкончания) КАК ДатаОкончания,
	               |	&НачалоПериод,
	               |	&ПериодКонец
	               |ИЗ
	               |	ВР_Итог КАК ВР_Итог
	               |ГДЕ
	               |	КОНЕЦПЕРИОДА(ВР_Итог.Период, ДЕНЬ) >= &НачалоПериод
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВР_Итог.Организация";

	
	Запрос = Новый Запрос(ТекстЗапроса);
	
	Запрос.УстановитьПараметр("НачалоПериод", 			ПериодНачало);
	Запрос.УстановитьПараметр("ПериодКонец", 	ПериодКонец);
	Запрос.УстановитьПараметр("ПустаяДата",				Дата('00010101'));
	Запрос.УстановитьПараметр("ПериметрКонсолидации", 	ПериметрКонсолидации);

	
	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции


