#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОграничитьТипАналитики();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементов

&НаКлиенте
Процедура Тип1СПриИзменении(Элемент)
	ОграничитьТипАналитики();
КонецПроцедуры

&НаКлиенте
Процедура Тип1СОчистка(Элемент, СтандартнаяОбработка)
	Запись.Аналитика1С = Неопределено;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОграничитьТипАналитики()
	
	ТипАналитики =  Запись.Тип1С.ТипЗначенияОбъекта.Получить();
	Если Найти(ТипАналитики, "набор записей") > 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ТипАналитики) = Тип("Тип") Тогда
		Массив	=	Новый Массив;
		Массив.Добавить(ТипАналитики);
		
		Элементы.Аналитика1С.ОграничениеТипа	=	Новый ОписаниеТипов(Массив);
		Запись.Аналитика1С						=	Элементы.Аналитика1С.ОграничениеТипа.ПривестиЗначение(Запись.Аналитика1С);
		Элементы.Аналитика1С.ВыбиратьТип		=	Ложь;
	Иначе
		Элементы.Аналитика1С.ОграничениеТипа	=	Новый ОписаниеТипов;
		Запись.Аналитика1С 						=	Элементы.Аналитика1С.ОграничениеТипа.ПривестиЗначение(Запись.Аналитика1С);
		Элементы.Аналитика1С.ВыбиратьТип		=	Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти