//ОКЕЙ Вдовиченко Г.В(СофтЛаб) 2019-09-20 (#3414)

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Организация", Организация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Организация));
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияОчистка(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Контрагент", Контрагент, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Контрагент));
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОчистка(Элемент, СтандартнаяОбработка)
	
	Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьРеестра(Команда)
	
	ВыделенныеСтроки = ок_УправлениеФормамиКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Контрагенты = Неопределено;
	ТабличныеДокументы = СформироватьРеестрыПроблемныхДокументов(ВыделенныеСтроки, Контрагенты);
	
	Если ТабличныеДокументы = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	
	ИдентификаторПечатнойФормы = "ПечатнаяФорма";
	НазваниеПечатнойФормы = "Реестр проблемных документов ";
	
	ИдентификаторыПФ = Новый Массив;
	Ном = 0;
	Для каждого ТабличныйДокумент из ТабличныеДокументы Цикл
		ИдентификаторыПФ.Добавить(ИдентификаторПечатнойФормы + Ном);
		Ном = Ном + 1;
	КонецЦикла;	
	
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм(ИдентификаторыПФ);
	
	Ном = 0;
	Для каждого ТабличныйДокумент из ТабличныеДокументы Цикл
		
		ПечатнаяФорма = УправлениеПечатьюКлиент.ОписаниеПечатнойФормы(КоллекцияПечатныхФорм, ИдентификаторПечатнойФормы + Ном);
		ПечатнаяФорма.СинонимМакета         = НазваниеПечатнойФормы + " " + Контрагенты[Ном];
		ПечатнаяФорма.ТабличныйДокумент     = ТабличныйДокумент;
		ПечатнаяФорма.ИмяФайлаПечатнойФормы = НазваниеПечатнойФормы + " " + Контрагенты[Ном];
		Ном = Ном + 1;
		
	КонецЦикла;	
	
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
	
КонецПроцедуры

&НаСервере
Функция СформироватьРеестрыПроблемныхДокументов(МассивДокументов, Контрагенты)
	
	Контрагенты = Неопределено;
	
	Возврат ок_ОбменСКонтрагентамиВнутренний.СформироватьРеестрыПроблемныхДокументов(МассивДокументов, Контрагенты);
	
КонецФункции	

&НаКлиенте
Процедура ОтправитьПисьма(Команда)
	
	ВыделенныеСтроки = ок_УправлениеФормамиКлиент.ПроверитьПолучитьВыделенныеВСпискеСсылки(Элементы.Список);
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОтправитьПисьмаНаСервере(ВыделенныеСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьПисьмаНаСервере(ВыделенныеСтроки)
	
	//Контрагенты = Неопределено;
	//ТабличныеДокументы = СформироватьРеестрыПроблемныхДокументов(ВыделенныеСтроки, Контрагенты);
	//
	//Если ТабличныеДокументы = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;	

	//Шаблон = ок_ОбменСКонтрагентамиВнутренний.УниверсальнаяНастройка("Документооборот", "Шаблон реестра проблемных документов");	
	//Если Не ЗначениеЗаполнено(Шаблон) Тогда
	//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не заполнена настройка: Документооборот/Шаблон реестра проблемных документов");
	//	Возврат;
	//КонецЕсли;
	//
	//ШаблонОшибки = НСтр("ru='Не удалось отправить письмо контрагенту %Контрагент%. %ОписаниеОшибки%'");
	//
	//Ном = 0;
	//Для каждого ТабличныйДокумент из ТабличныеДокументы Цикл
	//	
	//	Ном = Ном + 1;
	//	
	//	СообщениеОбОшибке = "";
	//	
	//	Вложения = Новый Массив;
	//	Вложения.Добавить(Новый Структура("ИмяФайла, Файл", "Реестр документов.pdf", ТабличныйДокумент));
	//	
	//	Отправлено = ок_ОбменСКонтрагентамиВнутренний.ОтправитьПисьмоКонтрагентуПоШаблону(Контрагенты[Ном - 1], Шаблон, Вложения, , СообщениеОбОшибке);
	//	Если Не Отправлено Тогда
	//		ТекстОшибки = СтрЗаменить(ШаблонОшибки, "%Контрагент%", Контрагенты[Ном - 1]);
	//		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", СообщениеОбОшибке);
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	//	КонецЕсли;	
	//	
	//КонецЦикла;	
	
	ок_ОбменСКонтрагентамиВнутренний.ОтправитьПисьмаРеестрыПроблемныхДокументов(ВыделенныеСтроки);
	
КонецПроцедуры
	