#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки	 - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
	
// Функция получает максимально доступное количество субконто для настройки.
// 
// Параметры:
// 
// Возвращаемое значение:
//  КоличествоСубконто - Число.
// 
Функция ПолучитьМаксимальноеКоличествоСубконтоНастройки() Экспорт

	КоличествоСубконто = 4;

	Возврат КоличествоСубконто;
	
КонецФункции // ПолучитьМаксимальноеКоличествоСубконтоНастройки()

// Функция получает максимально доступное количество ресурсов для настройки.
// 
// Параметры:
// 
// Возвращаемое значение:
//  КоличествоРесурсов - Число.
// 
Функция ПолучитьМаксимальноеКоличествоРесурсовНастройки() Экспорт

	КоличествоРесурсов = 4;

	Возврат КоличествоРесурсов;
	
КонецФункции // ПолучитьМаксимальноеКоличествоРесурсовНастройки()

// Функция формирует список субконто.
// 
// Параметры:
//  КоличествоСубконто - Число
//  ЕстьПодразделение - Булево
// 
// Возвращаемое значение:
//  СписокСубконто - СписокЗначений.
// 
Функция СформироватьСписокСубконто(КоличествоСубконто, ЕстьПодразделение) Экспорт
	
	СписокСубконто = Новый СписокЗначений;
	
	Для  н = 1 По КоличествоСубконто Цикл
		
		СписокСубконто.Добавить("Субконто"+н,  НСтр("ru = 'Субконто'")+н);
		
	КонецЦикла; 
	
	Если ЕстьПодразделение Тогда
		
		СписокСубконто.Добавить("Подразделение",  НСтр("ru = 'Подразделение'"));
		
	КонецЕсли; 
	
	Возврат СписокСубконто;
	
КонецФункции // СформироватьСписокСубконто()

// Процедура формирует список способов заполнения субконто при закрытии.
// 
// Параметры:
//  СпособыЗаполнения        - СписокЗначений.
//  СпособыЗаполненияПростой - СписокЗначений.
//  КоличествоСубконто       - Число.
// 
Процедура СформироватьСписокСпособовЗаполненияСубконто(СпособыЗаполнения
	                                                    , СпособыЗаполненияПростой
														, КоличествоСубконто
														, ЕстьПодразделение) Экспорт
	
														
	СпособыЗаполнения.Очистить();
	СпособыЗаполненияПростой.Очистить();
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		СпособыЗаполнения.Добавить("ДанныеСубконто"    + Ном);
		СпособыЗаполненияПростой.Добавить("Субконто"   + Ном);
		
	КонецЦикла;
	
	Если ЕстьПодразделение  Тогда
		
		СпособыЗаполнения.Добавить("ДанныеПодразделение");
		СпособыЗаполненияПростой.Добавить("Подразделение");
		
	КонецЕсли;	
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		СпособыЗаполнения.Добавить("ДанныеКорСубконто" + Ном);
		СпособыЗаполненияПростой.Добавить("КорСубконто" + Ном);
		
	КонецЦикла;
	
	Если ЕстьПодразделение  Тогда
		
		СпособыЗаполнения.Добавить("ДанныеКорПодразделение");
		СпособыЗаполненияПростой.Добавить("КорПодразделение");
		
	КонецЕсли;	
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		СпособыЗаполнения.Добавить("БазаСубконто"      + Ном);
		
	КонецЦикла;
	
	Если ЕстьПодразделение Тогда
		
		СпособыЗаполнения.Добавить("БазаПодразделение");
		
	КонецЕсли;
	
	Для Ном = 1 По КоличествоСубконто Цикл
		
		СпособыЗаполнения.Добавить("БазаКорСубконто"   + Ном);
		
	КонецЦикла;
	
	Если ЕстьПодразделение Тогда
		
		СпособыЗаполнения.Добавить("БазаКорПодразделение");
		
	КонецЕсли;	
	
	СпособыЗаполнения.Добавить("Явно",  НСтр("ru = 'Указано явно'"));
	СпособыЗаполненияПростой.Добавить("Явно", НСтр("ru = 'Указано явно'"));
	
КонецПроцедуры // СформироватьСписокСпособовЗаполненияСубконто()

#КонецОбласти 	

#КонецЕсли