
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов.
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов.
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма, Объект);
	
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МинутыВоВремя();	
	
	фКэшЗначений = Новый Структура;
	
	МассивТипов  = Объект.Ссылка.Метаданные().Реквизиты.ОбъектСвязи.Тип.Типы();
	СписокВыбора = бит_ОбщегоНазначения.ПодготовитьСписокВыбораТипа(МассивТипов);
	
	фКэшЗначений.Вставить("СписокТиповОбъектСвязи",СписокВыбора);	
	//+СБ Пискунова 22.12.2016 #2691 
	//Добавим реквизиты на формы
	СБ_РаботаСФормамиОбъекты.бит_ВизыФормаЭлементаПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//-СБ Пискунова 22.12.2016 #2691
	
КонецПроцедуры // ПриСозданииНаСервере()

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-01-29 (#2971)
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОК_СложнаяВиза = ЗначениеЗаполнено(Объект.ОК_ИсточникСложнойВизы);
	УстановитьВидимостьИсточникаСложнойВизы();
	
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
	
КонецПроцедуры                     
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-01-29 (#2971)

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидСвязиПриИзменении(Элемент)
	
	ИзменениеВидаСвязи();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСвязиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	                                                   ,Элемент
	                                                   ,Объект
	                                                   ,"ОбъектСвязи"
													   ,фКэшЗначений.СписокТиповОбъектСвязи
													   ,СтандартнаяОбработка);
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСвязиОчистка(Элемент, СтандартнаяОбработка)
	
	ИзменениеВидаСвязи();
	
	Если Объект.ОбъектСвязи = Неопределено Тогда
		
		Элемент.ВыбиратьТип = Истина;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_ДниПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_ЧасыПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

&НаКлиенте
Процедура фВремя_МинутыПриИзменении(Элемент)
	
	ВычислитьВремяНаУстановку();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура раскладывает время на установку на дни, часы и минуты.
// 
&НаСервере
Процедура МинутыВоВремя()

	// Заполним поля редактирования времени
	СтрВремя = бит_ОбщегоНазначенияКлиентСервер.МинутыВоВремя(Объект.ВремяНаУстановку);
	фВремя_Дни    = СтрВремя.Дни;
	фВремя_Часы   = СтрВремя.Часы;
	фВремя_Минуты = СтрВремя.Минуты;

КонецПроцедуры // МинутыВоВремя()

// Обрабатывает изменение вида связи. 
// 
&НаСервере
Процедура ИзменениеВидаСвязи()

	ДокОб = РеквизитФормыВЗначение("Объект");
	ДокОб.ИзменениеВидаСвязи();
	ЗначениеВРеквизитФормы(ДокОб, "Объект");

КонецПроцедуры // ИзменениеВидаСвязи()

//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2018-01-29 (#2971)
&НаКлиенте
Процедура ОК_СложнаяВизаПриИзменении(Элемент)
	
	УстановитьВидимостьИсточникаСложнойВизы();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьИсточникаСложнойВизы()
	
	Если ОК_СложнаяВиза Тогда 
		Элементы.ОК_СложнаяВиза.Заголовок = "Источник сложной визы";
		Элементы.СтраницыСложнойВизы.ТекущаяСтраница = Элементы.СтраницаИсточникСложнойВизы;
	Иначе
		Элементы.ОК_СложнаяВиза.Заголовок = "Сложная виза";
		Объект.ОК_ИсточникСложнойВизы	  = Неопределено;
		Элементы.СтраницыСложнойВизы.ТекущаяСтраница = Элементы.ПустаяСтраницаСложнойВизы;
	КонецЕсли;
	
КонецПроцедуры

//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2018-01-29 (#2971)

// Процедура Вычисляет время на установку визы в минутах.
// 
&НаКлиенте
Процедура ВычислитьВремяНаУстановку()

	СтрВремя = Новый Структура("Дни,Часы,Минуты",фВремя_Дни,фВремя_Часы,фВремя_Минуты);
	Объект.ВремяНаУстановку = бит_ОбщегоНазначенияКлиентСервер.ВремяВМинуты(СтрВремя);
	
КонецПроцедуры // ВычислитьВремяНаУстановку()

//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Начало (#3499)
// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
    УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
    УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства
//ОКЕЙ Рычаков А.С.(СофтЛаб)2019-10-07 Конец (#3499)

#КонецОбласти
