
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	фСписокТиповСтруктурноеПодразделение = Новый СписокЗначений;
	ИзмерениеСтруктурноеПодразделение = Метаданные.РегистрыСведений.бит_НастройкиПрограммы.Измерения.СтруктурноеПодразделение;
	фСписокТиповСтруктурноеПодразделение.ЗагрузитьЗначения(ИзмерениеСтруктурноеПодразделение.Тип.Типы());
	
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	бит_РаботаСДиалогамиКлиент.НачалоВыбораСоставного(ЭтаФорма
	                                                   , Элемент
	                                                   , Запись
	                                                   , "СтруктурноеПодразделение"
													   , фСписокТиповСтруктурноеПодразделение
													   , СтандартнаяОбработка);
													   
КонецПроцедуры // СтруктурноеПодразделениеНачалоВыбора()

&НаКлиенте
Процедура СтруктурноеПодразделениеОчистка(Элемент, СтандартнаяОбработка)
	
	Элемент.ВыбиратьТип = Истина;
	
КонецПроцедуры // СтруктурноеПодразделениеОчистка()

#КонецОбласти
