
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.СписокПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ТекстСообщения = НСтр("ru = 'Подобрать валютную операцию из перечня?'");
	
	ДополнительныеПараметры = Новый Структура;
	Если Копирование Тогда
		ДополнительныеПараметры.Вставить("ЗначениеКопирования", Элемент.ТекущаяСтрока);
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ВопросПодобратьЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, ТекстСообщения, РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

// Процедура окончание процедуры "СписокПередНачаломДобавления". 
//
// Параметры:
//  Ответ - КодВозвратаДиалога.
//  ДополнительныеДанные - Структура.
//
&НаКлиенте 
Процедура ВопросПодобратьЗавершение(Ответ, ДополнительныеДанные) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПодборИзПеречня(Неопределено);
	Иначе
		ОткрытьФорму("Справочник.бит_ВидыВалютныхОпераций.Форма.ФормаЭлемента", ДополнительныеДанные, ЭтаФорма);
	КонецЕсли;
                
КонецПроцедуры // ВопросПодобратьЗавершение()

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПодборИзПеречня(Команда)

	ОткрытьФорму("Справочник.бит_ВидыВалютныхОпераций.Форма.ДобавлениеЭлементовВПеречень", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти
