
#Область ОбработчикиСобытийФормы

// BIT AMerkulov 26062014 ++

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
  	бит_РаботаСДиалогамиСервер.ФормаВыбораПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры // ПриСозданииНаСервере()

// BIT AMerkulov 26062014 --	
	
//izhtc-Kir 08.09.2015 (
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
		Если ЭтаФорма.ВладелецФормы.Родитель.Родитель.Родитель.ИмяФормы = "РегистрСведений.бит_СоответствияАналитик.Форма.ФормаЗаписи" Тогда
			Если Найти(ЭтаФорма.ВладелецФормы.Имя, "ПраваяАналитика_") > 0 Тогда
				Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
				Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
				ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТипСтатьи");
				ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение 	= ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДДС");
				ЭлементОтбора.Использование		= Истина;
			ИначеЕсли Найти(ЭтаФорма.ВладелецФормы.Имя, "ЛеваяАналитика_") > 0 Тогда
				Список.КомпоновщикНастроек.Настройки.Отбор.Элементы.Очистить();
				Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Очистить();
				ЭлементОтбора = Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("ТипСтатьи");
				ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
				ЭлементОтбора.ПравоеЗначение 	= ПредопределенноеЗначение("Перечисление.бит_ТипыСтатейОборотов.БДР");
				ЭлементОтбора.Использование		= Истина;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;
КонецПроцедуры

#КонецОбласти


                 