#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)

	СписокПараметровНаФорме = Новый СписокЗначений;
	ИмяОтчета = ЭтотОбъект.Метаданные().Имя; 
	Отчеты[ИмяОтчета].ЗаполнитьДополнительныеСписки(СписокПараметровНаФорме);
	
	Для каждого ЭлементСписка Из СписокПараметровНаФорме Цикл
		
		ИмяПараметра = ЭлементСписка.Значение;
		бит_ОтчетыСервер.УстановитьЗначениеПараметраКомпоновщика(КомпоновщикНастроек, 
																 ЭтотОбъект[ИмяПараметра], 
																 ИмяПараметра);
		
	КонецЦикла;  	
															 
	// Необходимо установить границу программно, т.к. непосредственно в СКД это невозможно.
	бит_ОтчетыСервер.УстановитьГраницыПериода(КомпоновщикНастроек, "СтандартныйПериод");
	// Начало периода.
	Параметр =	КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Если Параметр <> Неопределено  И Параметр.Значение = Дата('00010101') Тогда
		Параметр.Значение = Дата('00010101000001');
	КонецЕсли; 
			
КонецПроцедуры // ПриКомпоновкеРезультата()

#КонецОбласти

#КонецЕсли
