// БИТ_YK_н Доработка #2084
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ИмяОбработки = Неопределено;
	ОткрытьОтчетОДвиженииДенежныхСредств(ИмяОбработки);
	Если ИмяОбработки <> Неопределено Тогда
		ОткрытьФорму("ВнешнийОтчет."+ ИмяОбработки +".Форма");	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОткрытьОтчетОДвиженииДенежныхСредств(ИмяОбработки) 
	имяотчета_="Отчет о движении денежных средств";
	попытка
		ИмяФайла = ПолучитьИмяВременногоФайла("erf");		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", имяотчета_);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		Иначе
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			ОтчетСсылка = Выборка.Ссылка;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ОтчетСсылка);					
	исключение
	конецпопытки;	
КонецПроцедуры
// БИТ_YK_к


