Функция ок_ПолучитьОбъектИФункцию(ФизическиеЛица, Организация, ДатаДокумента)    экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.Организация КАК Организация,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.КодБОСС КАК КодБОСС,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.Функция КАК Функция,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.Объект КАК Объект,
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.КодПриемаНаРаботу КАК КодПриемаНаРаботу
	                |ПОМЕСТИТЬ ВТ_СрезПоследних
	                |ИЗ
	                |	РегистрСведений.ок_ДанныеФизическихЛицБОСС.СрезПоследних(
	                |			&ДатаДокумента,
	                |			Организация = &Организация
	                |				И ФизическоеЛицо В (&ФизическиеЛица)) КАК ок_ДанныеФизическихЛицБОСССрезПоследних
	                |ГДЕ
	                |	ок_ДанныеФизическихЛицБОСССрезПоследних.ДатаПриема <= &ДатаДокумента
	                |	И ок_ДанныеФизическихЛицБОСССрезПоследних.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	                |	И (ок_ДанныеФизическихЛицБОСССрезПоследних.ДатаУвольнения > &ДатаДокумента
	                |			ИЛИ ок_ДанныеФизическихЛицБОСССрезПоследних.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1))
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_СрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	                |	ВТ_СрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	                |	ВТ_СрезПоследних.Организация КАК Организация,
	                |	ВТ_СрезПоследних.КодБОСС КАК КодБОСС,
	                |	МАКСИМУМ(ВТ_СрезПоследних.КодПриемаНаРаботу) КАК КодПриемаНаРаботу
	                |ПОМЕСТИТЬ ВТ_Сгруппировано
	                |ИЗ
	                |	ВТ_СрезПоследних КАК ВТ_СрезПоследних
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	ВТ_СрезПоследних.ФизическоеЛицо,
	                |	ВТ_СрезПоследних.ТабельныйНомер,
	                |	ВТ_СрезПоследних.Организация,
	                |	ВТ_СрезПоследних.КодБОСС
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_СрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	                |	ВТ_СрезПоследних.ТабельныйНомер КАК ТабельныйНомер,
	                |	ВТ_СрезПоследних.Организация КАК Организация,
	                |	ВТ_СрезПоследних.КодБОСС КАК КодБОСС,
	                |	ВТ_СрезПоследних.Функция КАК Функция,
	                |	ВТ_СрезПоследних.Объект КАК Объект,
	                |	ВТ_СрезПоследних.КодПриемаНаРаботу КАК КодПриемаНаРаботу
	                |ИЗ
	                |	ВТ_СрезПоследних КАК ВТ_СрезПоследних
	                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сгруппировано КАК ВТ_Сгруппировано
	                |		ПО ВТ_СрезПоследних.ФизическоеЛицо = ВТ_Сгруппировано.ФизическоеЛицо
	                |			И ВТ_СрезПоследних.ТабельныйНомер = ВТ_Сгруппировано.ТабельныйНомер
	                |			И ВТ_СрезПоследних.Организация = ВТ_Сгруппировано.Организация
	                |			И ВТ_СрезПоследних.КодБОСС = ВТ_Сгруппировано.КодБОСС
	                |			И ВТ_СрезПоследних.КодПриемаНаРаботу = ВТ_Сгруппировано.КодПриемаНаРаботу";
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ФизическиеЛица", ФизическиеЛица);
	ОбъектИФункция = Запрос.Выполнить().Выгрузить();
	
	
	Возврат ОбъектИФункция;
	
КонецФункции

