
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура выполняет заполнение макета отчета
//
&НаСервере
Процедура СформироватьОтчет(// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ВыгрузкаЭксель = Ложь)
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаКонечныеОстатки = СформироватьТаблицуКонечныеОстатки();
	//ТаблицаНачальныеОстатки = СформироватьТаблицуНачальныеОстатки();
	// -СБ. Кузнецова С.
	ТаблицаОбороты = СформироватьТаблицуОбороты();
	// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаСпецКонечныеОстатки = СформироватьТаблицуСпецифическиеКонечныеОстатки();
	// -СБ. Кузнецова С.
	
	ТаблДок = Результат;
	ТаблДок.Очистить();
	Макет =РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	ОбластьПерваяКолонка = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаПоказатели");
	ОбластьКолонкаОрганизация = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаОрганизации");
	ОбластьКолонкаИтоги = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаИтоги");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)	
	Если ВыгрузкаЭксель И БезФормата Тогда
		Для i = 1 По ОбластьКолонкаОрганизация.ВысотаТаблицы Цикл
			ОбластьКолонкаОрганизация.Область(i, 1, i ,1).Формат = "";
		КонецЦикла;
		Для i = 1 По ОбластьКолонкаИтоги.ВысотаТаблицы Цикл
			ОбластьКолонкаИтоги.Область(i, 1, i ,1).Формат = "";
		КонецЦикла;
	КонецЕсли;
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	
	
	// первая колонка
	
	// часть "ОФП"
	ОбластьПерваяКолонка.Параметры.ЗаголовокОтчета = ?(Объект.ЯзыкОтчета = "Русский", "Отчет по группе компаний", "Report on the group of companies");
	ОбластьПерваяКолонка.Параметры.ПериметрКонсолидации = ?(Объект.ЯзыкОтчета = "Русский", "Периметр консолидации: ", "Consolidation perimeter: ") + Объект.ПериметрКонсолидации;
	ОбластьПерваяКолонка.Параметры.Период = ?(Объект.ЯзыкОтчета = "Русский", "Период: ", "Period: ") + ПолучитьНадписьПериода();
	ОбластьПерваяКолонка.Параметры.ТысячиРублей = ?(Объект.ЯзыкОтчета = "Русский", "В тыс. руб", "In thousand RUR");	
	
	ОбластьПерваяКолонка.Параметры.ЗаголовокТаблицы = ?(Объект.ЯзыкОтчета = "Русский", "Статья консолидированной отчетности", "Consolidated FS");
	ОбластьПерваяКолонка.Параметры.Активы = ?(Объект.ЯзыкОтчета = "Русский", "АКТИВЫ", "ASSETS");
	ОбластьПерваяКолонка.Параметры.ВнеоборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Внеоборотные активы", "Noncurrent assets");
	ОбластьПерваяКолонка.Параметры.ИнвестСобственность = ?(Объект.ЯзыкОтчета = "Русский", "Инвестиционная собственность", "Investment property");
	ОбластьПерваяКолонка.Параметры.ЗемляВИС = ?(Объект.ЯзыкОтчета = "Русский", "Земля в инвестиционной собственности", "Land IP");
	ОбластьПерваяКолонка.Параметры.ЗданияВИС = ?(Объект.ЯзыкОтчета = "Русский", "Здания в инвестиционной собственности", "Buildings IP");
	ОбластьПерваяКолонка.Параметры.ОС = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства", "Property, plant and equipment");
	ОбластьПерваяКолонка.Параметры.Земля = ?(Объект.ЯзыкОтчета = "Русский", "Земля", "Land");
	ОбластьПерваяКолонка.Параметры.Здания = ?(Объект.ЯзыкОтчета = "Русский", "Здания", "Buildings");
	ОбластьПерваяКолонка.Параметры.ХолодильноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Холодильное оборудование", "Refrigerating equipment");
	ОбластьПерваяКолонка.Параметры.ТехнологическоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Технологическое оборудование", "Production equipment");
	ОбластьПерваяКолонка.Параметры.СухоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Сухое оборудование", "Dry equipment");
	ОбластьПерваяКолонка.Параметры.СкладскоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Складское оборудование", "Warehouse equipment");
	ОбластьПерваяКолонка.Параметры.ОхранноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Охранное оборудование", "Security equipment");
	ОбластьПерваяКолонка.Параметры.РекламноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Рекламное оборудование", "Advertising equipment");
	ОбластьПерваяКолонка.Параметры.ITОборудование = ?(Объект.ЯзыкОтчета = "Русский", "IT оборудование", "IT equipment");
	ОбластьПерваяКолонка.Параметры.ИнженерноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Инженерное оборудование", "Engineering equipment");
	ОбластьПерваяКолонка.Параметры.ПрочееОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Прочее оборудование", "Other fixed assets");
	ОбластьПерваяКолонка.Параметры.ОСдо40тсч = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства до 40 тыс. руб.", "FA less than 40 RUB thousands");
	ОбластьПерваяКолонка.Параметры.НеотделимыеУлучшения = ?(Объект.ЯзыкОтчета = "Русский", "Неотделимые улучшения ", "Leasehold improvements");
	ОбластьПерваяКолонка.Параметры.Транспорт = ?(Объект.ЯзыкОтчета = "Русский", "Транспорт", "Vehicles");
	ОбластьПерваяКолонка.Параметры.Сооружения = ?(Объект.ЯзыкОтчета = "Русский", "Сооружения", "Constructions");
	ОбластьПерваяКолонка.Параметры.ОСдляПродажи = ?(Объект.ЯзыкОтчета = "Русский", "ОС, предназначенные для продажи", "FA available for sale");
	ОбластьПерваяКолонка.Параметры.НЗС = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство", "Construction in progress");
	ОбластьПерваяКолонка.Параметры.НЗСземля = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - земля", "CIP - land");
	ОбластьПерваяКолонка.Параметры.НЗСздания = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - здания", "CIP - buildings");
	ОбластьПерваяКолонка.Параметры.НЗСоборудование = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - оборудование", "CIP - machinery and equipment");
	//БИТ АКриштопов 10022016 -->>
	ОбластьПерваяКолонка.Параметры.ОСВПути = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства в пути", "Fixed assets in the way");
	//БИТ АКриштопов 10022016 <<--
	
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.АктивыВФормеПраваПользования = ?(Объект.ЯзыкОтчета = "Русский", "Активы в форме права пользования", " Right-of-use assets");
	ОбластьПерваяКолонка.Параметры.АктивыВФормеПраваПользованияЗемля = ?(Объект.ЯзыкОтчета = "Русский", "Активы в форме права пользования (земля)", " Right-of-use assets  - land");
	ОбластьПерваяКолонка.Параметры.АктивыВФормеПраваПользованияТорговыеПомещения = ?(Объект.ЯзыкОтчета = "Русский", "Активы в форме права пользования (торговые помещения)", " Right-of-use assets - trade premises");
	ОбластьПерваяКолонка.Параметры.АктивыВФормеПраваПользованияПрочее = ?(Объект.ЯзыкОтчета = "Русский", "Активы в форме права пользования (прочее)", " Right-of-use assets - others");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.Гудвил = ?(Объект.ЯзыкОтчета = "Русский", "Гудвилл", "Goodwill");
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	ОбластьПерваяКолонка.Параметры.ПраваАренды = ?(Объект.ЯзыкОтчета = "Русский", "Права аренды", "Leasehold rights");
	// -СБ Кузнецова С.
	ОбластьПерваяКолонка.Параметры.НМА = ?(Объект.ЯзыкОтчета = "Русский", "Нематериальные активы", "Intangible assets");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные инвестиции", "Long-term investments");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеИнвестицииВПаиИАкции = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные инвестиции в паи и акции компаний", "Investments in other companies");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеЗаймыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные займы выданные", "Long-term loans issued");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеДолговыеЦБ = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные долговые ценные бумаги", "Long-term bonds");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные инвестиции", "Other long-term investments");
	ОбластьПерваяКолонка.Параметры.ОтложенныеНалоговыеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Отложенные налоговые активы", "Deferred income tax asset");
	ОбластьПерваяКолонка.Параметры.ПрочиеВА = ?(Объект.ЯзыкОтчета = "Русский", "Прочие внеоборотные активы", "Other non-current assets");
	ОбластьПерваяКолонка.Параметры.ДолгосрочнаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочная дебиторская задолженность", "Other non-current receivables");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоОСиНМА = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по ОС и НМА", "Prepayments for PPE and IA");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоАренде = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по аренде (долгосрочные депозиты)", "Prepayments for rent (long-term deposits)");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеАвансыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные авансы выданные", "Other non-current advances issued");
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//ОбластьПерваяКолонка.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Первоначальная стоимость затрат по договорам аренды земли", "Initial cost of land lease");
	// -СБ Кузнецова С.
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные активы", "Other non-current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоВА = ?(Объект.ЯзыкОтчета = "Русский", "Итого внеоборотных активов", "Total non-current assets");

	ОбластьПерваяКолонка.Параметры.ОборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Оборотные активы", "Current assets");
	ОбластьПерваяКолонка.Параметры.Запасы = ?(Объект.ЯзыкОтчета = "Русский", "Запасы", "Inventories");
	ОбластьПерваяКолонка.Параметры.СырьеИМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Сырье и материалы", "Raw materials and other inventory");
	ОбластьПерваяКолонка.Параметры.НЗП = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное производство", "WIP");
	ОбластьПерваяКолонка.Параметры.ГотоваяПродукция = ?(Объект.ЯзыкОтчета = "Русский", "Готовая продукция и товары для перепродажи", "Finished goods and goods for resale");
	ОбластьПерваяКолонка.Параметры.ТоварыВПути = ?(Объект.ЯзыкОтчета = "Русский", "Товары в пути", "Goods in transit");
	ОбластьПерваяКолонка.Параметры.ИзменениеСтоимостиЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Изменение стоимости запасов", "Change of inventory cost");
	ОбластьПерваяКолонка.Параметры.КраткосрочнаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочная дебиторская задолженность", "Trade and other receivables");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПокупателейИЗаказчиков = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность покупателей и заказчиков", "Trade receivables");
	ОбластьПерваяКолонка.Параметры.НДСкВозмещению = ?(Объект.ЯзыкОтчета = "Русский", "НДС к возмещению", "VAT recoverable");
	ОбластьПерваяКолонка.Параметры.ПредоплатыВыданныеТекущие = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты выданные текущие", "Prepayments (related to ordinary activities)");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоНалогам = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по налогам", "Taxes prepaid");
	ОбластьПерваяКолонка.Параметры.ПрочаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прочая дебиторская задолженность (без бонусов от поставщиков)", "Other receivables");
	//БИТ АКриштопов 10022016 -->>
	ОбластьПерваяКолонка.Параметры.БонусыПолученныеОтПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Бонусы, полученные от поставщиков", "Bonuses received from suppliers");
	//БИТ АКриштопов 10022016 <<--
	ОбластьПерваяКолонка.Параметры.РезервПоСомнительнымДолгам = ?(Объект.ЯзыкОтчета = "Русский", "Резерв по сомнительным долгам", "less: provision for doubtful debts");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеФинансовыеВложения = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные финансовые вложения", "Short-term financial investments");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеЗаймыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные займы выданные", "Short-term loans issued");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеДолговыеЦБ = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные долговые ценные бумаги", "Short-term bonds ");
	ОбластьПерваяКолонка.Параметры.ПрочиеКраткосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Прочие краткосрочные инвестиции", "Other short-term investments");
	ОбластьПерваяКолонка.Параметры.ДСиЭквиваленты = ?(Объект.ЯзыкОтчета = "Русский", "Денежные средства и эквиваленты", "Cash and cash equivalents");
	ОбластьПерваяКолонка.Параметры.Касса = ?(Объект.ЯзыкОтчета = "Русский", "Касса", "Petty cash");
	ОбластьПерваяКолонка.Параметры.РасчетныйСчет = ?(Объект.ЯзыкОтчета = "Русский", "Расчетный счет", "Bank account");
	ОбластьПерваяКолонка.Параметры.ВалютныйСчет = ?(Объект.ЯзыкОтчета = "Русский", "Валютный счет", "Currency account");
	ОбластьПерваяКолонка.Параметры.СпецСчетаВБанках = ?(Объект.ЯзыкОтчета = "Русский", "Специальные счета в банках", "Special bank accounts");
	// +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
	ОбластьПерваяКолонка.Параметры.СпецСчетаВБанкахВВалюте = ?(Объект.ЯзыкОтчета = "Русский", "Специальные счета в банках (в валюте)", "Special bank accounts (in foreign currency)");
	// -СБ Кузнецова С.
	ОбластьПерваяКолонка.Параметры.ДСвПути = ?(Объект.ЯзыкОтчета = "Русский", "Денежные средства в пути", "Cash in transit");
	ОбластьПерваяКолонка.Параметры.ПрочиеОборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие оборотные активы", "Other current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоОборотныхАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Итого оборотных активов", "Total current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоАктивов = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО АКТИВОВ", "TOTAL ASSETS");

	ОбластьПерваяКолонка.Параметры.СобственныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Собственный капитал", "EQUITY");
	ОбластьПерваяКолонка.Параметры.АкционерныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Акционерный капитал", "Share capital");
	ОбластьПерваяКолонка.Параметры.ЭмиссионныйДоход = ?(Объект.ЯзыкОтчета = "Русский", "Эмиссионный доход", "Share premium");
	ОбластьПерваяКолонка.Параметры.СобственныеВыкупленныеАкции = ?(Объект.ЯзыкОтчета = "Русский", "Собственные выкупленные акции", "Treasury shares");
	ОбластьПерваяКолонка.Параметры.РезервыПоЗаконодательству = ?(Объект.ЯзыкОтчета = "Русский", "Резервы, создаваемые согласно с законодательством", "Legal reserve");
	ОбластьПерваяКолонка.Параметры.ДобавочныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Добавочный капитал", "Additional paid-in capital");
	ОбластьПерваяКолонка.Параметры.НераспределеннаяПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Нераспределенная прибыль", "Retained earnings");
	ОбластьПерваяКолонка.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет = ?(Объект.ЯзыкОтчета = "Русский", "Нераспределенная прибыль (убыток) прошлых лет", "Retained earnings - opening balance");
	ОбластьПерваяКолонка.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет = ?(Объект.ЯзыкОтчета = "Русский", "Корректировка нераспределенной прибыли (убытка) прошлых лет", "Adjustment to RE opening balance");
	ОбластьПерваяКолонка.Параметры.ПрибыльЗаГод = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль за год", "Retained earnings - current year profit");
	ОбластьПерваяКолонка.Параметры.РаспределениеАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Распределение активов", "Distributions to shareholders");
	ОбластьПерваяКолонка.Параметры.ОбъявленныеДивиденды = ?(Объект.ЯзыкОтчета = "Русский", "Объявленные дивиденды", "Dividends paid");
	ОбластьПерваяКолонка.Параметры.ДивидендыЗаПредыдущийПериод = ?(Объект.ЯзыкОтчета = "Русский", "Дивиденды за предыдущий период", "Dividends for the previous period");
	ОбластьПерваяКолонка.Параметры.ДивидендыЗаТекущийПериод = ?(Объект.ЯзыкОтчета = "Русский", "Дивиденды за текущий период ", "Dividends for the current period");
	ОбластьПерваяКолонка.Параметры.ПрочиеРезервы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие резервы", "Other reserves");
	ОбластьПерваяКолонка.Параметры.ТрансляционнаяРазница = ?(Объект.ЯзыкОтчета = "Русский", "Трансляционная разница", "Translation difference");
	ОбластьПерваяКолонка.Параметры.КапиталИРезервыНаАкционеров = ?(Объект.ЯзыкОтчета = "Русский", "Капитал и резервы, приходящиеся на акционеров", "Equity attributable to the Company’s equity holders");
	ОбластьПерваяКолонка.Параметры.ДоляНеконтролирующихАкционеров = ?(Объект.ЯзыкОтчета = "Русский", "Доля неконтролирующих акционеров", "Minority interest");
	ОбластьПерваяКолонка.Параметры.ИтогоСобственногоКапитала = ?(Объект.ЯзыкОтчета = "Русский", "Итого собственного капитала", "TOTAL EQUITY");

	ОбластьПерваяКолонка.Параметры.Обязательства = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства", "LIABILITIES");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные обязательства", "Non-current liabilities");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Кредиты и займы", "Borrowings");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеДолгосрочные = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде долгосрочные", "Lease liabilities");
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеДолгосрочные451 = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде долгосрочные", "Lease liabilities");
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеДолгосрочныеВВалюте = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде долгосрочные в валюте", "Lease liabilities (in foreign currency)");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ОНО = ?(Объект.ЯзыкОтчета = "Русский", "Отложенные налоговые обязательства", "Deferred income tax liability");
	ОбластьПерваяКолонка.Параметры.ДБП = ?(Объект.ЯзыкОтчета = "Русский", "Доходы будущих периодов", "Deferred income");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные обязательства", "Other non-current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоДолгосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Итого долгосрочных обязательств", "Total non-current liabilities");

	ОбластьПерваяКолонка.Параметры.КраткосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные обязательства", "Current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоКраткосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Кредиты и займы", "Borrowings");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные кредиты и займы", "Short-term borrowings");
	ОбластьПерваяКолонка.Параметры.ТекущаяДоляДолгосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Текущая доля долгосрочных обязательств", "Short-term portion of long-term borrowings");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеКраткосрочные = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде краткосрочные", "Lease liabilities");
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеКраткосрочные551 = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде краткосрочные", "Lease liabilities");
	ОбластьПерваяКолонка.Параметры.ОбязательстваПоАрендеКраткосрочныеВВалюте = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства по аренде краткосрочные в валюте", "Lease liabilities (in foreign currency)");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ТорговаяИПрочаяКЗ = ?(Объект.ЯзыкОтчета = "Русский", "Торговая и прочая кредиторская задолженность", "Trade and other payables");
	ОбластьПерваяКолонка.Параметры.КЗинвестиционная = ?(Объект.ЯзыкОтчета = "Русский", "КЗ инвестиционная", "Trade payables (related to construction and acquisition of PP&E)");
	ОбластьПерваяКолонка.Параметры.КЗоперационная = ?(Объект.ЯзыкОтчета = "Русский", "КЗ операционная", "Trade payables (related to ordinary activities)");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПолученные = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты полученные", "Advances received");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПоНалогам = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность по налогам", "Taxes payable (other than Income tax)");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПередПерсоналом = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность перед персоналом", "Payables to staff");
	ОбластьПерваяКолонка.Параметры.ПрочаяКЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прочая кредиторская задолженность", "Other current payables");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	//ОбластьПерваяКолонка.Параметры.ЦелевоеФинансирование = ?(Объект.ЯзыкОтчета = "Русский", "Целевое финансирование", "Special purpose financing");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПоНалогуНаПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность по налогу на прибыль", "Current income tax payable");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПередУчредителями = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность перед учредителями", "Liabilities to the founders");
	ОбластьПерваяКолонка.Параметры.ИтогоКраткосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Итого краткосрочных обязательств", "Total current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО ОБЯЗАТЕЛЬСТВ", "TOTAL LIABILITIES");
	ОбластьПерваяКолонка.Параметры.ИтогоОбязательствИКапитала = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО ОБЯЗАТЕЛЬСТВ И СОБСТВЕННОГО КАПИТАЛА", "TOTAL LIABILITIES AND EQUITY");

	ОбластьПерваяКолонка.Параметры.ДельтаАктивовИОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Дельта (Итого Активы-Итого обязательств и собственного капитала)", "Difference (TOTAL ASSETS-TOTAL LIABILITIES AND EQUITY)");
	
	// часть "ОСД"
	ОбластьПерваяКолонка.Параметры.Выручка = ?(Объект.ЯзыкОтчета = "Русский", "Выручка", "Revenue");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации товаров", "Revenue from sales of goods");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииПродукцииОбщепита = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации продукции общественного питания", "Revenue from sales of own-produced goods");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАренды = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды", "Rental revenue");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды земли", "Rental revenue (land)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды оборудования", "Rental revenue (equipment)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды помещений", "Rental revenue (premises)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды площадей под банкоматы", "Rental revenue (ATM)");
	ОбластьПерваяКолонка.Параметры.ПрочиеДоходыОтАренды = ?(Объект.ЯзыкОтчета = "Русский", "Прочие доходы от аренды", "Rental revenue (other)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтРекламныхУслуг = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от рекламных услуг", "Revenue from advertising services");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыРекламныхПлощадей = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды рекламных площадей", "Rental revenue (advertising premises)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтПрочихРекламныхУслуг = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от прочих рекламных услуг", "Revenue from other advertising services");

	ОбластьПерваяКолонка.Параметры.СебестоимостьПродаж = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость продаж", "Cost of sales");
	ОбластьПерваяКолонка.Параметры.СебестоимостьРеализацииТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость реализации товаров", "Cost of sales of goods");
	ОбластьПерваяКолонка.Параметры.СебестоимостьРеализацииПродукцииОбщепита = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость реализации продукции общественного питания", "Cost of sales of own-produced goods");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков", "Less of any bonuses from suppliers");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковРетро = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (ретро)", "Bonuses from suppliers (retro)");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковПромо = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (промо)", "Bonuses from suppliers (promo)");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковАдм = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (административные)", "Bonuses from suppliers (administrative)");
	//СофтЛаб Начало 2018-09-09 3074
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковРекламныеУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (рекламные услуги)", "Bonuses from suppliers (advertising services)");
	//СофтЛаб Конец 2018-09-09 3074
	ОбластьПерваяКолонка.Параметры.ДоходОтЛогистики = ?(Объект.ЯзыкОтчета = "Русский", "Доход от логистических услуг", "Revenue from logistic services");
	ОбластьПерваяКолонка.Параметры.ШтрафыПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Штрафы поставщиков", "Penalties from suppliers");
	ОбластьПерваяКолонка.Параметры.ЗатратыЛогистики = ?(Объект.ЯзыкОтчета = "Русский", "Затраты логистики", "Transportation and logistics costs");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаОбработкуТоваровВнеш = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на обработку товаров (внешние)", "Processing cost of goods (external)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаОбработкуТоваровВнутр = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на обработку товаров (внутренние)", "Processing cost of goods (internal)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаДоставку = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на доставку", "Transportation costs");
	ОбластьПерваяКолонка.Параметры.ПрочиеЗатратыНаЛогистику = ?(Объект.ЯзыкОтчета = "Русский", "Прочие затраты на логистику", "Other logistic costs");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаТаможенныеУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на таможенные услуги", "Custom services");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаТаможенныеПлатежи = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на таможенные платежи", "Custom payments");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаХранениеТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на хранение товара", "Cost of lease of warehouses (for goods)");
	ОбластьПерваяКолонка.Параметры.КомпенсацияЛогистическихЗатрат = ?(Объект.ЯзыкОтчета = "Русский", "Компенсация логистических затрат", "Logistic bonuses");
	ОбластьПерваяКолонка.Параметры.СтоимостьЛогистикиДляМагазинов = ?(Объект.ЯзыкОтчета = "Русский", "Стоимость логистики для магазинов", "Cost of logistics for stores");
	ОбластьПерваяКолонка.Параметры.РасходникиДляТорговогоПроцесса = ?(Объект.ЯзыкОтчета = "Русский", "Расходники для торгового процесса", "Packing and labeling costs");
	ОбластьПерваяКолонка.Параметры.ЗащитныеМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Защитные материалы", "Protective materials");
	ОбластьПерваяКолонка.Параметры.Упаковка = ?(Объект.ЯзыкОтчета = "Русский", "Упаковка", "Packaging");
	ОбластьПерваяКолонка.Параметры.ЭлементыЦенников = ?(Объект.ЯзыкОтчета = "Русский", "Элементы ценников", "Elements of price labels");
	ОбластьПерваяКолонка.Параметры.ПотериТовара = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара", "Less inventory shortages provision");
	ОбластьПерваяКолонка.Параметры.ПотериТовараИнв = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара - Инвентаризация", "Finish good shortage - stock - takes");
	ОбластьПерваяКолонка.Параметры.ПотериТовараСпис = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара - Списания", "Finish good shortage - write offs");
	ОбластьПерваяКолонка.Параметры.РезервПодСнижениеСтоимостиЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Резерв под снижение стоимости запасов (товарных)", "(Less provision for obsolete stock)");
	ОбластьПерваяКолонка.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации = ?(Объект.ЯзыкОтчета = "Русский", "Корректировка себестоимости по обратной реализации", "(Adjustment cost of implementation of reverse)");
	ОбластьПерваяКолонка.Параметры.ВаловаяПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Валовая прибыль", "Gross profit");

	ОбластьПерваяКолонка.Параметры.ОбщехозКомАдмРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Общехозяйственные, коммерческие и административные расходы", "General, selling and administrative expenses");
	ОбластьПерваяКолонка.Параметры.РасходыНаОплатуТруда = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на оплату труда", "Labour costs");
	ОбластьПерваяКолонка.Параметры.ФОТ = ?(Объект.ЯзыкОтчета = "Русский", "ФОТ", "Payroll");
	ОбластьПерваяКолонка.Параметры.СтраховыеВзносы = ?(Объект.ЯзыкОтчета = "Русский", "Страховые взносы с ФОТ", "Insurance fee from payroll");
	ОбластьПерваяКолонка.Параметры.Пособия = ?(Объект.ЯзыкОтчета = "Русский", "Пособия", "Material aid");
	ОбластьПерваяКолонка.Параметры.ПремированиеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Премирование сотрудников", "Bonuses");
	ОбластьПерваяКолонка.Параметры.СтрахованиеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Страхование сотрудников", "Voluntary medical insurance");
	ОбластьПерваяКолонка.Параметры.ПитаниеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Питание сотрудников", "Meal compensations");
	ОбластьПерваяКолонка.Параметры.МедосмотрСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Медосмотр сотрудников", "Medical inspection");
	ОбластьПерваяКолонка.Параметры.ОрганизацияКорпМероприятий = ?(Объект.ЯзыкОтчета = "Русский", "Организация корпоративных мероприятий", "Corporate activities");
	ОбластьПерваяКолонка.Параметры.Аутсорсинг = ?(Объект.ЯзыкОтчета = "Русский", "Аутсорсинг", "Outsourcing");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на сотрудников", "Other staff costs");
	ОбластьПерваяКолонка.Параметры.КомандировочныеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Командировочные расходы", "Travel costs");
	ОбластьПерваяКолонка.Параметры.ОбучениеПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Обучение персонала", "Trainings and seminars");
	ОбластьПерваяКолонка.Параметры.СпецОбучениеПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Обучение персонала (специальное обучение)", "Trainings and seminars (special)");
	ОбластьПерваяКолонка.Параметры.ПоискПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Поиск персонала", "Recruiting");
	ОбластьПерваяКолонка.Параметры.АрендаКвартир = ?(Объект.ЯзыкОтчета = "Русский", "Аренда квартир", "Rent of apartments");
	//СофтЛаб Начало 2019-06-20 #3383
	ОбластьПерваяКолонка.Параметры.АрендаКвартирСотрудникам = ?(Объект.ЯзыкОтчета = "Русский", "Аренда квартир сотрудникам", "Rent of staff apartments");
	//СофтЛаб Конец 2019-06-20 #3383
	ОбластьПерваяКолонка.Параметры.ВыплатаНаОсновеАкций = ?(Объект.ЯзыкОтчета = "Русский", "Выплата на основе акций", "Yield on shares");

	ОбластьПерваяКолонка.Параметры.АмортизацияОСиНМА = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС и НМА", "Depreciation and amortization");
	ОбластьПерваяКолонка.Параметры.АмортизацияОС = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС", "Depreciation of PP&E");
	ОбластьПерваяКолонка.Параметры.АмортизацияОСдо40тсч = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС до 40 тыс. руб.", "Depreciation of low-valued PPE (less than 40k)");
	ОбластьПерваяКолонка.Параметры.АмортизацияНМА = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация НМА", "Amortization of Intangible assets");
	ОбластьПерваяКолонка.Параметры.АмортизацияICLL = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ICLL", "Depreciation of ICLL");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.АмортизацияАктивовВФормеПраваПользования = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация активов в форме права пользования", "Depreciation of  right-of-use assets");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)

	ОбластьПерваяКолонка.Параметры.РасходыНаРекламу = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на рекламу и маркетинг", "Advertising and marketing");
	ОбластьПерваяКолонка.Параметры.ВнутрОформление = ?(Объект.ЯзыкОтчета = "Русский", "Внутреннее оформление помещений", "Internal design of stores for advertising purposes");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//ОбластьПерваяКолонка.Параметры.ЗатратыНаПромоакции = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию промоакций", "Organisation of promotion actions");
	//ОбластьПерваяКолонка.Параметры.Листовки = ?(Объект.ЯзыкОтчета = "Русский", "Листовки и др. печатные материалы", "Leaflets and other printed materials");
	//ОбластьПерваяКолонка.Параметры.ВнешРеклама = ?(Объект.ЯзыкОтчета = "Русский", "Внешняя реклама (ATL)", "Outdoor advertising (ATL)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаПромоакции 	= ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию федеральных промоакций", "Organisation of federal promotion actions");
	ОбластьПерваяКолонка.Параметры.Листовки 			= ?(Объект.ЯзыкОтчета = "Русский", "Каталог, листовки (дизайн, печать)", "Catalogues and leaflets (design and printing)");
	ОбластьПерваяКолонка.Параметры.ВнешРеклама 			= ?(Объект.ЯзыкОтчета = "Русский", "Внешняя реклама (ООН)", "Outdoor advertising (OOH)");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)	
	ОбластьПерваяКолонка.Параметры.ТОреклОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО рекламного оборудования", "Maintenance of advertising tools");
	ОбластьПерваяКолонка.Параметры.PRактивность = ?(Объект.ЯзыкОтчета = "Русский", "PR активность", "PR activities");
	ОбластьПерваяКолонка.Параметры.МаркетинговыеИсследования = ?(Объект.ЯзыкОтчета = "Русский", "Маркетинговые исследования", "Marketing researches");
	ОбластьПерваяКолонка.Параметры.ПоддержкаБренда = ?(Объект.ЯзыкОтчета = "Русский", "Поддержка бренда", "Brand support");
	ОбластьПерваяКолонка.Параметры.ПрограммаЛояльности = ?(Объект.ЯзыкОтчета = "Русский", "Программа лояльности", "Loyalty program");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//ОбластьПерваяКолонка.Параметры.РекламаИНавигация = ?(Объект.ЯзыкОтчета = "Русский", "Реклама и навигация в ТРК (использовать с 2014 г.)", "Advertising and navigation in TEC");
	ОбластьПерваяКолонка.Параметры.РекламаИНавигация 			= ?(Объект.ЯзыкОтчета = "Русский", "Реклама и навигация в ТРК", "In-store advertising and navigation");
	ОбластьПерваяКолонка.Параметры.ИнтернетРекламаСМИ 			= ?(Объект.ЯзыкОтчета = "Русский", "Интернет-реклама и СМИ", "Digital advertising and media");
	ОбластьПерваяКолонка.Параметры.ЛистовкиАудитРаспространение = ?(Объект.ЯзыкОтчета = "Русский", "Каталог, листовки (аудит, распространение)", "Catalogues and leaflets (audit and distribution)");
	ОбластьПерваяКолонка.Параметры.СМСViber 					= ?(Объект.ЯзыкОтчета = "Русский", "СМС, Viber, e-mail", "SMS, Viber, e-mail");
	ОбластьПерваяКолонка.Параметры.РегиональныеПромоакции 		= ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию региональных промоакций", "Organisation of regional promotion actions");
	ОбластьПерваяКолонка.Параметры.Видеореклама 				= ?(Объект.ЯзыкОтчета = "Русский", "Видеореклама", "Video advertising");
	ОбластьПерваяКолонка.Параметры.Радиореклама 				= ?(Объект.ЯзыкОтчета = "Русский", "Радиореклама", "Radio advertising");
	ОбластьПерваяКолонка.Параметры.ИнтернетРекламаECom 			= ?(Объект.ЯзыкОтчета = "Русский", "Интернет-реклама E-com", "Digital advertising E-commerce");
	ОбластьПерваяКолонка.Параметры.ПоддержкаБрендаСТМ 			= ?(Объект.ЯзыкОтчета = "Русский", "Поддержка бренда СТМ", "Brand support of private label");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)	
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.Мониторинг = ?(Объект.ЯзыкОтчета = "Русский", "Мониторинг", "Monitoring");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыМаркетинга = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы маркетинга", "Other marketing costs");

	ОбластьПерваяКолонка.Параметры.ОперАренда = ?(Объект.ЯзыкОтчета = "Русский", "Операционная аренда", "Operating leases");
	ОбластьПерваяКолонка.Параметры.АрендаЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Аренда земли", "Cost of lease of land");
	ОбластьПерваяКолонка.Параметры.АрендаТоргПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Аренда торговых помещений (фиксированная часть)", "Cost of lease of trade premises (fixed)");
	ОбластьПерваяКолонка.Параметры.АрендаОфиса = ?(Объект.ЯзыкОтчета = "Русский", "Аренда офиса", "Cost of lease of office");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаАрендуСклада = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на аренду склада (кроме складов для товара)", "Cost of lease of warehouses (other than for goods)");
	ОбластьПерваяКолонка.Параметры.ПрочаяАренда = ?(Объект.ЯзыкОтчета = "Русский", "Прочая аренда", "Cost of other lease");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаРемонтИОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на ремонт и обслуживание", "Repairs and maintenance costs");
	ОбластьПерваяКолонка.Параметры.ОбслуживаниеЗданийПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Обслуживание зданий и помещений", "Maintenance of buildings");
	ОбластьПерваяКолонка.Параметры.РемонтЗданийПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт зданий и помещений", "Repair of buildings");
	ОбластьПерваяКолонка.Параметры.РемонтИОбслуживаниеТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт и обслуживание территории", "R&M: territory");
	ОбластьПерваяКолонка.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт и содержание оборудования для обслуживания покупателей", "R&M of equipment for customer's servicing");
	ОбластьПерваяКолонка.Параметры.ТОавтотранспорта = ?(Объект.ЯзыкОтчета = "Русский", "ТО автотранспорта", "Maintenance of vehicles");
	ОбластьПерваяКолонка.Параметры.ТОинженерногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО инженерного оборудования (регулярное)", "Maintenance of engineering equipment (regular)");
	ОбластьПерваяКолонка.Параметры.ТОкулинарногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО кулинарного оборудования", "Maintenance of culinary equipment");
	ОбластьПерваяКолонка.Параметры.ОбслуживаниеОфисногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Обслуживание офисного оборудования", "Maintenance of office equipment");
	ОбластьПерваяКолонка.Параметры.ТОохранногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО охранного оборудования", "Maintenance of security equipment");
	ОбластьПерваяКолонка.Параметры.ТОскладскогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО складского оборудования", "Maintenance of warehouse equipment");
	ОбластьПерваяКолонка.Параметры.ТОсухогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО сухого оборудования", "Maintenance of dry equipment");
	ОбластьПерваяКолонка.Параметры.ТОхолодильногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО холодильного оборудования", "Maintenance of cooling equipment");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияЭКЛЗ = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: ЭКЛЗ", "Maintenance of electronic equipment: ЭКЛЗ");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияЕжемесячное = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: ежемесячное", "Maintenance of electronic equipment: monthly");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияПлановое = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: плановое", "Maintenance of electronic equipment: planned");
	ОбластьПерваяКолонка.Параметры.ТОпрочихОСиИнвентаря = ?(Объект.ЯзыкОтчета = "Русский", "ТО прочих ОС и инвентаря", "Maintenance of other FA and inventory");
	ОбластьПерваяКолонка.Параметры.РемонтИнженерногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт инженерного оборудования", "Repairs of engineering equipment");
	ОбластьПерваяКолонка.Параметры.РемонтКулинарногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт кулинарного оборудования", "Repairs of culinary equipment");
	ОбластьПерваяКолонка.Параметры.РемонтСкладскогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт складского оборудования", "Repairs of warehouse equipment");
	ОбластьПерваяКолонка.Параметры.РемонтСухогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт сухого оборудования", "Repairs of dry equipment");
	ОбластьПерваяКолонка.Параметры.РемонтХолодильногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт холодильного оборудования", "Repairs of cooling equipment");
	ОбластьПерваяКолонка.Параметры.РемонтЭлектронногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт электронного оборудования", "Repairs of electronic equipment");
	ОбластьПерваяКолонка.Параметры.РемонтОхранногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт охранного оборудования", "Repairs of security equipment");
	ОбластьПерваяКолонка.Параметры.РемонтПрочихОСиИнвентаря = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт прочих ОС и инвентаря", "Repairs of other FA and inventory");
	ОбластьПерваяКолонка.Параметры.ПрочийРемонт = ?(Объект.ЯзыкОтчета = "Русский", "Прочий ремонт (стройматериалы)", "Other repairs - construction materials");
	ОбластьПерваяКолонка.Параметры.ОзеленениеТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Озеленение территории", "Landscape gardening");
	ОбластьПерваяКолонка.Параметры.СодержаниеШатров = ?(Объект.ЯзыкОтчета = "Русский", "Содержание шатров", "Maintenance of tents");

	ОбластьПерваяКолонка.Параметры.КоммУслугиИСвязь = ?(Объект.ЯзыкОтчета = "Русский", "Коммунальные услуги и связь", "Communication and utilities");
	ОбластьПерваяКолонка.Параметры.Водоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Водоснабжение", "Water supply");
	ОбластьПерваяКолонка.Параметры.Газоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Газоснабжение", "Gas supply");
	ОбластьПерваяКолонка.Параметры.Теплоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Теплоснабжение", "Heat supply");
	ОбластьПерваяКолонка.Параметры.Электроснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Электроснабжение", "Power supply");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (топливо)", "Running diesel generators (fuel)");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (услуги)", "Running diesel generators (services)");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторов = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (использовать с 2016г.)", "Running diesel generators");
	ОбластьПерваяКолонка.Параметры.ПрочиеКоммРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие коммунальные расходы", "Other utilities");
	ОбластьПерваяКолонка.Параметры.ВывозМусора = ?(Объект.ЯзыкОтчета = "Русский", "Вывоз мусора", "Utilisation of wastes");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииВторсырья = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации вторсырья", "Revenue from sales of recyclable materials");
	ОбластьПерваяКолонка.Параметры.ДератизацияДезинфекция = ?(Объект.ЯзыкОтчета = "Русский", "Дератизация и дезинфекция", "Deratization and dezinfection");
	ОбластьПерваяКолонка.Параметры.ОчисткаЖиропескоуловителей = ?(Объект.ЯзыкОтчета = "Русский", "Очистка жиропескоуловителей", "Filter for fat and sand");
	ОбластьПерваяКолонка.Параметры.УборкаПомещенийУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Уборка помещений (услуги)", "Cleaning of premises (services)");
	ОбластьПерваяКолонка.Параметры.УборкаПомещенийРасходники = ?(Объект.ЯзыкОтчета = "Русский", "Уборка помещений (расходники)", "Cleaning of premises (materials)");
	ОбластьПерваяКолонка.Параметры.УборкаТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Уборка территории", "Cleaning of territory");
	ОбластьПерваяКолонка.Параметры.СборТележек = ?(Объект.ЯзыкОтчета = "Русский", "Сбор тележек", "Collection of trolleys");
	ОбластьПерваяКолонка.Параметры.УборкаКрыши = ?(Объект.ЯзыкОтчета = "Русский", "Уборка крыши", "Roof cleaning");
	ОбластьПерваяКолонка.Параметры.ВывозСнега = ?(Объект.ЯзыкОтчета = "Русский", "Вывоз снега", "Snow carriage");
	ОбластьПерваяКолонка.Параметры.ЧисткаКовров = ?(Объект.ЯзыкОтчета = "Русский", "Чистка ковров", "Cleaning of carpets");
	ОбластьПерваяКолонка.Параметры.СтационарнаяСвязьИнтернет = ?(Объект.ЯзыкОтчета = "Русский", "Стационарная связь, интернет", "Fixed location phones, internet");
	ОбластьПерваяКолонка.Параметры.МобильнаяСвязь = ?(Объект.ЯзыкОтчета = "Русский", "Мобильная связь", "Mobile phones");
	ОбластьПерваяКолонка.Параметры.ПочтовыеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Почтовые расходы", "Postoffice charges");
	ОбластьПерваяКолонка.Параметры.АрендаОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Аренда оборудования", "Cost of lease of equipment");
	ОбластьПерваяКолонка.Параметры.АрендаДизельгенераторов = ?(Объект.ЯзыкОтчета = "Русский", "Аренда дизельгенераторов", "Cost of lease of equipment (diesel generator)");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.ШтрафыПДКиПНВ = ?(Объект.ЯзыкОтчета = "Русский", "Штрафы за ПДК и ПНВ", "Penalties for PDK");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)

	ОбластьПерваяКолонка.Параметры.ИнвентарьМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Инвентарь и материалы", "Materials and supplies");
	ОбластьПерваяКолонка.Параметры.ПроизводственныйИнвентарь = ?(Объект.ЯзыкОтчета = "Русский", "Производственный инвентарь", "Production inventory");
	ОбластьПерваяКолонка.Параметры.ХозтоварыИнвентарь = ?(Объект.ЯзыкОтчета = "Русский", "Хозтовары/инвентарь", "Houseware materials");
	ОбластьПерваяКолонка.Параметры.МатериалыДляАУПиМедикаменты = ?(Объект.ЯзыкОтчета = "Русский", "Материалы для АУП и медикаменты", "Materials for AUP and medicine");
	ОбластьПерваяКолонка.Параметры.КанцТовары = ?(Объект.ЯзыкОтчета = "Русский", "Канцелярские товары", "Stationery");
	ОбластьПерваяКолонка.Параметры.Спецодежда = ?(Объект.ЯзыкОтчета = "Русский", "Спецодежда", "Working clothes");
	ОбластьПерваяКолонка.Параметры.Топливо = ?(Объект.ЯзыкОтчета = "Русский", "Топливо", "Fuel");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаОхрану = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на охрану", "Security expenses");
	ОбластьПерваяКолонка.Параметры.УслугиОхраннойСигнализации = ?(Объект.ЯзыкОтчета = "Русский", "Услуги охранной организации", "Security service charges");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаОхрану = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на охрану", "Other security expenses");

	ОбластьПерваяКолонка.Параметры.СтрахованиеИБанковскаяКомиссия = ?(Объект.ЯзыкОтчета = "Русский", "Страхование и банковская комиссия", "Insurance and bank commission");
	ОбластьПерваяКолонка.Параметры.Эквайринг = ?(Объект.ЯзыкОтчета = "Русский", "Эквайринг", "Cost of collection payments by credit cards (Acquiring)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеИмуществаТоварныхЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Страхование имущества, товарных запасов", "Insurance (property, goods on stock)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеГрузов = ?(Объект.ЯзыкОтчета = "Русский", "Страхование грузов", "Insurance (goods in transit)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеАвтотранспорта = ?(Объект.ЯзыкОтчета = "Русский", "Страхование автотранспорта", "Insurance (vehicles)");
	ОбластьПерваяКолонка.Параметры.ПрочееСтрахование = ?(Объект.ЯзыкОтчета = "Русский", "Прочее страхование", "Insurance (other)");
	ОбластьПерваяКолонка.Параметры.БанковскоеОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Банковское обслуживание", "Bank commission");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаПрофУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на профессиональные услуги", "Legal and professional expenses");
	ОбластьПерваяКолонка.Параметры.СодержаниеАрхива = ?(Объект.ЯзыкОтчета = "Русский", "Содержание архива", "Maintenance of the archive");
	ОбластьПерваяКолонка.Параметры.АудитИОценка = ?(Объект.ЯзыкОтчета = "Русский", "Аудит и оценка", "Audit and valuation services");
	ОбластьПерваяКолонка.Параметры.ОформлениеДокументов = ?(Объект.ЯзыкОтчета = "Русский", "Оформление документов", "Documentation");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаПО = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на ПО", "Software maintenance");
	ОбластьПерваяКолонка.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование = ?(Объект.ЯзыкОтчета = "Русский", "Разрешительная документация, сертификация и лицензирование", "Permission documentation, certification and licensing");
	ОбластьПерваяКолонка.Параметры.ЮрУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Юридические услуги", "Law services");
	ОбластьПерваяКолонка.Параметры.ИнфУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Информационные услуги", "Information services");
	ОбластьПерваяКолонка.Параметры.БухОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Бухгалтерское обслуживание", "Book-keeping services");
	ОбластьПерваяКолонка.Параметры.КонсУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Консультационные услуги", "Consulting services");

	ОбластьПерваяКолонка.Параметры.ОперНалоги = ?(Объект.ЯзыкОтчета = "Русский", "Операционные налоги", "Operating taxes");
	ОбластьПерваяКолонка.Параметры.НалогНаИмущество = ?(Объект.ЯзыкОтчета = "Русский", "Налог на имущество", "Property tax");
	ОбластьПерваяКолонка.Параметры.ЗемНалог = ?(Объект.ЯзыкОтчета = "Русский", "Земельный налог", "Land tax");
	ОбластьПерваяКолонка.Параметры.ТранспНалог = ?(Объект.ЯзыкОтчета = "Русский", "Транспортный налог", "Transportation tax");
	ОбластьПерваяКолонка.Параметры.НДСнепринимаемыйКвычету = ?(Объект.ЯзыкОтчета = "Русский", "НДС, не принимаемый к вычету", "VAT recoverable");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперНалоги = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные налоги", "Other operating taxes");

	ОбластьПерваяКолонка.Параметры.ИтогоПрочиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы", "Other costs");
	ОбластьПерваяКолонка.Параметры.ТранспУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Транспортные услуги", "Transportation cost");
	ОбластьПерваяКолонка.Параметры.ПредставительскиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Представительские расходы", "Hospitality costs");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы", "Other expenses");

	ОбластьПерваяКолонка.Параметры.ПрочиеОперационныеДоходыРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы и расходы", "Other operating income and expenses");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от реализации ОС и прочих активов", "Profit/(loss) from sale of fixed and other assets");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтСписанияКЗДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от списания кредиторской/дебиторской задолженности", "Profit/(loss) from write-off of payables/(receivables)");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от переоценки инвестиционной собственности", "Profit/(loss) from revaluation of Investment property");
	ОбластьПерваяКолонка.Параметры.ОбесценениеОСНМА = ?(Объект.ЯзыкОтчета = "Русский", "Обесценение ОС и НМА", "Impairment of PP&E and Intangible assets");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ОбесценениеАктивовВФормеПраваПользования = ?(Объект.ЯзыкОтчета = "Русский", "Обесценение активов в форме права пользования", "Impairment of  right-of-use assets");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтВыбытияМодификацииАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль\(убыток) от выбытия\ модификации активов в форме права пользования", "Gain/ Loss from disposal/modification of right-of-use assets");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)	
	ОбластьПерваяКолонка.Параметры.ПрочиеОперДоходыРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы и расходы", "Other operating income and expenses");
	ОбластьПерваяКолонка.Параметры.ДоходОтСтраховогоВозмещения = ?(Объект.ЯзыкОтчета = "Русский", "Доход от страхового возмещения", "Insurance income");
	ОбластьПерваяКолонка.Параметры.ДоходОтШтрафовНеустоек = ?(Объект.ЯзыкОтчета = "Русский", "Доход от полученных штрафов и неустоек", "Income from fees and penalties");
	ОбластьПерваяКолонка.Параметры.УбытокОтШтрафовНеустоек = ?(Объект.ЯзыкОтчета = "Русский", "Убыток от уплаченных штрафов и неустоек", "Loss from fees and penalties");
	ОбластьПерваяКолонка.Параметры.Благотворительность = ?(Объект.ЯзыкОтчета = "Русский", "Благотворительность", "Charity");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперДоходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы", "Other operating income");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные расходы", "Other operating expenses");

	ОбластьПерваяКолонка.Параметры.ДоходОтУчастияВАссоцКомпаниях = ?(Объект.ЯзыкОтчета = "Русский", "Доход от участия в ассоциированных компаниях", "Income from associates");
	ОбластьПерваяКолонка.Параметры.ДоходОтПроцентовПолученных = ?(Объект.ЯзыкОтчета = "Русский", "Доход от процентов полученных", "Interest income");
	ОбластьПерваяКолонка.Параметры.ПроцентыПоОстаткамНаСчетах = ?(Объект.ЯзыкОтчета = "Русский", "Проценты по остаткам на счетах", "Bank interest");
	ОбластьПерваяКолонка.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, полученные по предоставленным кредитам и займам", "Interest income from loans issued");

	ОбластьПерваяКолонка.Параметры.ФинРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Финансовые расходы", "Finance costs");
	ОбластьПерваяКолонка.Параметры.РасходыПоПроцентам = ?(Объект.ЯзыкОтчета = "Русский", "Расходы по процентам", "Interest expenses");
	ОбластьПерваяКолонка.Параметры.ПроцентыНачисленныеПоДолгОбязательствам = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, начисленные по долговым обязательствам", "Interest accrued on loans and borrowings");
	ОбластьПерваяКолонка.Параметры.ПроцентыНачисленныеПоФинАренде = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, начисленные по финансовой аренде", "Interest accrued on financial leasing");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ПроцентыНачисленныеПоОбязательствамПоАренде = ?(Объект.ЯзыкОтчета = "Русский", "Проценты начисленные по обязательствам по аренде", "Interest costs on lease liabilities");
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	ОбластьПерваяКолонка.Параметры.ХеджированиеПроцентов = ?(Объект.ЯзыкОтчета = "Русский", "Хеджирование процентов", "Hedging");
	ОбластьПерваяКолонка.Параметры.КомиссииПоКредитам = ?(Объект.ЯзыкОтчета = "Русский", "Комиссии по кредитам", "Commissions on loans");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаФинансирование = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на финансирование", "Other finance costs");

	ОбластьПерваяКолонка.Параметры.КурсовыеРазницы = ?(Объект.ЯзыкОтчета = "Русский", "Курсовые разницы", "Exchange rates gain/(loss)");

	ОбластьПерваяКолонка.Параметры.ПрибыльДоНалогообложения = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль до налогообложения", "Profit before income tax");

	ОбластьПерваяКолонка.Параметры.РасходПоНалогуНаПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Расход по налогу на прибыль", "Income tax expense");

	ОбластьПерваяКолонка.Параметры.ЧистаяПрибыльЗаПериод = ?(Объект.ЯзыкОтчета = "Русский", "Чистая прибыль за период", "Net profit for the period");

	ОбластьПерваяКолонка.Параметры.ДельтаПрибыли = ?(Объект.ЯзыкОтчета = "Русский", "Дельта (Чистая прибыль за период - Прибыль за год)", "Difference (Net profit for the period - Retained earnings - current year profit)");
	
	ТаблДок.Вывести(ОбластьПерваяКолонка);
	
	// определить список участвующих в отчете организаций
	// +СБ. Кузнецова С. 2014-11-05  - изменен алгоритм
	ТаблицаОбороты_Копия =ТаблицаОбороты.Скопировать(, "Организация");
	ТаблицаОбороты_Копия.Свернуть("Организация");
	ТаблицаОбороты_Копия.Сортировать("Организация");
	
	Организации = ТаблицаОбороты_Копия.ВыгрузитьКолонку("Организация");
	// -СБ. Кузнецова С.
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)
	//// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаКонечныеОстатки = СформироватьТаблицуКонечныеОстатки(Организации);
	//ТаблицаНачальныеОстатки = СформироватьТаблицуНачальныеОстатки(Организации);
	//ТаблицаСпецКонечныеОстатки = СформироватьТаблицуСпецифическиеКонечныеОстатки(Организации);
	//// -СБ. Кузнецова С.
	//Заменено на:                                    	
	ОрганизацииВСоставеНаКонецПериода = ТаблицаОбороты.Скопировать(, "Организация,ПериодКонПараметра");
	
	ТаблицаКонечныеОстатки		 = СформироватьТаблицуКонечныеОстатки(ОрганизацииВСоставеНаКонецПериода);
	ТаблицаНачальныеОстатки		 = СформироватьТаблицуНачальныеОстатки(ОрганизацииВСоставеНаКонецПериода);
	ТаблицаСпецКонечныеОстатки	 = СформироватьТаблицуСпецифическиеКонечныеОстатки(ОрганизацииВСоставеНаКонецПериода);

	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	
	СтруктураИтогов = Новый Структура("ИнвестСобственность, ОС, НЗС, ДолгосрочныеИнвестиции,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	|АктивыВФормеПраваПользования,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	|ПрочиеВА, ИтогоВА, Запасы, КраткосрочнаяДЗ, КраткосрочныеФинансовыеВложения, ДСиЭквиваленты, ИтогоОборотныхАктивов, ИтогоАктивов,
	|НераспределеннаяПрибыль, КапиталИРезервыНаАкционеров, ИтогоСобственногоКапитала,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	|ОбязательстваПоАрендеДолгосрочные, ОбязательстваПоАрендеКраткосрочные,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	|ИтогоДолгосрочныхОбязательств, ИтогоКраткосрочныеКредитыИЗаймы, ТорговаяИПрочаяКЗ, ИтогоКраткосрочныхОбязательств, ИтогоОбязательств,
	|ИтогоОбязательствИКапитала, ДельтаАктивовИОбязательств, Выручка, ДоходыОтАренды, ДоходыОтРекламныхУслуг, СебестоимостьПродаж, ПремииПоставщиков, ЗатратыЛогистики, РасходникиДляТорговогоПроцесса, ПотериТовара,
	|ВаловаяПрибыль, ОбщехозКомАдмРасходы, РасходыНаОплатуТруда, АмортизацияОСиНМА, РасходыНаРекламу, ОперАренда, ЗатратыНаРемонтИОбслуживание, КоммУслугиИСвязь, ИнвентарьМатериалы, ЗатратыНаОхрану, СтрахованиеИБанковскаяКомиссия,
	|ЗатратыНаПрофУслуги, ОперНалоги, ИтогоПрочиеРасходы, ПрочиеОперационныеДоходыРасходы, ПрочиеОперДоходыРасходы, ДоходОтПроцентовПолученных, ФинРасходы, РасходыПоПроцентам, ПрибыльДоНалогообложения, ЧистаяПрибыльЗаПериод,
	|ДельтаПрибыли", 0, 0, 0, 0, 0, 0,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)	
	0, 0, 0,
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	
	СтруктураПоискаПоОрганизации = Новый Структура("Организация");
	
	КонОст_ПустыеПараметры =ТаблицаКонечныеОстатки.Скопировать();
	КонОст_ПустыеПараметры.Очистить();
	НоваяСтрока = КонОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из КонОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	КонОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	НачОст_ПустыеПараметры =ТаблицаНачальныеОстатки.Скопировать();
	НачОст_ПустыеПараметры.Очистить();
	НоваяСтрока = НачОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из НачОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	НачОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	Обороты_ПустыеПараметры =ТаблицаОбороты.Скопировать();
	Обороты_ПустыеПараметры.Очистить();
	НоваяСтрока = Обороты_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из Обороты_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	Обороты_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	СпецКонОст_ПустыеПараметры =ТаблицаСпецКонечныеОстатки.Скопировать();
	СпецКонОст_ПустыеПараметры.Очистить();
	НоваяСтрока = СпецКонОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из СпецКонОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	СпецКонОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	Для Каждого Организация Из Организации Цикл
		
		ОбластьКолонкаОрганизация.Параметры.Заполнить(КонОст_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(НачОст_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(Обороты_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(СпецКонОст_ПустыеПараметры[0]);
		
		// +СБ. Кузнецова С. 2014-11-05 
		//ОбластьКолонкаОрганизация.Параметры.Организация = Организация.Ключ;
		//СтруктураПоискаПоОрганизации.Организация = Организация.Ключ;
		ОбластьКолонкаОрганизация.Параметры.Организация = Организация;
		СтруктураПоискаПоОрганизации.Организация = Организация;
		// -СБ. Кузнецова С.
		
		СтрокиКонОст = ТаблицаКонечныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиКонОст.Количество() <> 0 Тогда
			СтрокаКонОст = СтрокиКонОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаКонОст);
		КонецЕсли;
		СтрокиНачОст = ТаблицаНачальныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиНачОст.Количество() <> 0 Тогда
			СтрокаНачОст = СтрокиНачОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаНачОст);
		КонецЕсли;
		СтрокиОбор = ТаблицаОбороты.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиОбор.Количество() <> 0 Тогда
			СтрокаОбор = СтрокиОбор[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаОбор);
		КонецЕсли;
		СтрокиСпецКонОст = ТаблицаСпецКонечныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиСпецКонОст.Количество() <> 0 Тогда
			СтрокаСпецКонОст = СтрокиСпецКонОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаСпецКонОст);
		КонецЕсли;
		
		// итоговые колонки по ОФП
		ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность 			= ?(ОбластьКолонкаОрганизация.Параметры.ЗемляВИС_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗемляВИС_КонОст) 
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗданияВИС_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗданияВИС_КонОст);
		СтруктураИтогов.ИнвестСобственность = СтруктураИтогов.ИнвестСобственность + ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность;																	
		ОбластьКолонкаОрганизация.Параметры.ОС								= ?(ОбластьКолонкаОрганизация.Параметры.Земля_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Земля_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Здания_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Здания_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХолодильноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХолодильноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТехнологическоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТехнологическоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СухоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СухоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СкладскоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СкладскоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОхранноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОхранноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РекламноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РекламноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ITОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ITОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнженерноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнженерноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочееОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочееОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСдо40тсч_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСдо40тсч_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НеотделимыеУлучшения_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НеотделимыеУлучшения_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Транспорт_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Транспорт_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Сооружения_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Сооружения_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСдляПродажи_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСдляПродажи_КонОст);
		СтруктураИтогов.ОС = СтруктураИтогов.ОС + ОбластьКолонкаОрганизация.Параметры.ОС;																	
		ОбластьКолонкаОрганизация.Параметры.НЗС								= ?(ОбластьКолонкаОрганизация.Параметры.НЗСземля_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСземля_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗСздания_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСздания_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗСоборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСоборудование_КонОст)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСВПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСВПути_КонОст);
																			//БИТ АКриштопов 10022016 <<--
		СтруктураИтогов.НЗС = СтруктураИтогов.НЗС + ОбластьКолонкаОрганизация.Параметры.НЗС;																	
		ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции			= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестицииВПаиИАкции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестицииВПаиИАкции_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеЗаймыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеЗаймыВыданные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеДолговыеЦБ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеДолговыеЦБ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеИнвестиции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеИнвестиции_КонОст);
																			
		СтруктураИтогов.ДолгосрочныеИнвестиции = СтруктураИтогов.ДолгосрочныеИнвестиции + ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции;	
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
		ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользования			= ?(ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияЗемля_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияЗемля_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияТорговыеПомещения_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияТорговыеПомещения_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияПрочее_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользованияПрочее_КонОст);
																			
		СтруктураИтогов.АктивыВФормеПраваПользования = СтруктураИтогов.АктивыВФормеПраваПользования + ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользования;
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
		
		
		ОбластьКолонкаОрганизация.Параметры.ПрочиеВА						= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочнаяДЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочнаяДЗ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоОСиНМА_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоОСиНМА_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоАренде_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоАренде_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАвансыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАвансыВыданные_КонОст)
																			// +СБ Кузнецова С. 2016-12-09 Redmine 2747
																			//+ ?(ОбластьКолонкаОрганизация.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАктивы_КонОст);
		СтруктураИтогов.ПрочиеВА = СтруктураИтогов.ПрочиеВА + ОбластьКолонкаОрганизация.Параметры.ПрочиеВА;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоВА							= ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность
																			+ ОбластьКолонкаОрганизация.Параметры.ОС
																			+ ОбластьКолонкаОрганизация.Параметры.НЗС
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Гудвил_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Гудвил_КонОст)
																			// +СБ Кузнецова С. 2016-12-09 Redmine 2747
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПраваАренды_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПраваАренды_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НМА_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НМА_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользования = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АктивыВФормеПраваПользования)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОтложенныеНалоговыеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОтложенныеНалоговыеАктивы_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеВА;
		СтруктураИтогов.ИтогоВА = СтруктураИтогов.ИтогоВА + ОбластьКолонкаОрганизация.Параметры.ИтогоВА;																	
		ОбластьКолонкаОрганизация.Параметры.Запасы							= ?(ОбластьКолонкаОрганизация.Параметры.СырьеИМатериалы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СырьеИМатериалы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗП_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗП_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ГотоваяПродукция_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ГотоваяПродукция_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТоварыВПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТоварыВПути_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИзменениеСтоимостиЗапасов_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИзменениеСтоимостиЗапасов_КонОст);
		СтруктураИтогов.Запасы = СтруктураИтогов.Запасы + ОбластьКолонкаОрганизация.Параметры.Запасы;																	
		ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ					= ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПокупателейИЗаказчиков_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПокупателейИЗаказчиков_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НДСкВозмещению_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НДСкВозмещению_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыВыданныеТекущие_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыВыданныеТекущие_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоНалогам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоНалогам_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяДЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяДЗ_КонОст)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БонусыПолученныеОтПоставщиков_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БонусыПолученныеОтПоставщиков_КонОст)
																			//БИТ АКриштопов 10022016 <<--
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервПоСомнительнымДолгам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервПоСомнительнымДолгам_КонОст);
		СтруктураИтогов.КраткосрочнаяДЗ = СтруктураИтогов.КраткосрочнаяДЗ + ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ;																	
		ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения = ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеЗаймыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеЗаймыВыданные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеДолговыеЦБ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеДолговыеЦБ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеКраткосрочныеИнвестиции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеКраткосрочныеИнвестиции_КонОст);
		СтруктураИтогов.КраткосрочныеФинансовыеВложения = СтруктураИтогов.КраткосрочныеФинансовыеВложения + ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения;																	
		ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты					= ?(ОбластьКолонкаОрганизация.Параметры.Касса_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Касса_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасчетныйСчет_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасчетныйСчет_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВалютныйСчет_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВалютныйСчет_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанках_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанках_КонОст)
																			// +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанкахВВалюте_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанкахВВалюте_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДСвПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДСвПути_КонОст);
		СтруктураИтогов.ДСиЭквиваленты = СтруктураИтогов.ДСиЭквиваленты + ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов			= ОбластьКолонкаОрганизация.Параметры.Запасы
																			+ ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ
																			+ ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения
																			+ ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОборотныеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОборотныеАктивы_КонОст);
		СтруктураИтогов.ИтогоОборотныхАктивов = СтруктураИтогов.ИтогоОборотныхАктивов + ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов					= ОбластьКолонкаОрганизация.Параметры.ИтогоВА
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов;
		СтруктураИтогов.ИтогоАктивов = СтруктураИтогов.ИтогоАктивов + ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов;																	
		ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль			= ?(ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет_СпецКонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет_СпецКонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_СпецКонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_СпецКонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РаспределениеАктивов_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РаспределениеАктивов_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбъявленныеДивиденды_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбъявленныеДивиденды_КонОст);
		СтруктураИтогов.НераспределеннаяПрибыль = СтруктураИтогов.НераспределеннаяПрибыль + ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль;																	
		ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров		= ?(ОбластьКолонкаОрганизация.Параметры.АкционерныйКапитал_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АкционерныйКапитал_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЭмиссионныйДоход_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЭмиссионныйДоход_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СобственныеВыкупленныеАкции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СобственныеВыкупленныеАкции_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервыПоЗаконодательству_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервыПоЗаконодательству_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДобавочныйКапитал_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДобавочныйКапитал_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРезервы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРезервы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТрансляционнаяРазница_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТрансляционнаяРазница_КонОст);
		СтруктураИтогов.КапиталИРезервыНаАкционеров = СтруктураИтогов.КапиталИРезервыНаАкционеров + ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала		= ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров;
		СтруктураИтогов.ИтогоСобственногоКапитала = СтруктураИтогов.ИтогоСобственногоКапитала + ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала;	
		
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
		ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные			= ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные451_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные451_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст);
																			
		СтруктураИтогов.ОбязательстваПоАрендеДолгосрочные = СтруктураИтогов.ОбязательстваПоАрендеДолгосрочные + ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные;
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
		
		
		ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств	= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеКредитыИЗаймы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеКредитыИЗаймы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОНО_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОНО_КонОст)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеДолгосрочные)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДБП_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДБП_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеОбязательства_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеОбязательства_КонОст);
		СтруктураИтогов.ИтогоДолгосрочныхОбязательств = СтруктураИтогов.ИтогоДолгосрочныхОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств;																	
		
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
		ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные			= ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные551_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные551_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст);
																			
		СтруктураИтогов.ОбязательстваПоАрендеКраткосрочные = СтруктураИтогов.ОбязательстваПоАрендеКраткосрочные + ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные;
		// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
		
		
		
		ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы = ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеКредитыИЗаймы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеКредитыИЗаймы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТекущаяДоляДолгосрочныхОбязательств_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТекущаяДоляДолгосрочныхОбязательств_КонОст);
		СтруктураИтогов.ИтогоКраткосрочныеКредитыИЗаймы = СтруктураИтогов.ИтогоКраткосрочныеКредитыИЗаймы + ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы;																	
		ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ				= ?(ОбластьКолонкаОрганизация.Параметры.КЗинвестиционная_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КЗинвестиционная_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КЗоперационная_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КЗоперационная_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПолученные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПолученные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогам_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередПерсоналом_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередПерсоналом_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяКЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяКЗ_КонОст)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
																			//+ ?(ОбластьКолонкаОрганизация.Параметры.ЦелевоеФинансирование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЦелевоеФинансирование_КонОст)
																			;
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
		СтруктураИтогов.ТорговаяИПрочаяКЗ = СтруктураИтогов.ТорговаяИПрочаяКЗ + ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств	= ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы
																			+ ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбязательстваПоАрендеКраткосрочные)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогуНаПрибыль_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогуНаПрибыль_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередУчредителями_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередУчредителями_КонОст);
		СтруктураИтогов.ИтогоКраткосрочныхОбязательств = СтруктураИтогов.ИтогоКраткосрочныхОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств				= ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств;
		СтруктураИтогов.ИтогоОбязательств = СтруктураИтогов.ИтогоОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала		= ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств;
		СтруктураИтогов.ИтогоОбязательствИКапитала = СтруктураИтогов.ИтогоОбязательствИКапитала + ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала;																	
		ОбластьКолонкаОрганизация.Параметры.ДельтаАктивовИОбязательств		= ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала;
		СтруктураИтогов.ДельтаАктивовИОбязательств = СтруктураИтогов.ДельтаАктивовИОбязательств + ОбластьКолонкаОрганизация.Параметры.ДельтаАктивовИОбязательств;																	
		
		// итоговые колонки по ОСД
		ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды					= ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыЗемли_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыЗемли_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДоходыОтАренды_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДоходыОтАренды_Оборот);
		СтруктураИтогов.ДоходыОтАренды = СтруктураИтогов.ДоходыОтАренды + ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды;																	
		ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг			= ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыРекламныхПлощадей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыРекламныхПлощадей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтПрочихРекламныхУслуг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтПрочихРекламныхУслуг_Оборот);
		СтруктураИтогов.ДоходыОтРекламныхУслуг = СтруктураИтогов.ДоходыОтРекламныхУслуг + ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг;																	
		ОбластьКолонкаОрганизация.Параметры.Выручка							= ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииПродукцииОбщепита_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииПродукцииОбщепита_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг;
		СтруктураИтогов.Выручка = СтруктураИтогов.Выручка + ОбластьКолонкаОрганизация.Параметры.Выручка;																	
		ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков				= ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРетро_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРетро_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковПромо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковПромо_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковАдм_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковАдм_Оборот)
																			//СофтЛаб Начало 2018-09-09 3074
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРекламныеУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРекламныеУслуги_Оборот)
																			//СофтЛаб Конец 2018-09-09 3074
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтЛогистики_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтЛогистики_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ШтрафыПоставщиков_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ШтрафыПоставщиков_Оборот);
		СтруктураИтогов.ПремииПоставщиков = СтруктураИтогов.ПремииПоставщиков + ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики				= ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнеш_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнеш_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнутр_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнутр_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаДоставку_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаДоставку_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеЗатратыНаЛогистику_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеЗатратыНаЛогистику_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеПлатежи_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеПлатежи_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаХранениеТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаХранениеТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомпенсацияЛогистическихЗатрат_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомпенсацияЛогистическихЗатрат_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтоимостьЛогистикиДляМагазинов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтоимостьЛогистикиДляМагазинов_Оборот);
		СтруктураИтогов.ЗатратыЛогистики = СтруктураИтогов.ЗатратыЛогистики + ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики;																	
		ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса	= ?(ОбластьКолонкаОрганизация.Параметры.ЗащитныеМатериалы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗащитныеМатериалы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Упаковка_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Упаковка_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЭлементыЦенников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЭлементыЦенников_Оборот);
		СтруктураИтогов.РасходникиДляТорговогоПроцесса = СтруктураИтогов.РасходникиДляТорговогоПроцесса + ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса;																	
		ОбластьКолонкаОрганизация.Параметры.ПотериТовара					= ?(ОбластьКолонкаОрганизация.Параметры.ПотериТовараИнв_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПотериТовараИнв_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПотериТовараСпис_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПотериТовараСпис_Оборот);
		СтруктураИтогов.ПотериТовара = СтруктураИтогов.ПотериТовара + ОбластьКолонкаОрганизация.Параметры.ПотериТовара;																	
		ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж				= ?(ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииПродукцииОбщепита_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииПродукцииОбщепита_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики
																			+ ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса
																			+ ОбластьКолонкаОрганизация.Параметры.ПотериТовара
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервПодСнижениеСтоимостиЗапасов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервПодСнижениеСтоимостиЗапасов_Оборот)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации_Оборот);
																			//БИТ АКриштопов 10022016 <<--
		СтруктураИтогов.СебестоимостьПродаж = СтруктураИтогов.СебестоимостьПродаж + ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж;																	
		ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль					= ОбластьКолонкаОрганизация.Параметры.Выручка
																			+ ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж;
		СтруктураИтогов.ВаловаяПрибыль = СтруктураИтогов.ВаловаяПрибыль + ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда			= ?(ОбластьКолонкаОрганизация.Параметры.ФОТ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ФОТ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтраховыеВзносы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтраховыеВзносы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Пособия_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Пособия_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремированиеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремированиеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПитаниеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПитаниеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МедосмотрСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МедосмотрСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОрганизацияКорпМероприятий_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОрганизацияКорпМероприятий_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Аутсорсинг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Аутсорсинг_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомандировочныеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомандировочныеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбучениеПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбучениеПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецОбучениеПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецОбучениеПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоискПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоискПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаКвартир_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаКвартир_Оборот)
																			//СофтЛаб Начало 2019-06-20 #3383
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаКвартирСотрудникам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаКвартирСотрудникам_Оборот)
																			//СофтЛаб Конец 2019-06-20 #3383
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыплатаНаОсновеАкций_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыплатаНаОсновеАкций_Оборот);
		СтруктураИтогов.РасходыНаОплатуТруда = СтруктураИтогов.РасходыНаОплатуТруда + ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда;																	
		ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА				= ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияОС_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияОС_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияОСдо40тсч_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияОСдо40тсч_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияНМА_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияНМА_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияICLL_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияICLL_Оборот)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияАктивовВФормеПраваПользования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияАктивовВФормеПраваПользования_Оборот);
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
		СтруктураИтогов.АмортизацияОСиНМА = СтруктураИтогов.АмортизацияОСиНМА + ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу				= ?(ОбластьКолонкаОрганизация.Параметры.ВнутрОформление_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВнутрОформление_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПромоакции_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПромоакции_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Листовки_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Листовки_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВнешРеклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВнешРеклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОреклОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОреклОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.PRактивность_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.PRактивность_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МаркетинговыеИсследования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МаркетинговыеИсследования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоддержкаБренда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоддержкаБренда_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрограммаЛояльности_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрограммаЛояльности_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РекламаИНавигация_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РекламаИНавигация_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Мониторинг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Мониторинг_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаСМИ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаСМИ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЛистовкиАудитРаспространение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЛистовкиАудитРаспространение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СМСViber_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СМСViber_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РегиональныеПромоакции_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РегиональныеПромоакции_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Видеореклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Видеореклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Радиореклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Радиореклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаECom_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаECom_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоддержкаБрендаСТМ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоддержкаБрендаСТМ_Оборот)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыМаркетинга_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыМаркетинга_Оборот);
		СтруктураИтогов.РасходыНаРекламу = СтруктураИтогов.РасходыНаРекламу + ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу;																	
		ОбластьКолонкаОрганизация.Параметры.ОперАренда						= ?(ОбластьКолонкаОрганизация.Параметры.АрендаЗемли_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаЗемли_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаТоргПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаТоргПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаОфиса_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаОфиса_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаАрендуСклада_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаАрендуСклада_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяАренда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяАренда_Оборот);
		СтруктураИтогов.ОперАренда = СтруктураИтогов.ОперАренда + ОбластьКолонкаОрганизация.Параметры.ОперАренда;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание	= ?(ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеЗданийПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеЗданийПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтЗданийПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтЗданийПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИОбслуживаниеТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИОбслуживаниеТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОавтотранспорта_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОавтотранспорта_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОинженерногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОинженерногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОкулинарногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОкулинарногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеОфисногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеОфисногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОохранногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОохранногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОскладскогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОскладскогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОсухогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОсухогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОхолодильногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОхолодильногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЭКЛЗ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЭКЛЗ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЕжемесячное_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЕжемесячное_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияПлановое_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияПлановое_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОпрочихОСиИнвентаря_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОпрочихОСиИнвентаря_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИнженерногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИнженерногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтКулинарногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтКулинарногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтСкладскогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтСкладскогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтСухогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтСухогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтХолодильногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтХолодильногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтЭлектронногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтЭлектронногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтОхранногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтОхранногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтПрочихОСиИнвентаря_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтПрочихОСиИнвентаря_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочийРемонт_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочийРемонт_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОзеленениеТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОзеленениеТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СодержаниеШатров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СодержаниеШатров_Оборот);
		СтруктураИтогов.ЗатратыНаРемонтИОбслуживание = СтруктураИтогов.ЗатратыНаРемонтИОбслуживание + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание;																	
		ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь				= ?(ОбластьКолонкаОрганизация.Параметры.Водоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Водоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Газоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Газоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Теплоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Теплоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Электроснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Электроснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеКоммРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеКоммРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВывозМусора_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВывозМусора_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииВторсырья_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииВторсырья_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДератизацияДезинфекция_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДератизацияДезинфекция_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОчисткаЖиропескоуловителей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОчисткаЖиропескоуловителей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийРасходники_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийРасходники_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СборТележек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СборТележек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаКрыши_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаКрыши_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВывозСнега_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВывозСнега_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЧисткаКовров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЧисткаКовров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтационарнаяСвязьИнтернет_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтационарнаяСвязьИнтернет_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МобильнаяСвязь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МобильнаяСвязь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПочтовыеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПочтовыеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаДизельгенераторов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаДизельгенераторов_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ШтрафыПДКиПНВ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ШтрафыПДКиПНВ_Оборот);
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833) 
		СтруктураИтогов.КоммУслугиИСвязь = СтруктураИтогов.КоммУслугиИСвязь + ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь;																	
		ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы 				= ?(ОбластьКолонкаОрганизация.Параметры.ПроизводственныйИнвентарь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроизводственныйИнвентарь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХозтоварыИнвентарь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХозтоварыИнвентарь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МатериалыДляАУПиМедикаменты_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МатериалыДляАУПиМедикаменты_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КанцТовары_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КанцТовары_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Спецодежда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Спецодежда_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Топливо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Топливо_Оборот);
		СтруктураИтогов.ИнвентарьМатериалы = СтруктураИтогов.ИнвентарьМатериалы + ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану					= ?(ОбластьКолонкаОрганизация.Параметры.УслугиОхраннойСигнализации_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УслугиОхраннойСигнализации_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаОхрану_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаОхрану_Оборот);
		СтруктураИтогов.ЗатратыНаОхрану = СтруктураИтогов.ЗатратыНаОхрану + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану;																	
		ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия	= ?(ОбластьКолонкаОрганизация.Параметры.Эквайринг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Эквайринг_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеИмуществаТоварныхЗапасов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеИмуществаТоварныхЗапасов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеГрузов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеГрузов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеАвтотранспорта_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеАвтотранспорта_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочееСтрахование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочееСтрахование_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БанковскоеОбслуживание_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БанковскоеОбслуживание_Оборот);
		СтруктураИтогов.СтрахованиеИБанковскаяКомиссия = СтруктураИтогов.СтрахованиеИБанковскаяКомиссия + ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги				= ?(ОбластьКолонкаОрганизация.Параметры.СодержаниеАрхива_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СодержаниеАрхива_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АудитИОценка_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АудитИОценка_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОформлениеДокументов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОформлениеДокументов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПО_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПО_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЮрУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЮрУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнфУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнфУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БухОбслуживание_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БухОбслуживание_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КонсУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КонсУслуги_Оборот);
		СтруктураИтогов.ЗатратыНаПрофУслуги = СтруктураИтогов.ЗатратыНаПрофУслуги + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги;																	
		ОбластьКолонкаОрганизация.Параметры.ОперНалоги						= ?(ОбластьКолонкаОрганизация.Параметры.НалогНаИмущество_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НалогНаИмущество_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗемНалог_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗемНалог_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТранспНалог_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТранспНалог_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НДСнепринимаемыйКвычету_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НДСнепринимаемыйКвычету_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперНалоги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперНалоги_Оборот);
		СтруктураИтогов.ОперНалоги = СтруктураИтогов.ОперНалоги + ОбластьКолонкаОрганизация.Параметры.ОперНалоги;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы				= ?(ОбластьКолонкаОрганизация.Параметры.ТранспУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТранспУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредставительскиеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредставительскиеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходы_Оборот);
		СтруктураИтогов.ИтогоПрочиеРасходы = СтруктураИтогов.ИтогоПрочиеРасходы + ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы			= ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда
																			+ ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА
																			+ ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу
																			+ ОбластьКолонкаОрганизация.Параметры.ОперАренда
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание
																			+ ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь
																			+ ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану
																			+ ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги
																			+ ОбластьКолонкаОрганизация.Параметры.ОперНалоги
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы;
		СтруктураИтогов.ОбщехозКомАдмРасходы = СтруктураИтогов.ОбщехозКомАдмРасходы + ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы			= ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтСтраховогоВозмещения_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтСтраховогоВозмещения_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтШтрафовНеустоек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтШтрафовНеустоек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УбытокОтШтрафовНеустоек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УбытокОтШтрафовНеустоек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Благотворительность_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Благотворительность_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперРасходы_Оборот);
		СтруктураИтогов.ПрочиеОперДоходыРасходы = СтруктураИтогов.ПрочиеОперДоходыРасходы + ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы	= ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтСписанияКЗДЗ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтСписанияКЗДЗ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбесценениеОСНМА_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбесценениеОСНМА_Оборот)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбесценениеАктивовВФормеПраваПользования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбесценениеАктивовВФормеПраваПользования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтВыбытияМодификацииАктивов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтВыбытияМодификацииАктивов_Оборот)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы;
		СтруктураИтогов.ПрочиеОперационныеДоходыРасходы = СтруктураИтогов.ПрочиеОперационныеДоходыРасходы + ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных		= ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыПоОстаткамНаСчетах_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыПоОстаткамНаСчетах_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот);
		СтруктураИтогов.ДоходОтПроцентовПолученных = СтруктураИтогов.ДоходОтПроцентовПолученных + ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам				= ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоДолгОбязательствам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоДолгОбязательствам_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоФинАренде_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоФинАренде_Оборот)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)		
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоОбязательствамПоАренде_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоОбязательствамПоАренде_Оборот)
																			// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХеджированиеПроцентов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХеджированиеПроцентов_Оборот);
		СтруктураИтогов.РасходыПоПроцентам = СтруктураИтогов.РасходыПоПроцентам + ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам;																	
		ОбластьКолонкаОрганизация.Параметры.ФинРасходы						= ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомиссииПоКредитам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомиссииПоКредитам_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаФинансирование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаФинансирование_Оборот);
		СтруктураИтогов.ФинРасходы = СтруктураИтогов.ФинРасходы + ОбластьКолонкаОрганизация.Параметры.ФинРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения		= ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль
																			+ ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтУчастияВАссоцКомпаниях_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтУчастияВАссоцКомпаниях_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных
																			+ ОбластьКолонкаОрганизация.Параметры.ФинРасходы
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КурсовыеРазницы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КурсовыеРазницы_Оборот);
		СтруктураИтогов.ПрибыльДоНалогообложения = СтруктураИтогов.ПрибыльДоНалогообложения + ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения;																	
		ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод			= ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходПоНалогуНаПрибыль_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходПоНалогуНаПрибыль_Оборот);
		СтруктураИтогов.ЧистаяПрибыльЗаПериод = СтруктураИтогов.ЧистаяПрибыльЗаПериод + ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод;																	
		ОбластьКолонкаОрганизация.Параметры.ДельтаПрибыли					= ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод
																			- ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот);
		СтруктураИтогов.ДельтаПрибыли = СтруктураИтогов.ДельтаПрибыли + ОбластьКолонкаОрганизация.Параметры.ДельтаПрибыли;																	
		
		ТаблДок.Присоединить(ОбластьКолонкаОрганизация);
		
	КонецЦикла;
	
	ОбластьКолонкаИтоги.Параметры.Итого = ?(Объект.ЯзыкОтчета = "Русский", "Итого", "Total");
	
	ТаблицаКонечныеОстатки_Копия =ТаблицаКонечныеОстатки.Скопировать();
	ТаблицаНачальныеОстатки_Копия =ТаблицаНачальныеОстатки.Скопировать();
	ТаблицаОбороты_Копия =ТаблицаОбороты.Скопировать();
	// +СБ. Кузнецова С. 2014-11-06 
	ТаблицаСпецКонечныеОстатки_Копия =ТаблицаСпецКонечныеОстатки.Скопировать();
	// -СБ. Кузнецова С.
	
	КолонкиКонОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаКонечныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиКонОст = КолонкиКонОст + ", ";
		КонецЕсли;
		КолонкиКонОст = КолонкиКонОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаКонечныеОстатки_Копия.Свернуть(, КолонкиКонОст);
	Если ТаблицаКонечныеОстатки_Копия.Количество() <> 0 Тогда
		КонОст_Итоги = ТаблицаКонечныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, КонОст_Итоги);
	КонецЕсли;
	
	КолонкиНачОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаНачальныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиНачОст = КолонкиНачОст + ", ";
		КонецЕсли;
		КолонкиНачОст = КолонкиНачОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаНачальныеОстатки_Копия.Свернуть(, КолонкиНачОст);
	Если ТаблицаНачальныеОстатки_Копия.Количество() <> 0 Тогда
		НачОст_Итоги = ТаблицаНачальныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, НачОст_Итоги);
	КонецЕсли;
	
	КолонкиОбороты = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаОбороты.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиОбороты = КолонкиОбороты + ", ";
		КонецЕсли;
		КолонкиОбороты = КолонкиОбороты + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаОбороты_Копия.Свернуть(, КолонкиОбороты);
	Если ТаблицаОбороты_Копия.Количество() <> 0 Тогда
		Обороты_Итоги = ТаблицаОбороты_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, Обороты_Итоги);
	КонецЕсли;
	
	// +СБ. Кузнецова С. 2014-11-06 
	КолонкиСпецКонОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаСпецКонечныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиСпецКонОст = КолонкиСпецКонОст + ", ";
		КонецЕсли;
		КолонкиСпецКонОст = КолонкиСпецКонОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаСпецКонечныеОстатки_Копия.Свернуть(, КолонкиСпецКонОст);
	Если ТаблицаСпецКонечныеОстатки_Копия.Количество() <> 0 Тогда
		СпецКонОст_Итоги = ТаблицаСпецКонечныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, СпецКонОст_Итоги);
	КонецЕсли;
	// -СБ. Кузнецова С.
	
	ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, СтруктураИтогов);
	
	ТаблДок.ФиксацияСверху = 6;
	ТаблДок.ФиксацияСлева = 1;
	ТаблДок.Присоединить(ОбластьКолонкаИтоги);
		
КонецПроцедуры // СформироватьОтчет()

&НаСервере
//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-09 (#3527)
//Функция ПолучитьТекстОбъединенияКонОст(ТЗОрганизаций)
//Заменено на:
Функция ПолучитьТекстОбъединенияКонОст(ТЗОрганизаций, Запрос)
//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-09 (#3527)

	
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   |	бит_Дополнительный_2Остатки.Организация,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗемляВИС)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗемляВИС_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗданияВИС)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗданияВИС_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Земля)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Земля_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Здания)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Здания_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ХолодильноеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ХолодильноеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТехнологическоеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТехнологическоеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СухоеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СухоеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СкладскоеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СкладскоеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОхранноеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОхранноеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РекламноеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РекламноеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ITОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ITОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИнженерноеОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИнженерноеОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочееОборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочееОборудование_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСдо40тсч)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОСдо40тсч_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НеотделимыеУлучшения)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НеотделимыеУлучшения_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Транспорт)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Транспорт_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Сооружения)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Сооружения_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСдляПродажи)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОСдляПродажи_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСземля)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НЗСземля_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСздания)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НЗСздания_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСоборудование)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НЗСоборудование_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСВПути)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОСВПути_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияЗемля)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АктивыВФормеПраваПользованияЗемля_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияТорговыеПомещения)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АктивыВФормеПраваПользованияТорговыеПомещения_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияПрочее)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АктивыВФормеПраваПользованияПрочее_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Гудвил)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Гудвил_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПраваАренды)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПраваАренды_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НМА)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НМА_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеИнвестицииВПаиИАкции)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДолгосрочныеИнвестицииВПаиИАкции_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеЗаймыВыданные)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДолгосрочныеЗаймыВыданные_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеДолговыеЦБ)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДолгосрочныеДолговыеЦБ_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеИнвестиции)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеДолгосрочныеИнвестиции_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОтложенныеНалоговыеАктивы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОтложенныеНалоговыеАктивы_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочнаяДЗ)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДолгосрочнаяДЗ_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоОСиНМА)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредоплатыПоОСиНМА_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоАренде)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредоплатыПоАренде_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеАвансыВыданные)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеДолгосрочныеАвансыВыданные_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеАктивы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеДолгосрочныеАктивы_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СырьеИМатериалы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СырьеИМатериалы_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗП)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НЗП_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ГотоваяПродукция)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ГотоваяПродукция_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТоварыВПути)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТоварыВПути_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИзменениеСтоимостиЗапасов)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИзменениеСтоимостиЗапасов_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПокупателейИЗаказчиков)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗадолженностьПокупателейИЗаказчиков_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НДСкВозмещению)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НДСкВозмещению_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыВыданныеТекущие)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредоплатыВыданныеТекущие_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоНалогам)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредоплатыПоНалогам_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочаяДЗ)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочаяДЗ_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_БонусыПолученныеОтПоставщиков)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БонусыПолученныеОтПоставщиков_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РезервПоСомнительнымДолгам)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РезервПоСомнительнымДолгам_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеЗаймыВыданные)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КраткосрочныеЗаймыВыданные_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеДолговыеЦБ)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КраткосрочныеДолговыеЦБ_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеКраткосрочныеИнвестиции)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеКраткосрочныеИнвестиции_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Касса)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Касса_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасчетныйСчет)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РасчетныйСчет_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВалютныйСчет)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВалютныйСчет_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СпецСчетаВБанках)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СпецСчетаВБанках_КонОст,				  
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СпецСчетаВБанкахВВалюте)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СпецСчетаВБанкахВВалюте_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДСвПути)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДСвПути_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеОборотныеАктивы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеОборотныеАктивы_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АкционерныйКапитал)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АкционерныйКапитал_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЭмиссионныйДоход)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЭмиссионныйДоход_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СобственныеВыкупленныеАкции)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СобственныеВыкупленныеАкции_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РезервыПоЗаконодательству)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РезервыПоЗаконодательству_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДобавочныйКапитал)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДобавочныйКапитал_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльЗаГод)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльЗаГод_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РаспределениеАктивов)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РаспределениеАктивов_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбъявленныеДивиденды)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбъявленныеДивиденды_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаПредыдущийПериод)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДивидендыЗаПредыдущийПериод_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаТекущийПериод)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДивидендыЗаТекущийПериод_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРезервы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРезервы_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТрансляционнаяРазница)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТрансляционнаяРазница_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеКредитыИЗаймы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДолгосрочныеКредитыИЗаймы_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеДолгосрочные451)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбязательстваПоАрендеДолгосрочные451_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеДолгосрочныеВВалюте)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст, 
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОНО)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОНО_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДБП)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДБП_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеОбязательства)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеДолгосрочныеОбязательства_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеКредитыИЗаймы)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КраткосрочныеКредитыИЗаймы_КонОст, 
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеКраткосрочные551)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбязательстваПоАрендеКраткосрочные551_КонОст,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеКраткосрочныеВВалюте)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст, 
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТекущаяДоляДолгосрочныхОбязательств)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТекущаяДоляДолгосрочныхОбязательств_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КЗинвестиционная)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КЗинвестиционная_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КЗоперационная)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КЗоперационная_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПолученные)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредоплатыПолученные_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПоНалогам)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗадолженностьПоНалогам_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПередПерсоналом)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗадолженностьПередПерсоналом_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочаяКЗ)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочаяКЗ_КонОст,
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
				   //|	ВЫБОР
				   //|		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЦелевоеФинансирование)
				   //|			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
				   //|		ИНАЧЕ 0
				   //|	КОНЕЦ КАК ЦелевоеФинансирование_КонОст,
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПоНалогуНаПрибыль)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗадолженностьПоНалогуНаПрибыль_КонОст,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПередУчредителями)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗадолженностьПередУчредителями_КонОст
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ 	  
				   |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки( 
				   |				&КонецПериодаГраница,
	               |				,
	               |				,				   
				   |				Организация В (&Организации)
				   |						) КАК бит_Дополнительный_2Остатки";
	
	ТекстРезультат = "";         
	пИндекс = 0;
	ТЗПериодов = ТЗОрганизаций.Скопировать(,"ПериодКонПараметра");
	ТЗПериодов.Свернуть("ПериодКонПараметра");
	
	Для Каждого СтрПериодов Из ТЗПериодов Цикл 	
		
		мНайденных = ТЗОрганизаций.НайтиСтроки(Новый Структура("ПериодКонПараметра", СтрПериодов.ПериодКонПараметра));
		мОрганизаций = Новый Массив;
		
		Для Каждого стрОрганизации Из мНайденных Цикл 
			мОрганизаций.Добавить(стрОрганизации.Организация);
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекстРезультат) Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Данные", ""); 		    
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " РАЗРЕШЕННЫЕ", "");
		КонецЕсли;
		
		ТекстДоб = СтрЗаменить(ТекстЗапроса	 , "&КонецПериодаГраница", "&КонецПериодаГраница" + пИндекс);
		ТекстДоб = СтрЗаменить(ТекстДоб		 , "&Организации"	   	 , "&Организации" 		  + пИндекс);		
		
		ТекстРезультат = ТекстРезультат + ?(ПустаяСтрока(ТекстРезультат), "", "
						    |ОБЪЕДИНИТЬ ВСЕ
						    |") + ТекстДоб;	
		
		Запрос.УстановитьПараметр("Организации" 		+ пИндекс, мОрганизаций);
		Запрос.УстановитьПараметр("КонецПериодаГраница" + пИндекс, Новый Граница(КонецДня(СтрПериодов.ПериодКонПараметра), ВидГраницы.Включая));
		
		пИндекс = пИндекс + 1;
		
	КонецЦикла;
	
	Возврат ТекстРезультат;
	
КонецФункции

// Функция возвращает таблицу значений конечных остатков для показателей отчета
//
// +СБ. Кузнецова С. 2014-11-05 
//Функция СформироватьТаблицуКонечныеОстатки()
&НаСервере
Функция СформироватьТаблицуКонечныеОстатки(Организации)
// -СБ. Кузнецова С.
	
	Запрос = Новый Запрос;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-09 (#3527)
	#Область Часть_Запроса_Остатки_BACKUP
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	//			   //|ПОМЕСТИТЬ ВТ_СоставПериметраКонсолидации
	//			   //|ИЗ
	//			   //|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериодаГраница, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	//			   //|ГДЕ
	//			   //|	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &КонецПериода
	//			   //|			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	//			   //|;
	//			   //|
	//			   //|////////////////////////////////////////////////////////////////////////////////
	//			   //|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//			   //|	ВТ_СоставПериметраКонсолидации.Организация,
	//               |	бит_Дополнительный_2Остатки.Организация,
	//			   // -СБ. Кузнецова С.
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗемляВИС)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗемляВИС_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗданияВИС)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗданияВИС_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Земля)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Земля_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Здания)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Здания_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ХолодильноеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ХолодильноеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТехнологическоеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ТехнологическоеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СухоеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СухоеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СкладскоеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СкладскоеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОхранноеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОхранноеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РекламноеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК РекламноеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ITОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ITОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИнженерноеОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ИнженерноеОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочееОборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочееОборудование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСдо40тсч)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОСдо40тсч_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НеотделимыеУлучшения)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НеотделимыеУлучшения_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Транспорт)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Транспорт_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Сооружения)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Сооружения_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСдляПродажи)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОСдляПродажи_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСземля)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НЗСземля_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСздания)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НЗСздания_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗСоборудование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НЗСоборудование_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОСВПути)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОСВПути_КонОст,
	//			   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияЗемля)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК АктивыВФормеПраваПользованияЗемля_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияТорговыеПомещения)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК АктивыВФормеПраваПользованияТорговыеПомещения_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АктивыВФормеПраваПользованияПрочее)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК АктивыВФормеПраваПользованияПрочее_КонОст,
	//			   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Гудвил)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Гудвил_КонОст,
	//			   // +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПраваАренды)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПраваАренды_КонОст,
	//			   // -СБ Кузнецова С.
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НМА)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НМА_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеИнвестицииВПаиИАкции)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДолгосрочныеИнвестицииВПаиИАкции_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеЗаймыВыданные)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДолгосрочныеЗаймыВыданные_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеДолговыеЦБ)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДолгосрочныеДолговыеЦБ_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеИнвестиции)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеДолгосрочныеИнвестиции_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОтложенныеНалоговыеАктивы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОтложенныеНалоговыеАктивы_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочнаяДЗ)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДолгосрочнаяДЗ_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоОСиНМА)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПредоплатыПоОСиНМА_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоАренде)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПредоплатыПоАренде_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеАвансыВыданные)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеДолгосрочныеАвансыВыданные_КонОст,
	//			   // +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//			   //|	ВЫБОР
	//			   //|		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли)
	//			   //|			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//			   //|		ИНАЧЕ 0
	//			   //|	КОНЕЦ КАК ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст,
	//			   // -СБ Кузнецова С.
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеАктивы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеДолгосрочныеАктивы_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СырьеИМатериалы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СырьеИМатериалы_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НЗП)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НЗП_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ГотоваяПродукция)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ГотоваяПродукция_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТоварыВПути)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ТоварыВПути_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИзменениеСтоимостиЗапасов)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ИзменениеСтоимостиЗапасов_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПокупателейИЗаказчиков)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗадолженностьПокупателейИЗаказчиков_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НДСкВозмещению)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НДСкВозмещению_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыВыданныеТекущие)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПредоплатыВыданныеТекущие_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПоНалогам)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПредоплатыПоНалогам_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочаяДЗ)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочаяДЗ_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_БонусыПолученныеОтПоставщиков)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК БонусыПолученныеОтПоставщиков_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РезервПоСомнительнымДолгам)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК РезервПоСомнительнымДолгам_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеЗаймыВыданные)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КраткосрочныеЗаймыВыданные_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеДолговыеЦБ)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КраткосрочныеДолговыеЦБ_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеКраткосрочныеИнвестиции)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеКраткосрочныеИнвестиции_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Касса)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК Касса_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасчетныйСчет)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК РасчетныйСчет_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВалютныйСчет)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ВалютныйСчет_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СпецСчетаВБанках)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СпецСчетаВБанках_КонОст,
	//			   // +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СпецСчетаВБанкахВВалюте)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СпецСчетаВБанкахВВалюте_КонОст,
	//			   // -СБ Кузнецова С.
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДСвПути)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДСвПути_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеОборотныеАктивы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеОборотныеАктивы_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АкционерныйКапитал)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК АкционерныйКапитал_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЭмиссионныйДоход)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЭмиссионныйДоход_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СобственныеВыкупленныеАкции)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК СобственныеВыкупленныеАкции_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РезервыПоЗаконодательству)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК РезервыПоЗаконодательству_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДобавочныйКапитал)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДобавочныйКапитал_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльЗаГод)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрибыльЗаГод_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РаспределениеАктивов)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК РаспределениеАктивов_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбъявленныеДивиденды)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОбъявленныеДивиденды_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаПредыдущийПериод)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДивидендыЗаПредыдущийПериод_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаТекущийПериод)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДивидендыЗаТекущийПериод_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРезервы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеРезервы_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТрансляционнаяРазница)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ТрансляционнаяРазница_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДолгосрочныеКредитыИЗаймы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДолгосрочныеКредитыИЗаймы_КонОст,
	//			   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеДолгосрочные451)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОбязательстваПоАрендеДолгосрочные451_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеДолгосрочныеВВалюте)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст,
	//			   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОНО)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОНО_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДБП)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ДБП_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДолгосрочныеОбязательства)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочиеДолгосрочныеОбязательства_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КраткосрочныеКредитыИЗаймы)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КраткосрочныеКредитыИЗаймы_КонОст,
	//			    // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеКраткосрочные551)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОбязательстваПоАрендеКраткосрочные551_КонОст,
	//			   |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбязательстваПоАрендеКраткосрочныеВВалюте)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст,
	//			   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТекущаяДоляДолгосрочныхОбязательств)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ТекущаяДоляДолгосрочныхОбязательств_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КЗинвестиционная)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КЗинвестиционная_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КЗоперационная)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КЗоперационная_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредоплатыПолученные)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПредоплатыПолученные_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПоНалогам)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗадолженностьПоНалогам_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПередПерсоналом)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗадолженностьПередПерсоналом_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочаяКЗ)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ПрочаяКЗ_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЦелевоеФинансирование)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЦелевоеФинансирование_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПоНалогуНаПрибыль)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗадолженностьПоНалогуНаПрибыль_КонОст,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗадолженностьПередУчредителями)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК ЗадолженностьПередУчредителями_КонОст
	//               |ПОМЕСТИТЬ ВТ_Данные
	//               |ИЗ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	ВТ_СоставПериметраКонсолидации КАК ВТ_СоставПериметраКонсолидации
	//			   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	//               |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	//			   // -СБ. Кузнецова С.
	//               |				&КонецПериодаГраница,
	//               |				,
	//               |				,
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|				Организация В
	//			   //|					(ВЫБРАТЬ
	//			   //|						ВТ.Организация
	//			   //|					ИЗ
	//			   //|						ВТ_СоставПериметраКонсолидации КАК ВТ)) КАК бит_Дополнительный_2Остатки
	//			   //|		ПО ВТ_СоставПериметраКонсолидации.Организация = бит_Дополнительный_2Остатки.Организация
	//			   // +СБ. Кузнецова С. 2014-11-05 
	//			   |				Организация В (&Организации)
	//			   // -СБ. Кузнецова С.
	//			   |						) КАК бит_Дополнительный_2Остатки
	//			   // -СБ. Кузнецова С.
	#КонецОбласти
	//Заменено на:
	//Организация - ТаблицаЗначений - Организация, Максимальный период вхождения
	ТекстКонечныеОстатки = ПолучитьТекстОбъединенияКонОст(Организации, Запрос);
	Запрос.Текст = ТекстКонечныеОстатки + "
				   |
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-09 (#3267)	
		           |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.Организация,
	               |	СУММА(ВТ_Данные.ЗемляВИС_КонОст) КАК ЗемляВИС_КонОст,
	               |	СУММА(ВТ_Данные.ЗданияВИС_КонОст) КАК ЗданияВИС_КонОст,
	               |	СУММА(ВТ_Данные.Земля_КонОст) КАК Земля_КонОст,
	               |	СУММА(ВТ_Данные.Здания_КонОст) КАК Здания_КонОст,
	               |	СУММА(ВТ_Данные.ХолодильноеОборудование_КонОст) КАК ХолодильноеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ТехнологическоеОборудование_КонОст) КАК ТехнологическоеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.СухоеОборудование_КонОст) КАК СухоеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.СкладскоеОборудование_КонОст) КАК СкладскоеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ОхранноеОборудование_КонОст) КАК ОхранноеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.РекламноеОборудование_КонОст) КАК РекламноеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ITОборудование_КонОст) КАК ITОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ИнженерноеОборудование_КонОст) КАК ИнженерноеОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ПрочееОборудование_КонОст) КАК ПрочееОборудование_КонОст,
	               |	СУММА(ВТ_Данные.ОСдо40тсч_КонОст) КАК ОСдо40тсч_КонОст,
	               |	СУММА(ВТ_Данные.НеотделимыеУлучшения_КонОст) КАК НеотделимыеУлучшения_КонОст,
	               |	СУММА(ВТ_Данные.Транспорт_КонОст) КАК Транспорт_КонОст,
	               |	СУММА(ВТ_Данные.Сооружения_КонОст) КАК Сооружения_КонОст,
	               |	СУММА(ВТ_Данные.ОСдляПродажи_КонОст) КАК ОСдляПродажи_КонОст,
	               |	СУММА(ВТ_Данные.НЗСземля_КонОст) КАК НЗСземля_КонОст,
	               |	СУММА(ВТ_Данные.НЗСздания_КонОст) КАК НЗСздания_КонОст,
	               |	СУММА(ВТ_Данные.НЗСоборудование_КонОст) КАК НЗСоборудование_КонОст,
				   |	СУММА(ВТ_Данные.ОСВПути_КонОст) КАК ОСВПути_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Данные.АктивыВФормеПраваПользованияЗемля_КонОст) КАК АктивыВФормеПраваПользованияЗемля_КонОст,
				   |	СУММА(ВТ_Данные.АктивыВФормеПраваПользованияТорговыеПомещения_КонОст) КАК АктивыВФормеПраваПользованияТорговыеПомещения_КонОст,
				   |	СУММА(ВТ_Данные.АктивыВФормеПраваПользованияПрочее_КонОст) КАК АктивыВФормеПраваПользованияПрочее_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Данные.Гудвил_КонОст) КАК Гудвил_КонОст,
				   // +СБ Кузнецова С. 2016-12-09 Redmine 2747
	               |	СУММА(ВТ_Данные.ПраваАренды_КонОст) КАК ПраваАренды_КонОст,
				   // -СБ Кузнецова С.
	               |	СУММА(ВТ_Данные.НМА_КонОст) КАК НМА_КонОст,
	               |	СУММА(ВТ_Данные.ДолгосрочныеИнвестицииВПаиИАкции_КонОст) КАК ДолгосрочныеИнвестицииВПаиИАкции_КонОст,
	               |	СУММА(ВТ_Данные.ДолгосрочныеЗаймыВыданные_КонОст) КАК ДолгосрочныеЗаймыВыданные_КонОст,
	               |	СУММА(ВТ_Данные.ДолгосрочныеДолговыеЦБ_КонОст) КАК ДолгосрочныеДолговыеЦБ_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеДолгосрочныеИнвестиции_КонОст) КАК ПрочиеДолгосрочныеИнвестиции_КонОст,
	               |	СУММА(ВТ_Данные.ОтложенныеНалоговыеАктивы_КонОст) КАК ОтложенныеНалоговыеАктивы_КонОст,
	               |	СУММА(ВТ_Данные.ДолгосрочнаяДЗ_КонОст) КАК ДолгосрочнаяДЗ_КонОст,
	               |	СУММА(ВТ_Данные.ПредоплатыПоОСиНМА_КонОст) КАК ПредоплатыПоОСиНМА_КонОст,
	               |	СУММА(ВТ_Данные.ПредоплатыПоАренде_КонОст) КАК ПредоплатыПоАренде_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеДолгосрочныеАвансыВыданные_КонОст) КАК ПрочиеДолгосрочныеАвансыВыданные_КонОст,
				   // +СБ Кузнецова С. 2016-12-09 Redmine 2747
				   //|	СУММА(ВТ_Данные.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст) КАК ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст,
				   // -СБ Кузнецова С.
	               |	СУММА(ВТ_Данные.ПрочиеДолгосрочныеАктивы_КонОст) КАК ПрочиеДолгосрочныеАктивы_КонОст,
	               |	СУММА(ВТ_Данные.СырьеИМатериалы_КонОст) КАК СырьеИМатериалы_КонОст,
	               |	СУММА(ВТ_Данные.НЗП_КонОст) КАК НЗП_КонОст,
	               |	СУММА(ВТ_Данные.ГотоваяПродукция_КонОст) КАК ГотоваяПродукция_КонОст,
	               |	СУММА(ВТ_Данные.ТоварыВПути_КонОст) КАК ТоварыВПути_КонОст,
	               |	СУММА(ВТ_Данные.ИзменениеСтоимостиЗапасов_КонОст) КАК ИзменениеСтоимостиЗапасов_КонОст,
	               |	СУММА(ВТ_Данные.ЗадолженностьПокупателейИЗаказчиков_КонОст) КАК ЗадолженностьПокупателейИЗаказчиков_КонОст,
	               |	СУММА(ВТ_Данные.НДСкВозмещению_КонОст) КАК НДСкВозмещению_КонОст,
	               |	СУММА(ВТ_Данные.ПредоплатыВыданныеТекущие_КонОст) КАК ПредоплатыВыданныеТекущие_КонОст,
	               |	СУММА(ВТ_Данные.ПредоплатыПоНалогам_КонОст) КАК ПредоплатыПоНалогам_КонОст,
	               |	СУММА(ВТ_Данные.ПрочаяДЗ_КонОст) КАК ПрочаяДЗ_КонОст,
				   |	СУММА(ВТ_Данные.БонусыПолученныеОтПоставщиков_КонОст) КАК БонусыПолученныеОтПоставщиков_КонОст,
	               |	СУММА(ВТ_Данные.РезервПоСомнительнымДолгам_КонОст) КАК РезервПоСомнительнымДолгам_КонОст,
	               |	СУММА(ВТ_Данные.КраткосрочныеЗаймыВыданные_КонОст) КАК КраткосрочныеЗаймыВыданные_КонОст,
	               |	СУММА(ВТ_Данные.КраткосрочныеДолговыеЦБ_КонОст) КАК КраткосрочныеДолговыеЦБ_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеКраткосрочныеИнвестиции_КонОст) КАК ПрочиеКраткосрочныеИнвестиции_КонОст,
	               |	СУММА(ВТ_Данные.Касса_КонОст) КАК Касса_КонОст,
	               |	СУММА(ВТ_Данные.РасчетныйСчет_КонОст) КАК РасчетныйСчет_КонОст,
	               |	СУММА(ВТ_Данные.ВалютныйСчет_КонОст) КАК ВалютныйСчет_КонОст,
	               |	СУММА(ВТ_Данные.СпецСчетаВБанках_КонОст) КАК СпецСчетаВБанках_КонОст,
				   // +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
	               |	СУММА(ВТ_Данные.СпецСчетаВБанкахВВалюте_КонОст) КАК СпецСчетаВБанкахВВалюте_КонОст,
				   // -СБ Кузнецова С.
	               |	СУММА(ВТ_Данные.ДСвПути_КонОст) КАК ДСвПути_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеОборотныеАктивы_КонОст) КАК ПрочиеОборотныеАктивы_КонОст,
	               |	СУММА(ВТ_Данные.АкционерныйКапитал_КонОст) КАК АкционерныйКапитал_КонОст,
	               |	СУММА(ВТ_Данные.ЭмиссионныйДоход_КонОст) КАК ЭмиссионныйДоход_КонОст,
	               |	СУММА(ВТ_Данные.СобственныеВыкупленныеАкции_КонОст) КАК СобственныеВыкупленныеАкции_КонОст,
	               |	СУММА(ВТ_Данные.РезервыПоЗаконодательству_КонОст) КАК РезервыПоЗаконодательству_КонОст,
	               |	СУММА(ВТ_Данные.ДобавочныйКапитал_КонОст) КАК ДобавочныйКапитал_КонОст,
	               |	СУММА(ВТ_Данные.ПрибыльЗаГод_КонОст) КАК ПрибыльЗаГод_КонОст,
	               |	СУММА(ВТ_Данные.РаспределениеАктивов_КонОст) КАК РаспределениеАктивов_КонОст,
	               |	СУММА(ВТ_Данные.ОбъявленныеДивиденды_КонОст) КАК ОбъявленныеДивиденды_КонОст,
	               |	СУММА(ВТ_Данные.ДивидендыЗаПредыдущийПериод_КонОст) КАК ДивидендыЗаПредыдущийПериод_КонОст,
	               |	СУММА(ВТ_Данные.ДивидендыЗаТекущийПериод_КонОст) КАК ДивидендыЗаТекущийПериод_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеРезервы_КонОст) КАК ПрочиеРезервы_КонОст,
	               |	СУММА(ВТ_Данные.ТрансляционнаяРазница_КонОст) КАК ТрансляционнаяРазница_КонОст,
	               |	СУММА(ВТ_Данные.ДолгосрочныеКредитыИЗаймы_КонОст) КАК ДолгосрочныеКредитыИЗаймы_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Данные.ОбязательстваПоАрендеДолгосрочные451_КонОст) КАК ОбязательстваПоАрендеДолгосрочные451_КонОст,
				   |	СУММА(ВТ_Данные.ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст) КАК ОбязательстваПоАрендеДолгосрочныеВВалюте_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Данные.ОНО_КонОст) КАК ОНО_КонОст,
	               |	СУММА(ВТ_Данные.ДБП_КонОст) КАК ДБП_КонОст,
	               |	СУММА(ВТ_Данные.ПрочиеДолгосрочныеОбязательства_КонОст) КАК ПрочиеДолгосрочныеОбязательства_КонОст,
				   |	СУММА(ВТ_Данные.КраткосрочныеКредитыИЗаймы_КонОст) КАК КраткосрочныеКредитыИЗаймы_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Данные.ОбязательстваПоАрендеКраткосрочные551_КонОст) КАК ОбязательстваПоАрендеКраткосрочные551_КонОст,
				   |	СУММА(ВТ_Данные.ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст) КАК ОбязательстваПоАрендеКраткосрочныеВВалюте_КонОст,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Данные.ТекущаяДоляДолгосрочныхОбязательств_КонОст) КАК ТекущаяДоляДолгосрочныхОбязательств_КонОст,
	               |	СУММА(ВТ_Данные.КЗинвестиционная_КонОст) КАК КЗинвестиционная_КонОст,
	               |	СУММА(ВТ_Данные.КЗоперационная_КонОст) КАК КЗоперационная_КонОст,
	               |	СУММА(ВТ_Данные.ПредоплатыПолученные_КонОст) КАК ПредоплатыПолученные_КонОст,
	               |	СУММА(ВТ_Данные.ЗадолженностьПоНалогам_КонОст) КАК ЗадолженностьПоНалогам_КонОст,
	               |	СУММА(ВТ_Данные.ЗадолженностьПередПерсоналом_КонОст) КАК ЗадолженностьПередПерсоналом_КонОст,
	               |	СУММА(ВТ_Данные.ПрочаяКЗ_КонОст) КАК ПрочаяКЗ_КонОст,
	               //ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
				   //|	СУММА(ВТ_Данные.ЦелевоеФинансирование_КонОст) КАК ЦелевоеФинансирование_КонОст,
				   //ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	               |	СУММА(ВТ_Данные.ЗадолженностьПоНалогуНаПрибыль_КонОст) КАК ЗадолженностьПоНалогуНаПрибыль_КонОст,
	               |	СУММА(ВТ_Данные.ЗадолженностьПередУчредителями_КонОст) КАК ЗадолженностьПередУчредителями_КонОст
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Данные.Организация";
				   
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-09 (#3527)
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	//Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецДня(Объект.КонецПериода), ВидГраницы.Включая));
	//// +СБ. Кузнецова С. 2014-09-05 
	////Запрос.УстановитьПараметр("ПериметрКонсолидации", ПериметрКонсолидации);
	//// -СБ. Кузнецова С.
	//// +СБ. Кузнецова С. 2014-11-05 
	//Запрос.УстановитьПараметр("Организации", Организации);
	//// -СБ. Кузнецова С.
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-09 (#3527)			   
	УстановитьПараметрыСчетов(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // СформироватьТаблицуКонечныеОстатки()

// Функция возвращает таблицу значений начальных остатков для показателей отчета
//
// +СБ. Кузнецова С. 2014-11-05 
//Функция СформироватьТаблицуНачальныеОстатки()
&НаСервере
Функция СформироватьТаблицуНачальныеОстатки(Организации)
// -СБ. Кузнецова С.
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   // +СБ. Кузнецова С. 2014-09-05 
				   //|	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
				   //|ПОМЕСТИТЬ ВТ_СоставПериметраКонсолидации
				   //|ИЗ
				   //|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&НачалоПериода, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
				   //|ГДЕ
				   //|	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &НачалоПериода
				   //|			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
				   //|;
				   //|
				   //|////////////////////////////////////////////////////////////////////////////////
				   //|ВЫБРАТЬ РАЗРЕШЕННЫЕ
				   //|	ВТ_СоставПериметраКонсолидации.Организация,
	               |	бит_Дополнительный_2Остатки.Организация,
				   // -СБ. Кузнецова С.
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаПредыдущийПериод)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДивидендыЗаПредыдущийПериод_НачОст
	               |ПОМЕСТИТЬ ВТ_Итоги
	               |ИЗ
				   // +СБ. Кузнецова С. 2014-09-05 
				   //|	ВТ_СоставПериметраКонсолидации КАК ВТ_СоставПериметраКонсолидации
				   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	               |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
				   // -СБ. Кузнецова С.
	               |				&НачалоПериодаГраница,
	               |				,
	               |				,
				   // +СБ. Кузнецова С. 2014-09-05 
				   //|				Организация В
				   //|					(ВЫБРАТЬ
				   //|						ВТ.Организация
				   //|					ИЗ
				   //|						ВТ_СоставПериметраКонсолидации КАК ВТ)) КАК бит_Дополнительный_2Остатки
				   //|		ПО ВТ_СоставПериметраКонсолидации.Организация = бит_Дополнительный_2Остатки.Организация
				   // +СБ. Кузнецова С. 2014-11-05 
				   |				Организация В (&Организации)
				   // -СБ. Кузнецова С.
	               |						) КАК бит_Дополнительный_2Остатки
				   // -СБ. Кузнецова С.
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итоги.Организация,
	               |	СУММА(ВТ_Итоги.ДивидендыЗаПредыдущийПериод_НачОст) КАК ДивидендыЗаПредыдущийПериод_НачОст
	               |ИЗ
	               |	ВТ_Итоги КАК ВТ_Итоги
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Итоги.Организация";
	Запрос.УстановитьПараметр("НачалоПериодаГраница", Новый Граница(Объект.НачалоПериода - 1, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	// +СБ. Кузнецова С. 2014-09-05 
	//Запрос.УстановитьПараметр("ПериметрКонсолидации", ПериметрКонсолидации);
	// -СБ. Кузнецова С.
	// +СБ. Кузнецова С. 2014-11-05 
	Запрос.УстановитьПараметр("Организации", Организации);
	// -СБ. Кузнецова С.
	УстановитьПараметрыСчетов(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // СформироватьТаблицуНачальныеОстатки()

// Функция возвращает таблицу значений оборотов для показателей отчета
//
&НаСервере
Функция СформироватьТаблицуОбороты()
	
	Запрос = Новый Запрос;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)
	#Область ТекстЗапроса
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	Запрос.Текст = "ВЫБРАТЬ
	               |	&НачалоПериода КАК НачалоПериода,
	               |	&КонецПериода КАК КонецПериода,
	               |	бит_му_ПериметрыКонсолидации.Ссылка КАК ПериметрКонсолидации
	               |ПОМЕСТИТЬ ВТ_ПустойПериод
	               |ИЗ
	               |	Справочник.бит_му_ПериметрыКонсолидации КАК бит_му_ПериметрыКонсолидации
	               |ГДЕ
	               |	бит_му_ПериметрыКонсолидации.Ссылка = &ПериметрКонсолидации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПериметрКонсолидации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	бит_му_СоставПериметровКонсолидации.Период КАК Период,
	               |	бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации
	               |ПОМЕСТИТЬ ВТ_ИзменениеВРамкахПериода
	               |ИЗ
	               |	РегистрСведений.бит_му_СоставПериметровКонсолидации КАК бит_му_СоставПериметровКонсолидации
	               |ГДЕ
	               |	бит_му_СоставПериметровКонсолидации.Период > &НачалоПериода
	               |	И бит_му_СоставПериметровКонсолидации.Период < &КонецПериода
	               |	И бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации = &ПериметрКонсолидации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_му_СоставПериметровКонсолидации.Период,
	               |	бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	бит_му_СоставПериметровКонсолидации.ДатаОкончания,
	               |	бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации
	               |ИЗ
	               |	РегистрСведений.бит_му_СоставПериметровКонсолидации КАК бит_му_СоставПериметровКонсолидации
	               |ГДЕ
	               |	бит_му_СоставПериметровКонсолидации.ДатаОкончания > &НачалоПериода
	               |	И бит_му_СоставПериметровКонсолидации.ДатаОкончания < &КонецПериода
	               |	И бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации = &ПериметрКонсолидации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации,
	               |	бит_му_СоставПериметровКонсолидации.ДатаОкончания
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	&НачалоПериода КАК ПериодНач,
	               |	МИНИМУМ(ЕСТЬNULL(ВТ_ИзменениеВРамкахПериода.Период, &КонецПериода)) КАК ПериодКон,
	               |	ЕСТЬNULL(ВТ_ИзменениеВРамкахПериода.ПериметрКонсолидации, ВТ_ПустойПериод.ПериметрКонсолидации) КАК ПериметрКонсолидации
	               |ПОМЕСТИТЬ ВТ_ПериодыИзмененияСоставаПериметраКонсолидации
	               |ИЗ
	               |	ВТ_ПустойПериод КАК ВТ_ПустойПериод
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИзменениеВРамкахПериода КАК ВТ_ИзменениеВРамкахПериода
	               |		ПО ВТ_ПустойПериод.КонецПериода <> ВТ_ИзменениеВРамкахПериода.Период
	               |			И ВТ_ПустойПериод.НачалоПериода <> ВТ_ИзменениеВРамкахПериода.Период
	               |			И ВТ_ПустойПериод.ПериметрКонсолидации = ВТ_ИзменениеВРамкахПериода.ПериметрКонсолидации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЕСТЬNULL(ВТ_ИзменениеВРамкахПериода.ПериметрКонсолидации, ВТ_ПустойПериод.ПериметрКонсолидации)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ВТ_ИзменениеВРамкахПериодаНач.Период,
	               |	МИНИМУМ(ВТ_ИзменениеВРамкахПериодаКон.Период),
	               |	ВТ_ИзменениеВРамкахПериодаНач.ПериметрКонсолидации
	               |ИЗ
	               |	ВТ_ИзменениеВРамкахПериода КАК ВТ_ИзменениеВРамкахПериодаНач
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИзменениеВРамкахПериода КАК ВТ_ИзменениеВРамкахПериодаКон
	               |		ПО ВТ_ИзменениеВРамкахПериодаНач.Период < ВТ_ИзменениеВРамкахПериодаКон.Период
	               |			И ВТ_ИзменениеВРамкахПериодаНач.ПериметрКонсолидации = ВТ_ИзменениеВРамкахПериодаКон.ПериметрКонсолидации
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ИзменениеВРамкахПериодаНач.Период,
	               |	ВТ_ИзменениеВРамкахПериодаНач.ПериметрКонсолидации
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ВТ_ИзменениеВРамкахПериода.Период),
	               |	&КонецПериода,
	               |	ВТ_ИзменениеВРамкахПериода.ПериметрКонсолидации
	               |ИЗ
	               |	ВТ_ИзменениеВРамкахПериода КАК ВТ_ИзменениеВРамкахПериода
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ИзменениеВРамкахПериода.ПериметрКонсолидации
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПериодНач,
	               |	ПериметрКонсолидации
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериодНач КАК ПериодНач,
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериодКон КАК ПериодКон,
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериметрКонсолидации,
	               |	бит_му_СоставПериметровКонсолидации.Организация КАК Организация
				   |ПОМЕСТИТЬ ВТ_ПараметрыОборотов				   
				   |ИЗ
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации КАК ВТ_ПериодыИзмененияСоставаПериметраКонсолидации
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(, ) КАК бит_му_СоставПериметровКонсолидации
	               |		ПО ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериметрКонсолидации = бит_му_СоставПериметровКонсолидации.ПериметрКонсолидации
	               |			И (бит_му_СоставПериметровКонсолидации.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	               |				ИЛИ ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериодКон <= бит_му_СоставПериметровКонсолидации.ДатаОкончания)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериметрКонсолидации,
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериодНач,
	               |	ВТ_ПериодыИзмененияСоставаПериметраКонсолидации.ПериодКон,
	               |	бит_му_СоставПериметровКонсолидации.Организация
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ПериодНач,
	               |	ПериодКон,
	               |	Организация
	               |;
				   |
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-02 (#3527)
   				   |////////////////////////////////////////////////////////////////////////////////
				   |ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	МАКСИМУМ(ВТ_ПараметрыОборотов.ПериодКон) КАК ПериодКон,
				   |	ВТ_ПараметрыОборотов.ПериметрКонсолидации КАК ПериметрКонсолидации,
				   |	ВТ_ПараметрыОборотов.Организация КАК Организация
				   |ПОМЕСТИТЬ ВТ_ПараметрыОборотов_МаксимальныйПериод
				   |ИЗ
				   |	ВТ_ПараметрыОборотов КАК ВТ_ПараметрыОборотов
				   |СГРУППИРОВАТЬ ПО
				   |	ВТ_ПараметрыОборотов.ПериметрКонсолидации,
				   |	ВТ_ПараметрыОборотов.Организация
				   |ИНДЕКСИРОВАТЬ ПО
	               |	ПериодКон,
	               |	Организация
	               |;
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-02 (#3527)
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВТ_ПараметрыОборотов.Организация,
	               |	ВЫБОР
				   |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльЗаГод)
				   |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрибыльЗаГод)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльЗаГод_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДивидендыЗаТекущийПериод)
				   |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДивидендыЗаТекущийПериод_Оборот,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВыручкаОтРеализацииТоваров)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВыручкаОтРеализацииТоваров)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВыручкаОтРеализацииТоваров_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВыручкаОтРеализацииПродукцииОбщепита)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВыручкаОтРеализацииПродукцииОбщепита)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВыручкаОтРеализацииПродукцииОбщепита_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтАрендыЗемли)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтАрендыЗемли)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтАрендыЗемли_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтАрендыОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтАрендыОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтАрендыОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтАрендыПомещений)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтАрендыПомещений)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтАрендыПомещений_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтАрендыПлощадейПодБанкоматы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтАрендыПлощадейПодБанкоматы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтАрендыПлощадейПодБанкоматы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеДоходыОтАренды)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеДоходыОтАренды)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеДоходыОтАренды_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтАрендыРекламныхПлощадей)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтАрендыРекламныхПлощадей)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтАрендыРекламныхПлощадей_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходыОтПрочихРекламныхУслуг)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходыОтПрочихРекламныхУслуг)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходыОтПрочихРекламныхУслуг_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СебестоимостьРеализацииТоваров)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СебестоимостьРеализацииТоваров)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СебестоимостьРеализацииТоваров_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СебестоимостьРеализацииПродукцииОбщепита)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СебестоимостьРеализацииПродукцииОбщепита)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СебестоимостьРеализацииПродукцииОбщепита_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПремииПоставщиковРетро)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПремииПоставщиковРетро)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремииПоставщиковРетро_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПремииПоставщиковПромо)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПремииПоставщиковПромо)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремииПоставщиковПромо_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПремииПоставщиковАдм)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПремииПоставщиковАдм)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремииПоставщиковАдм_Оборот,
				   //СофтЛаб Начало 2018-09-09 3074
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПремииПоставщиковРекламныеУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПремииПоставщиковРекламныеУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремииПоставщиковРекламныеУслуги_Оборот,
				   //СофтЛаб Конец 2018-09-09 3074
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходОтЛогистики)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходОтЛогистики)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходОтЛогистики_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ШтрафыПоставщиков)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ШтрафыПоставщиков)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ШтрафыПоставщиков_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаОбработкуТоваровВнеш)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаОбработкуТоваровВнеш)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаОбработкуТоваровВнеш_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаОбработкуТоваровВнутр)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаОбработкуТоваровВнутр)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаОбработкуТоваровВнутр_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаДоставку)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаДоставку)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаДоставку_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеЗатратыНаЛогистику)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеЗатратыНаЛогистику)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеЗатратыНаЛогистику_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаТаможенныеУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаТаможенныеУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаТаможенныеУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаТаможенныеПлатежи)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаТаможенныеПлатежи)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаТаможенныеПлатежи_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаХранениеТоваров)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаХранениеТоваров)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаХранениеТоваров_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КомпенсацияЛогистическихЗатрат)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КомпенсацияЛогистическихЗатрат)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КомпенсацияЛогистическихЗатрат_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтоимостьЛогистикиДляМагазинов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтоимостьЛогистикиДляМагазинов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтоимостьЛогистикиДляМагазинов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗащитныеМатериалы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗащитныеМатериалы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗащитныеМатериалы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Упаковка)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Упаковка)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Упаковка_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЭлементыЦенников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЭлементыЦенников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЭлементыЦенников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПотериТовараИнв)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПотериТовараИнв)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПотериТовараИнв_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПотериТовараСпис)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПотериТовараСпис)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПотериТовараСпис_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РезервПодСнижениеСтоимостиЗапасов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РезервПодСнижениеСтоимостиЗапасов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РезервПодСнижениеСтоимостиЗапасов_Оборот,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КорректировкаСебестоимостиПоОбратнойРеализации)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КорректировкаСебестоимостиПоОбратнойРеализации)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КорректировкаСебестоимостиПоОбратнойРеализации_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ФОТ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ФОТ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ФОТ_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтраховыеВзносы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтраховыеВзносы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтраховыеВзносы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Пособия)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Пособия)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Пособия_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПремированиеСотрудников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПремированиеСотрудников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПремированиеСотрудников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтрахованиеСотрудников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтрахованиеСотрудников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтрахованиеСотрудников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПитаниеСотрудников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПитаниеСотрудников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПитаниеСотрудников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_МедосмотрСотрудников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_МедосмотрСотрудников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МедосмотрСотрудников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОрганизацияКорпМероприятий)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОрганизацияКорпМероприятий)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОрганизацияКорпМероприятий_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Аутсорсинг)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Аутсорсинг)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Аутсорсинг_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРасходыНаСотрудников)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеРасходыНаСотрудников)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРасходыНаСотрудников_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КомандировочныеРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КомандировочныеРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КомандировочныеРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбучениеПерсонала)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОбучениеПерсонала)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбучениеПерсонала_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СпецОбучениеПерсонала)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СпецОбучениеПерсонала)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СпецОбучениеПерсонала_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПоискПерсонала)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПоискПерсонала)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоискПерсонала_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаКвартир)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаКвартир)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаКвартир_Оборот,
				   //СофтЛаб Начало 2019-06-20 #3383
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаКвартирСотрудникам)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаКвартирСотрудникам)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаКвартирСотрудникам_Оборот,
				   //СофтЛаб Конец 2019-06-20 #3383
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВыплатаНаОсновеАкций)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВыплатаНаОсновеАкций)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВыплатаНаОсновеАкций_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АмортизацияОС)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АмортизацияОС)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АмортизацияОС_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АмортизацияОСдо40тсч)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АмортизацияОСдо40тсч)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АмортизацияОСдо40тсч_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АмортизацияНМА)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АмортизацияНМА)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АмортизацияНМА_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АмортизацияICLL)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АмортизацияICLL)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АмортизацияICLL_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АмортизацияАктивовВФормеПраваПользования)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало	2020-07-02 (#3803)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АмортизацияАктивовВФормеПраваПользования)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец	2020-07-02 (#3803)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АмортизацияАктивовВФормеПраваПользования_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВнутрОформление)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВнутрОформление)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВнутрОформление_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаПромоакции)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаПромоакции)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаПромоакции_Оборот,
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИнтернетРекламаСМИ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ИнтернетРекламаСМИ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИнтернетРекламаСМИ_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЛистовкиАудитРаспространение)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЛистовкиАудитРаспространение)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЛистовкиАудитРаспространение_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СМСViber)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СМСViber)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СМСViber_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РегиональныеПромоакции)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РегиональныеПромоакции)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РегиональныеПромоакции_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Видеореклама)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Видеореклама)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Видеореклама_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Радиореклама)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Радиореклама)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Радиореклама_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИнтернетРекламаECom)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ИнтернетРекламаECom)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИнтернетРекламаECom_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПоддержкаБрендаСТМ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПоддержкаБрендаСТМ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоддержкаБрендаСТМ_Оборот,
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)				   
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Листовки)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Листовки)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Листовки_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВнешРеклама)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВнешРеклама)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВнешРеклама_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОреклОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОреклОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОреклОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_PRактивность)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_PRактивность)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК PRактивность_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_МаркетинговыеИсследования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_МаркетинговыеИсследования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МаркетинговыеИсследования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПоддержкаБренда)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПоддержкаБренда)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПоддержкаБренда_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрограммаЛояльности)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрограммаЛояльности)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрограммаЛояльности_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РекламаИНавигация)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РекламаИНавигация)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РекламаИНавигация_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Мониторинг)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Мониторинг)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Мониторинг_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРасходыМаркетинга)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеРасходыМаркетинга)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРасходыМаркетинга_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаЗемли)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаЗемли)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаЗемли_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаТоргПомещений)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаТоргПомещений)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаТоргПомещений_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаОфиса)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаОфиса)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаОфиса_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаАрендуСклада)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаАрендуСклада)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаАрендуСклада_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочаяАренда)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочаяАренда)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочаяАренда_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбслуживаниеЗданийПомещений)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОбслуживаниеЗданийПомещений)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбслуживаниеЗданийПомещений_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтЗданийПомещений)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтЗданийПомещений)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтЗданийПомещений_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтИОбслуживаниеТерритории)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтИОбслуживаниеТерритории)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтИОбслуживаниеТерритории_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОавтотранспорта)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОавтотранспорта)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОавтотранспорта_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОинженерногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОинженерногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОинженерногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОкулинарногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОкулинарногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОкулинарногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбслуживаниеОфисногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОбслуживаниеОфисногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбслуживаниеОфисногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОохранногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОохранногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОохранногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОскладскогоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОскладскогоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОскладскогоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОсухогоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОсухогоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОсухогоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОхолодильногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОхолодильногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОхолодильногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОэлектронногоОборудованияЭКЛЗ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОэлектронногоОборудованияЭКЛЗ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОэлектронногоОборудованияЭКЛЗ_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОэлектронногоОборудованияЕжемесячное)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОэлектронногоОборудованияЕжемесячное)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОэлектронногоОборудованияЕжемесячное_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОэлектронногоОборудованияПлановое)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОэлектронногоОборудованияПлановое)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОэлектронногоОборудованияПлановое_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТОпрочихОСиИнвентаря)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТОпрочихОСиИнвентаря)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТОпрочихОСиИнвентаря_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтИнженерногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтИнженерногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтИнженерногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтКулинарногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтКулинарногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтКулинарногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтСкладскогоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтСкладскогоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтСкладскогоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтСухогоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтСухогоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтСухогоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтХолодильногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтХолодильногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтХолодильногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтЭлектронногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтЭлектронногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтЭлектронногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтОхранногоОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтОхранногоОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтОхранногоОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РемонтПрочихОСиИнвентаря)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РемонтПрочихОСиИнвентаря)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РемонтПрочихОСиИнвентаря_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочийРемонт)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочийРемонт)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочийРемонт_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОзеленениеТерритории)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОзеленениеТерритории)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОзеленениеТерритории_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СодержаниеШатров)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СодержаниеШатров)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СодержаниеШатров_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Водоснабжение)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Водоснабжение)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Водоснабжение_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Газоснабжение)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Газоснабжение)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Газоснабжение_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Теплоснабжение)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Теплоснабжение)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Теплоснабжение_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Электроснабжение)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Электроснабжение)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Электроснабжение_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасходыНаСодержаниеДизельгенераторовТопливо)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РасходыНаСодержаниеДизельгенераторовТопливо)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РасходыНаСодержаниеДизельгенераторовТопливо_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасходыНаСодержаниеДизельгенераторовУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РасходыНаСодержаниеДизельгенераторовУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РасходыНаСодержаниеДизельгенераторовУслуги_Оборот,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасходыНаСодержаниеДизельгенераторов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РасходыНаСодержаниеДизельгенераторов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РасходыНаСодержаниеДизельгенераторов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеКоммРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеКоммРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеКоммРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВывозМусора)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВывозМусора)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВывозМусора_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВыручкаОтРеализацииВторсырья)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВыручкаОтРеализацииВторсырья)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВыручкаОтРеализацииВторсырья_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДератизацияДезинфекция)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДератизацияДезинфекция)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДератизацияДезинфекция_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОчисткаЖиропескоуловителей)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОчисткаЖиропескоуловителей)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОчисткаЖиропескоуловителей_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УборкаПомещенийУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УборкаПомещенийУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УборкаПомещенийУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УборкаПомещенийРасходники)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УборкаПомещенийРасходники)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УборкаПомещенийРасходники_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УборкаТерритории)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УборкаТерритории)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УборкаТерритории_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СборТележек)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СборТележек)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СборТележек_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УборкаКрыши)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УборкаКрыши)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УборкаКрыши_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ВывозСнега)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ВывозСнега)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ВывозСнега_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЧисткаКовров)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЧисткаКовров)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЧисткаКовров_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтационарнаяСвязьИнтернет)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтационарнаяСвязьИнтернет)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтационарнаяСвязьИнтернет_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_МобильнаяСвязь)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_МобильнаяСвязь)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МобильнаяСвязь_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПочтовыеРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПочтовыеРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПочтовыеРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаОборудования)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаОборудования)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаОборудования_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АрендаДизельгенераторов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АрендаДизельгенераторов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АрендаДизельгенераторов_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ШтрафыПДКиПНВ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ШтрафыПДКиПНВ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ШтрафыПДКиПНВ_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроизводственныйИнвентарь)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроизводственныйИнвентарь)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроизводственныйИнвентарь_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ХозтоварыИнвентарь)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ХозтоварыИнвентарь)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ХозтоварыИнвентарь_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_МатериалыДляАУПиМедикаменты)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_МатериалыДляАУПиМедикаменты)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК МатериалыДляАУПиМедикаменты_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КанцТовары)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КанцТовары)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КанцТовары_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Спецодежда)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Спецодежда)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Спецодежда_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Топливо)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Топливо)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Топливо_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УслугиОхраннойСигнализации)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УслугиОхраннойСигнализации)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УслугиОхраннойСигнализации_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРасходыНаОхрану)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеРасходыНаОхрану)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРасходыНаОхрану_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Эквайринг)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Эквайринг)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Эквайринг_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтрахованиеИмуществаТоварныхЗапасов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтрахованиеИмуществаТоварныхЗапасов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтрахованиеИмуществаТоварныхЗапасов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтрахованиеГрузов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтрахованиеГрузов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтрахованиеГрузов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СтрахованиеАвтотранспорта)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СтрахованиеАвтотранспорта)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СтрахованиеАвтотранспорта_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочееСтрахование)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочееСтрахование)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочееСтрахование_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_БанковскоеОбслуживание)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_БанковскоеОбслуживание)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БанковскоеОбслуживание_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_СодержаниеАрхива)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_СодержаниеАрхива)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК СодержаниеАрхива_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_АудитИОценка)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_АудитИОценка)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК АудитИОценка_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОформлениеДокументов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОформлениеДокументов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОформлениеДокументов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗатратыНаПО)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗатратыНаПО)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗатратыНаПО_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РазрешительнаяДокументацияСертификацияЛицензирование)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РазрешительнаяДокументацияСертификацияЛицензирование)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РазрешительнаяДокументацияСертификацияЛицензирование_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЮрУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЮрУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЮрУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ИнфУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ИнфУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ИнфУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_БухОбслуживание)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_БухОбслуживание)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК БухОбслуживание_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КонсУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КонсУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КонсУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НалогНаИмущество)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_НалогНаИмущество)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НалогНаИмущество_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ЗемНалог)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ЗемНалог)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ЗемНалог_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТранспНалог)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТранспНалог)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТранспНалог_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НДСнепринимаемыйКвычету)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_НДСнепринимаемыйКвычету)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НДСнепринимаемыйКвычету_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеОперНалоги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеОперНалоги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеОперНалоги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ТранспУслуги)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ТранспУслуги)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ТранспУслуги_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПредставительскиеРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПредставительскиеРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПредставительскиеРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльУбытокОтРеализацииОСиПрочихАктивов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрибыльУбытокОтРеализацииОСиПрочихАктивов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльУбытокОтСписанияКЗДЗ)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрибыльУбытокОтСписанияКЗДЗ)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльУбытокОтСписанияКЗДЗ_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльУбытокОтПереоценкиИнвСобственности)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрибыльУбытокОтПереоценкиИнвСобственности)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбесценениеОСНМА)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОбесценениеОСНМА)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбесценениеОСНМА_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ОбесценениеАктивовВФормеПраваПользования)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-07-02 (#3803)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ОбесценениеАктивовВФормеПраваПользования)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-07-02 (#3803)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ОбесценениеАктивовВФормеПраваПользования_Оборот,
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрибыльУбытокОтВыбытияМодификацииАктивов)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-07-03 (#3803)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрибыльУбытокОтВыбытияМодификацииАктивов)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-07-03 (#3803)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрибыльУбытокОтВыбытияМодификацииАктивов_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходОтСтраховогоВозмещения)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходОтСтраховогоВозмещения)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходОтСтраховогоВозмещения_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходОтШтрафовНеустоек)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходОтШтрафовНеустоек)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходОтШтрафовНеустоек_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_УбытокОтШтрафовНеустоек)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_УбытокОтШтрафовНеустоек)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК УбытокОтШтрафовНеустоек_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_Благотворительность)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_Благотворительность)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК Благотворительность_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеОперДоходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеОперДоходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеОперДоходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеОперРасходы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеОперРасходы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеОперРасходы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ДоходОтУчастияВАссоцКомпаниях)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ДоходОтУчастияВАссоцКомпаниях)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ДоходОтУчастияВАссоцКомпаниях_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроцентыПоОстаткамНаСчетах)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроцентыПоОстаткамНаСчетах)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентыПоОстаткамНаСчетах_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроцентыПолучениеПоПредостКредитамЗаймам)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроцентыПолучениеПоПредостКредитамЗаймам)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроцентыНачисленныеПоДолгОбязательствам)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроцентыНачисленныеПоДолгОбязательствам)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентыНачисленныеПоДолгОбязательствам_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроцентыНачисленныеПоФинАренде)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроцентыНачисленныеПоФинАренде)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентыНачисленныеПоФинАренде_Оборот,
				    // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПроцентыНачисленныеПоОбязательствамПоАренде)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-07-02 (#3803)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПроцентыНачисленныеПоОбязательствамПоАренде)
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-07-02 (#3803)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПроцентыНачисленныеПоОбязательствамПоАренде_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ХеджированиеПроцентов)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ХеджированиеПроцентов)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ХеджированиеПроцентов_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КомиссииПоКредитам)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КомиссииПоКредитам)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КомиссииПоКредитам_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_ПрочиеРасходыНаФинансирование)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_ПрочиеРасходыНаФинансирование)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК ПрочиеРасходыНаФинансирование_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КурсовыеРазницы)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КурсовыеРазницы)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КурсовыеРазницы_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_РасходПоНалогуНаПрибыль)
	               |				И НЕ ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_РасходПоНалогуНаПрибыль)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК РасходПоНалогуНаПрибыль_Оборот
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)
				   |    ,ВТ_ПараметрыОборотов.ПериодКон КАК ПериодКонПараметра 
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	               |ПОМЕСТИТЬ ВТ_Итоги
	               |ИЗ
	               |	ВТ_ПараметрыОборотов КАК ВТ_ПараметрыОборотов
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-05 (#3527)
				   |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПараметрыОборотов_МаксимальныйПериод
				   |			ПО ВТ_ПараметрыОборотов.Организация = ВТ_ПараметрыОборотов_МаксимальныйПериод.Организация
				   |			 И ВТ_ПараметрыОборотов.ПериметрКонсолидации = ВТ_ПараметрыОборотов_МаксимальныйПериод.ПериметрКонсолидации
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-05 (#3527)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(
	               |				&НачалоПериода,
	               |				&КонецПериодаГраница,
	               |				День,
	               |				,
	               |				,
	               |				Организация В
	               |					(ВЫБРАТЬ
	               |						ВТ.Организация
	               |					ИЗ
	               |						ВТ_ПараметрыОборотов КАК ВТ),
	               |				,
	               |				) КАК бит_Дополнительный_2Обороты
	               |		ПО ВТ_ПараметрыОборотов.Организация = бит_Дополнительный_2Обороты.Организация
	               |			И ВТ_ПараметрыОборотов.ПериодНач <= бит_Дополнительный_2Обороты.Период
	               |			И ВТ_ПараметрыОборотов.ПериодКон > бит_Дополнительный_2Обороты.Период
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Итоги.Организация,
	               |	СУММА(ВТ_Итоги.ПрибыльЗаГод_Оборот) КАК ПрибыльЗаГод_Оборот,
	               |	СУММА(ВТ_Итоги.ДивидендыЗаТекущийПериод_Оборот) КАК ДивидендыЗаТекущийПериод_Оборот,
	               |	СУММА(ВТ_Итоги.ВыручкаОтРеализацииТоваров_Оборот) КАК ВыручкаОтРеализацииТоваров_Оборот,
	               |	СУММА(ВТ_Итоги.ВыручкаОтРеализацииПродукцииОбщепита_Оборот) КАК ВыручкаОтРеализацииПродукцииОбщепита_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтАрендыЗемли_Оборот) КАК ДоходыОтАрендыЗемли_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтАрендыОборудования_Оборот) КАК ДоходыОтАрендыОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтАрендыПомещений_Оборот) КАК ДоходыОтАрендыПомещений_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтАрендыПлощадейПодБанкоматы_Оборот) КАК ДоходыОтАрендыПлощадейПодБанкоматы_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеДоходыОтАренды_Оборот) КАК ПрочиеДоходыОтАренды_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтАрендыРекламныхПлощадей_Оборот) КАК ДоходыОтАрендыРекламныхПлощадей_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходыОтПрочихРекламныхУслуг_Оборот) КАК ДоходыОтПрочихРекламныхУслуг_Оборот,
	               |	СУММА(ВТ_Итоги.СебестоимостьРеализацииТоваров_Оборот) КАК СебестоимостьРеализацииТоваров_Оборот,
	               |	СУММА(ВТ_Итоги.СебестоимостьРеализацииПродукцииОбщепита_Оборот) КАК СебестоимостьРеализацииПродукцииОбщепита_Оборот,
	               |	СУММА(ВТ_Итоги.ПремииПоставщиковРетро_Оборот) КАК ПремииПоставщиковРетро_Оборот,
	               |	СУММА(ВТ_Итоги.ПремииПоставщиковПромо_Оборот) КАК ПремииПоставщиковПромо_Оборот,
	               |	СУММА(ВТ_Итоги.ПремииПоставщиковАдм_Оборот) КАК ПремииПоставщиковАдм_Оборот,
				   //СофтЛаб Начало 2018-09-09 3074
				   |	СУММА(ВТ_Итоги.ПремииПоставщиковРекламныеУслуги_Оборот) КАК ПремииПоставщиковРекламныеУслуги_Оборот,
				   //СофтЛаб Конец 2018-09-09 3074
	               |	СУММА(ВТ_Итоги.ДоходОтЛогистики_Оборот) КАК ДоходОтЛогистики_Оборот,
	               |	СУММА(ВТ_Итоги.ШтрафыПоставщиков_Оборот) КАК ШтрафыПоставщиков_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаОбработкуТоваровВнеш_Оборот) КАК ЗатратыНаОбработкуТоваровВнеш_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаОбработкуТоваровВнутр_Оборот) КАК ЗатратыНаОбработкуТоваровВнутр_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаДоставку_Оборот) КАК ЗатратыНаДоставку_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеЗатратыНаЛогистику_Оборот) КАК ПрочиеЗатратыНаЛогистику_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаТаможенныеУслуги_Оборот) КАК ЗатратыНаТаможенныеУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаТаможенныеПлатежи_Оборот) КАК ЗатратыНаТаможенныеПлатежи_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаХранениеТоваров_Оборот) КАК ЗатратыНаХранениеТоваров_Оборот,
	               |	СУММА(ВТ_Итоги.КомпенсацияЛогистическихЗатрат_Оборот) КАК КомпенсацияЛогистическихЗатрат_Оборот,
	               |	СУММА(ВТ_Итоги.СтоимостьЛогистикиДляМагазинов_Оборот) КАК СтоимостьЛогистикиДляМагазинов_Оборот,
	               |	СУММА(ВТ_Итоги.ЗащитныеМатериалы_Оборот) КАК ЗащитныеМатериалы_Оборот,
	               |	СУММА(ВТ_Итоги.Упаковка_Оборот) КАК Упаковка_Оборот,
	               |	СУММА(ВТ_Итоги.ЭлементыЦенников_Оборот) КАК ЭлементыЦенников_Оборот,
	               |	СУММА(ВТ_Итоги.ПотериТовараИнв_Оборот) КАК ПотериТовараИнв_Оборот,
	               |	СУММА(ВТ_Итоги.ПотериТовараСпис_Оборот) КАК ПотериТовараСпис_Оборот,
	               |	СУММА(ВТ_Итоги.РезервПодСнижениеСтоимостиЗапасов_Оборот) КАК РезервПодСнижениеСтоимостиЗапасов_Оборот,
				   |	СУММА(ВТ_Итоги.КорректировкаСебестоимостиПоОбратнойРеализации_Оборот) КАК КорректировкаСебестоимостиПоОбратнойРеализации_Оборот,
	               |	СУММА(ВТ_Итоги.ФОТ_Оборот) КАК ФОТ_Оборот,
	               |	СУММА(ВТ_Итоги.СтраховыеВзносы_Оборот) КАК СтраховыеВзносы_Оборот,
	               |	СУММА(ВТ_Итоги.Пособия_Оборот) КАК Пособия_Оборот,
	               |	СУММА(ВТ_Итоги.ПремированиеСотрудников_Оборот) КАК ПремированиеСотрудников_Оборот,
	               |	СУММА(ВТ_Итоги.СтрахованиеСотрудников_Оборот) КАК СтрахованиеСотрудников_Оборот,
	               |	СУММА(ВТ_Итоги.ПитаниеСотрудников_Оборот) КАК ПитаниеСотрудников_Оборот,
	               |	СУММА(ВТ_Итоги.МедосмотрСотрудников_Оборот) КАК МедосмотрСотрудников_Оборот,
	               |	СУММА(ВТ_Итоги.ОрганизацияКорпМероприятий_Оборот) КАК ОрганизацияКорпМероприятий_Оборот,
	               |	СУММА(ВТ_Итоги.Аутсорсинг_Оборот) КАК Аутсорсинг_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеРасходыНаСотрудников_Оборот) КАК ПрочиеРасходыНаСотрудников_Оборот,
	               |	СУММА(ВТ_Итоги.КомандировочныеРасходы_Оборот) КАК КомандировочныеРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.ОбучениеПерсонала_Оборот) КАК ОбучениеПерсонала_Оборот,
	               |	СУММА(ВТ_Итоги.СпецОбучениеПерсонала_Оборот) КАК СпецОбучениеПерсонала_Оборот,
	               |	СУММА(ВТ_Итоги.ПоискПерсонала_Оборот) КАК ПоискПерсонала_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаКвартир_Оборот) КАК АрендаКвартир_Оборот,
				   //СофтЛаб Начало 2019-06-20 #3383
				   |	СУММА(ВТ_Итоги.АрендаКвартирСотрудникам_Оборот) КАК АрендаКвартирСотрудникам_Оборот,
				   //СофтЛаб Конец 2019-06-20 #3383
	               |	СУММА(ВТ_Итоги.ВыплатаНаОсновеАкций_Оборот) КАК ВыплатаНаОсновеАкций_Оборот,
	               |	СУММА(ВТ_Итоги.АмортизацияОС_Оборот) КАК АмортизацияОС_Оборот,
	               |	СУММА(ВТ_Итоги.АмортизацияОСдо40тсч_Оборот) КАК АмортизацияОСдо40тсч_Оборот,
	               |	СУММА(ВТ_Итоги.АмортизацияНМА_Оборот) КАК АмортизацияНМА_Оборот,
	               |	СУММА(ВТ_Итоги.АмортизацияICLL_Оборот) КАК АмортизацияICLL_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Итоги.АмортизацияАктивовВФормеПраваПользования_Оборот) КАК АмортизацияАктивовВФормеПраваПользования_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Итоги.ВнутрОформление_Оборот) КАК ВнутрОформление_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаПромоакции_Оборот) КАК ЗатратыНаПромоакции_Оборот,
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	               |	СУММА(ВТ_Итоги.ИнтернетРекламаСМИ_Оборот) КАК ИнтернетРекламаСМИ_Оборот,
	               |	СУММА(ВТ_Итоги.ЛистовкиАудитРаспространение_Оборот) КАК ЛистовкиАудитРаспространение_Оборот,
	               |	СУММА(ВТ_Итоги.СМСViber_Оборот) КАК СМСViber_Оборот,
	               |	СУММА(ВТ_Итоги.РегиональныеПромоакции_Оборот) КАК РегиональныеПромоакции_Оборот,
	               |	СУММА(ВТ_Итоги.Видеореклама_Оборот) КАК Видеореклама_Оборот,
	               |	СУММА(ВТ_Итоги.Радиореклама_Оборот) КАК Радиореклама_Оборот,
	               |	СУММА(ВТ_Итоги.ИнтернетРекламаECom_Оборот) КАК ИнтернетРекламаECom_Оборот,
	               |	СУММА(ВТ_Итоги.ПоддержкаБрендаСТМ_Оборот) КАК ПоддержкаБрендаСТМ_Оборот,
					//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	               |	СУММА(ВТ_Итоги.Листовки_Оборот) КАК Листовки_Оборот,
	               |	СУММА(ВТ_Итоги.ВнешРеклама_Оборот) КАК ВнешРеклама_Оборот,
	               |	СУММА(ВТ_Итоги.ТОреклОборудования_Оборот) КАК ТОреклОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.PRактивность_Оборот) КАК PRактивность_Оборот,
	               |	СУММА(ВТ_Итоги.МаркетинговыеИсследования_Оборот) КАК МаркетинговыеИсследования_Оборот,
	               |	СУММА(ВТ_Итоги.ПоддержкаБренда_Оборот) КАК ПоддержкаБренда_Оборот,
	               |	СУММА(ВТ_Итоги.ПрограммаЛояльности_Оборот) КАК ПрограммаЛояльности_Оборот,
	               |	СУММА(ВТ_Итоги.РекламаИНавигация_Оборот) КАК РекламаИНавигация_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
				   |	СУММА(ВТ_Итоги.Мониторинг_Оборот) КАК Мониторинг_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	               |	СУММА(ВТ_Итоги.ПрочиеРасходыМаркетинга_Оборот) КАК ПрочиеРасходыМаркетинга_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаЗемли_Оборот) КАК АрендаЗемли_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаТоргПомещений_Оборот) КАК АрендаТоргПомещений_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаОфиса_Оборот) КАК АрендаОфиса_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаАрендуСклада_Оборот) КАК ЗатратыНаАрендуСклада_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочаяАренда_Оборот) КАК ПрочаяАренда_Оборот,
	               |	СУММА(ВТ_Итоги.ОбслуживаниеЗданийПомещений_Оборот) КАК ОбслуживаниеЗданийПомещений_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтЗданийПомещений_Оборот) КАК РемонтЗданийПомещений_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтИОбслуживаниеТерритории_Оборот) КАК РемонтИОбслуживаниеТерритории_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот) КАК РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот,
	               |	СУММА(ВТ_Итоги.ТОавтотранспорта_Оборот) КАК ТОавтотранспорта_Оборот,
	               |	СУММА(ВТ_Итоги.ТОинженерногоОборудования_Оборот) КАК ТОинженерногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОкулинарногоОборудования_Оборот) КАК ТОкулинарногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ОбслуживаниеОфисногоОборудования_Оборот) КАК ОбслуживаниеОфисногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОохранногоОборудования_Оборот) КАК ТОохранногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОскладскогоОборудования_Оборот) КАК ТОскладскогоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОсухогоОборудования_Оборот) КАК ТОсухогоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОхолодильногоОборудования_Оборот) КАК ТОхолодильногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.ТОэлектронногоОборудованияЭКЛЗ_Оборот) КАК ТОэлектронногоОборудованияЭКЛЗ_Оборот,
	               |	СУММА(ВТ_Итоги.ТОэлектронногоОборудованияЕжемесячное_Оборот) КАК ТОэлектронногоОборудованияЕжемесячное_Оборот,
	               |	СУММА(ВТ_Итоги.ТОэлектронногоОборудованияПлановое_Оборот) КАК ТОэлектронногоОборудованияПлановое_Оборот,
	               |	СУММА(ВТ_Итоги.ТОпрочихОСиИнвентаря_Оборот) КАК ТОпрочихОСиИнвентаря_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтИнженерногоОборудования_Оборот) КАК РемонтИнженерногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтКулинарногоОборудования_Оборот) КАК РемонтКулинарногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтСкладскогоОборудования_Оборот) КАК РемонтСкладскогоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтСухогоОборудования_Оборот) КАК РемонтСухогоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтХолодильногоОборудования_Оборот) КАК РемонтХолодильногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтЭлектронногоОборудования_Оборот) КАК РемонтЭлектронногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтОхранногоОборудования_Оборот) КАК РемонтОхранногоОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.РемонтПрочихОСиИнвентаря_Оборот) КАК РемонтПрочихОСиИнвентаря_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочийРемонт_Оборот) КАК ПрочийРемонт_Оборот,
	               |	СУММА(ВТ_Итоги.ОзеленениеТерритории_Оборот) КАК ОзеленениеТерритории_Оборот,
	               |	СУММА(ВТ_Итоги.СодержаниеШатров_Оборот) КАК СодержаниеШатров_Оборот,
	               |	СУММА(ВТ_Итоги.Водоснабжение_Оборот) КАК Водоснабжение_Оборот,
	               |	СУММА(ВТ_Итоги.Газоснабжение_Оборот) КАК Газоснабжение_Оборот,
	               |	СУММА(ВТ_Итоги.Теплоснабжение_Оборот) КАК Теплоснабжение_Оборот,
	               |	СУММА(ВТ_Итоги.Электроснабжение_Оборот) КАК Электроснабжение_Оборот,
	               |	СУММА(ВТ_Итоги.РасходыНаСодержаниеДизельгенераторовТопливо_Оборот) КАК РасходыНаСодержаниеДизельгенераторовТопливо_Оборот,
	               |	СУММА(ВТ_Итоги.РасходыНаСодержаниеДизельгенераторовУслуги_Оборот) КАК РасходыНаСодержаниеДизельгенераторовУслуги_Оборот,
				   |	СУММА(ВТ_Итоги.РасходыНаСодержаниеДизельгенераторов_Оборот) КАК РасходыНаСодержаниеДизельгенераторов_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеКоммРасходы_Оборот) КАК ПрочиеКоммРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.ВывозМусора_Оборот) КАК ВывозМусора_Оборот,
	               |	СУММА(ВТ_Итоги.ВыручкаОтРеализацииВторсырья_Оборот) КАК ВыручкаОтРеализацииВторсырья_Оборот,
	               |	СУММА(ВТ_Итоги.ДератизацияДезинфекция_Оборот) КАК ДератизацияДезинфекция_Оборот,
	               |	СУММА(ВТ_Итоги.ОчисткаЖиропескоуловителей_Оборот) КАК ОчисткаЖиропескоуловителей_Оборот,
	               |	СУММА(ВТ_Итоги.УборкаПомещенийУслуги_Оборот) КАК УборкаПомещенийУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.УборкаПомещенийРасходники_Оборот) КАК УборкаПомещенийРасходники_Оборот,
	               |	СУММА(ВТ_Итоги.УборкаТерритории_Оборот) КАК УборкаТерритории_Оборот,
	               |	СУММА(ВТ_Итоги.СборТележек_Оборот) КАК СборТележек_Оборот,
	               |	СУММА(ВТ_Итоги.УборкаКрыши_Оборот) КАК УборкаКрыши_Оборот,
	               |	СУММА(ВТ_Итоги.ВывозСнега_Оборот) КАК ВывозСнега_Оборот,
	               |	СУММА(ВТ_Итоги.ЧисткаКовров_Оборот) КАК ЧисткаКовров_Оборот,
	               |	СУММА(ВТ_Итоги.СтационарнаяСвязьИнтернет_Оборот) КАК СтационарнаяСвязьИнтернет_Оборот,
	               |	СУММА(ВТ_Итоги.МобильнаяСвязь_Оборот) КАК МобильнаяСвязь_Оборот,
	               |	СУММА(ВТ_Итоги.ПочтовыеРасходы_Оборот) КАК ПочтовыеРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаОборудования_Оборот) КАК АрендаОборудования_Оборот,
	               |	СУММА(ВТ_Итоги.АрендаДизельгенераторов_Оборот) КАК АрендаДизельгенераторов_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
				   |	СУММА(ВТ_Итоги.ШтрафыПДКиПНВ_Оборот) КАК ШтрафыПДКиПНВ_Оборот,
				   // ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
				   |	СУММА(ВТ_Итоги.ПроизводственныйИнвентарь_Оборот) КАК ПроизводственныйИнвентарь_Оборот,
	               |	СУММА(ВТ_Итоги.ХозтоварыИнвентарь_Оборот) КАК ХозтоварыИнвентарь_Оборот,
	               |	СУММА(ВТ_Итоги.МатериалыДляАУПиМедикаменты_Оборот) КАК МатериалыДляАУПиМедикаменты_Оборот,
	               |	СУММА(ВТ_Итоги.КанцТовары_Оборот) КАК КанцТовары_Оборот,
	               |	СУММА(ВТ_Итоги.Спецодежда_Оборот) КАК Спецодежда_Оборот,
	               |	СУММА(ВТ_Итоги.Топливо_Оборот) КАК Топливо_Оборот,
	               |	СУММА(ВТ_Итоги.УслугиОхраннойСигнализации_Оборот) КАК УслугиОхраннойСигнализации_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеРасходыНаОхрану_Оборот) КАК ПрочиеРасходыНаОхрану_Оборот,
	               |	СУММА(ВТ_Итоги.Эквайринг_Оборот) КАК Эквайринг_Оборот,
	               |	СУММА(ВТ_Итоги.СтрахованиеИмуществаТоварныхЗапасов_Оборот) КАК СтрахованиеИмуществаТоварныхЗапасов_Оборот,
	               |	СУММА(ВТ_Итоги.СтрахованиеГрузов_Оборот) КАК СтрахованиеГрузов_Оборот,
	               |	СУММА(ВТ_Итоги.СтрахованиеАвтотранспорта_Оборот) КАК СтрахованиеАвтотранспорта_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочееСтрахование_Оборот) КАК ПрочееСтрахование_Оборот,
	               |	СУММА(ВТ_Итоги.БанковскоеОбслуживание_Оборот) КАК БанковскоеОбслуживание_Оборот,
	               |	СУММА(ВТ_Итоги.СодержаниеАрхива_Оборот) КАК СодержаниеАрхива_Оборот,
	               |	СУММА(ВТ_Итоги.АудитИОценка_Оборот) КАК АудитИОценка_Оборот,
	               |	СУММА(ВТ_Итоги.ОформлениеДокументов_Оборот) КАК ОформлениеДокументов_Оборот,
	               |	СУММА(ВТ_Итоги.ЗатратыНаПО_Оборот) КАК ЗатратыНаПО_Оборот,
	               |	СУММА(ВТ_Итоги.РазрешительнаяДокументацияСертификацияЛицензирование_Оборот) КАК РазрешительнаяДокументацияСертификацияЛицензирование_Оборот,
	               |	СУММА(ВТ_Итоги.ЮрУслуги_Оборот) КАК ЮрУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.ИнфУслуги_Оборот) КАК ИнфУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.БухОбслуживание_Оборот) КАК БухОбслуживание_Оборот,
	               |	СУММА(ВТ_Итоги.КонсУслуги_Оборот) КАК КонсУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.НалогНаИмущество_Оборот) КАК НалогНаИмущество_Оборот,
	               |	СУММА(ВТ_Итоги.ЗемНалог_Оборот) КАК ЗемНалог_Оборот,
	               |	СУММА(ВТ_Итоги.ТранспНалог_Оборот) КАК ТранспНалог_Оборот,
	               |	СУММА(ВТ_Итоги.НДСнепринимаемыйКвычету_Оборот) КАК НДСнепринимаемыйКвычету_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеОперНалоги_Оборот) КАК ПрочиеОперНалоги_Оборот,
	               |	СУММА(ВТ_Итоги.ТранспУслуги_Оборот) КАК ТранспУслуги_Оборот,
	               |	СУММА(ВТ_Итоги.ПредставительскиеРасходы_Оборот) КАК ПредставительскиеРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеРасходы_Оборот) КАК ПрочиеРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот) КАК ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот,
	               |	СУММА(ВТ_Итоги.ПрибыльУбытокОтСписанияКЗДЗ_Оборот) КАК ПрибыльУбытокОтСписанияКЗДЗ_Оборот,
	               |	СУММА(ВТ_Итоги.ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот) КАК ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот,
	               |	СУММА(ВТ_Итоги.ОбесценениеОСНМА_Оборот) КАК ОбесценениеОСНМА_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Итоги.ОбесценениеАктивовВФормеПраваПользования_Оборот) КАК ОбесценениеАктивовВФормеПраваПользования_Оборот,
				   |	СУММА(ВТ_Итоги.ПрибыльУбытокОтВыбытияМодификацииАктивов_Оборот) КАК ПрибыльУбытокОтВыбытияМодификацииАктивов_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Итоги.ДоходОтСтраховогоВозмещения_Оборот) КАК ДоходОтСтраховогоВозмещения_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходОтШтрафовНеустоек_Оборот) КАК ДоходОтШтрафовНеустоек_Оборот,
	               |	СУММА(ВТ_Итоги.УбытокОтШтрафовНеустоек_Оборот) КАК УбытокОтШтрафовНеустоек_Оборот,
	               |	СУММА(ВТ_Итоги.Благотворительность_Оборот) КАК Благотворительность_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеОперДоходы_Оборот) КАК ПрочиеОперДоходы_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеОперРасходы_Оборот) КАК ПрочиеОперРасходы_Оборот,
	               |	СУММА(ВТ_Итоги.ДоходОтУчастияВАссоцКомпаниях_Оборот) КАК ДоходОтУчастияВАссоцКомпаниях_Оборот,
	               |	СУММА(ВТ_Итоги.ПроцентыПоОстаткамНаСчетах_Оборот) КАК ПроцентыПоОстаткамНаСчетах_Оборот,
	               |	СУММА(ВТ_Итоги.ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот) КАК ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот,
	               |	СУММА(ВТ_Итоги.ПроцентыНачисленныеПоДолгОбязательствам_Оборот) КАК ПроцентыНачисленныеПоДолгОбязательствам_Оборот,
	               |	СУММА(ВТ_Итоги.ПроцентыНачисленныеПоФинАренде_Оборот) КАК ПроцентыНачисленныеПоФинАренде_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
				   |	СУММА(ВТ_Итоги.ПроцентыНачисленныеПоОбязательствамПоАренде_Оборот) КАК ПроцентыНачисленныеПоОбязательствамПоАренде_Оборот,
				   // ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	               |	СУММА(ВТ_Итоги.ХеджированиеПроцентов_Оборот) КАК ХеджированиеПроцентов_Оборот,
	               |	СУММА(ВТ_Итоги.КомиссииПоКредитам_Оборот) КАК КомиссииПоКредитам_Оборот,
	               |	СУММА(ВТ_Итоги.ПрочиеРасходыНаФинансирование_Оборот) КАК ПрочиеРасходыНаФинансирование_Оборот,
	               |	СУММА(ВТ_Итоги.КурсовыеРазницы_Оборот) КАК КурсовыеРазницы_Оборот,
	               |	СУММА(ВТ_Итоги.РасходПоНалогуНаПрибыль_Оборот) КАК РасходПоНалогуНаПрибыль_Оборот
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)
				   |    ,МАКСИМУМ(ВТ_Итоги.ПериодКонПараметра) КАК ПериодКонПараметра 
				   //ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	               |ИЗ
	               |	ВТ_Итоги КАК ВТ_Итоги
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Итоги.Организация";
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)			   
	#КонецОбласти
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецДня(Объект.КонецПериода), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериметрКонсолидации", Объект.ПериметрКонсолидации);
	УстановитьПараметрыСчетов(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // СформироватьТаблицуОбороты()

// Функция возвращает таблицу значений специфических конечных остатков для показателей отчета
//	При расчете остатков исключаются обороты в корреспонденции с заданными счетами
//
// +СБ. Кузнецова С. 2014-11-05 
//Функция СформироватьТаблицуСпецифическиеКонечныеОстатки()
&НаСервере
Функция СформироватьТаблицуСпецифическиеКонечныеОстатки(Организации)
// -СБ. Кузнецова С.
	                                           
	Запрос = Новый Запрос;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-12-09 (#3527)
	//Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	бит_му_СоставПериметровКонсолидацииСрезПоследних.Организация
	//			   //|ПОМЕСТИТЬ ВТ_СоставПериметраКонсолидации
	//			   //|ИЗ
	//			   //|	РегистрСведений.бит_му_СоставПериметровКонсолидации.СрезПоследних(&КонецПериодаГраница, ПериметрКонсолидации = &ПериметрКонсолидации) КАК бит_му_СоставПериметровКонсолидацииСрезПоследних
	//			   //|ГДЕ
	//			   //|	(КОНЕЦПЕРИОДА(бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания, ДЕНЬ) >= &КонецПериода
	//			   //|			ИЛИ бит_му_СоставПериметровКонсолидацииСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1))
	//			   //|;
	//			   //|
	//			   //|////////////////////////////////////////////////////////////////////////////////
	//			   //|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//			   //|	ВТ_СоставПериметраКонсолидации.Организация,
	//               |	бит_Дополнительный_2Остатки.Организация,
	//			   // -СБ. Кузнецова С.
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК НераспределеннаяПрибыльУбытокПрошлыхЛет_КонОст,
	//               |	0 КАК НераспределеннаяПрибыльУбытокПрошлыхЛет_Оборот,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	//               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ КАК КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_КонОст,
	//               |	0 КАК КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_Оборот
	//               |ПОМЕСТИТЬ ВТ_Данные
	//               |ИЗ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	ВТ_СоставПериметраКонсолидации КАК ВТ_СоставПериметраКонсолидации
	//			   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	//               |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(
	//			   // -СБ. Кузнецова С.
	//               |				&КонецПериодаГраница,
	//               |				,
	//               |				,
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|				Организация В
	//			   //|					(ВЫБРАТЬ
	//			   //|						ВТ.Организация
	//			   //|					ИЗ
	//			   //|						ВТ_СоставПериметраКонсолидации КАК ВТ)) КАК бит_Дополнительный_2Остатки
	//			   //|		ПО ВТ_СоставПериметраКонсолидации.Организация = бит_Дополнительный_2Остатки.Организация
	//			   // +СБ. Кузнецова С. 2014-11-05 
	//			   |				Организация В (&Организации)
	//			   // -СБ. Кузнецова С.
	//               |						) КАК бит_Дополнительный_2Остатки
	//			   // -СБ. Кузнецова С.
	//               |
	//               |ОБЪЕДИНИТЬ ВСЕ
	//               |
	//               |ВЫБРАТЬ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	ВТ_СоставПериметраКонсолидации.Организация,
	//               |	бит_Дополнительный_2Обороты.Организация,
	//			   // -СБ. Кузнецова С.
	//               |	0,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	//               |				И ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	//               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ,
	//               |	0,
	//               |	ВЫБОР
	//               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	//               |				И ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	//               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	//               |		ИНАЧЕ 0
	//               |	КОНЕЦ
	//               |ИЗ
	//			   // +СБ. Кузнецова С. 2014-09-05 
	//			   //|	ВТ_СоставПериметраКонсолидации КАК ВТ_СоставПериметраКонсолидации
	//			   //|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериодаГраница, , , , , , ) КАК бит_Дополнительный_2Обороты
	//			   //|		ПО ВТ_СоставПериметраКонсолидации.Организация = бит_Дополнительный_2Обороты.Организация
	//			   // +СБ. Кузнецова С. 2014-11-05 
	//			   //|	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериодаГраница, , , , , , ) КАК бит_Дополнительный_2Обороты
	//			   |	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериодаГраница, , , , Организация В (&Организации), , ) КАК бит_Дополнительный_2Обороты
	//			   // -СБ. Кузнецова С.
	//			   // -СБ. Кузнецова С.
	//               |;
	//               |
	//Заменено на:
	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ				  
	               |	бит_Дополнительный_2Остатки.Организация,				   
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК НераспределеннаяПрибыльУбытокПрошлыхЛет_КонОст,
	               |	0 КАК НераспределеннаяПрибыльУбытокПрошлыхЛет_Оборот,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Остатки.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	               |			ТОГДА бит_Дополнительный_2Остатки.СуммаУпрОстаток
	               |		ИНАЧЕ 0
	               |	КОНЕЦ КАК КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_КонОст,
	               |	0 КАК КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_Оборот
	               |ПОМЕСТИТЬ ВТ_Данные
	               |ИЗ				   
	               |	РегистрБухгалтерии.бит_Дополнительный_2.Остатки(				   
	               |				&КонецПериодаГраница,
	               |				,
	               |				,				   
				   |				Организация В (&Организации)				   
	               |						) КАК бит_Дополнительный_2Остатки
				   |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ				   
	               |	бит_Дополнительный_2Обороты.Организация,				   
	               |	0,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	               |				И ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_НераспределеннаяПрибыльУбытокПрошлыхЛет)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ,
	               |	0,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(бит_Дополнительный_2Обороты.Счет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&Счета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	               |				И ЕСТЬNULL(бит_Дополнительный_2Обороты.КорСчет, НЕОПРЕДЕЛЕНО) В ИЕРАРХИИ (&КорСчета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет)
	               |			ТОГДА бит_Дополнительный_2Обороты.СуммаУпрОборот
	               |		ИНАЧЕ 0
	               |	КОНЕЦ
	               |ИЗ				   
				   |	РегистрБухгалтерии.бит_Дополнительный_2.Обороты(&НачалоПериода, &КонецПериодаГраница, , , , Организация В (&Организации), , ) КАК бит_Дополнительный_2Обороты";
	
	ТекстРезультат = "";         
	пИндекс = 0;
	ТЗПериодов = Организации.Скопировать(,"ПериодКонПараметра");
	ТЗПериодов.Свернуть("ПериодКонПараметра");
	
	Для Каждого СтрПериодов Из ТЗПериодов Цикл 	
		
		мНайденных = Организации.НайтиСтроки(Новый Структура("ПериодКонПараметра", СтрПериодов.ПериодКонПараметра));
		мОрганизаций = Новый Массив;
		
		Для Каждого стрОрганизации Из мНайденных Цикл 
			мОрганизаций.Добавить(стрОрганизации.Организация);
		КонецЦикла;
		
		Если Не ПустаяСтрока(ТекстРезультат) Тогда 
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ ВТ_Данные", ""); 		    
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, " РАЗРЕШЕННЫЕ", "");
		КонецЕсли;
		
		ТекстДоб = СтрЗаменить(ТекстЗапроса, "&КонецПериодаГраница", "&КонецПериодаГраница" + пИндекс);
		ТекстДоб = СтрЗаменить(ТекстДоб	   , "&Организации"		   , "&Организации" 		+ пИндекс);
		
		ТекстРезультат = ТекстРезультат + ?(ПустаяСтрока(ТекстРезультат), "", "
						    |ОБЪЕДИНИТЬ ВСЕ
						    |") + ТекстДоб;	
		
		Запрос.УстановитьПараметр("Организации" 		+ пИндекс, мОрганизаций);
		Запрос.УстановитьПараметр("КонецПериодаГраница" + пИндекс, Новый Граница(КонецДня(СтрПериодов.ПериодКонПараметра), ВидГраницы.Включая));
		
		пИндекс = пИндекс + 1;
		
	КонецЦикла;
	Запрос.Текст = ТекстРезультат + "
				   |;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-12-09 (#3527)
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Данные.Организация,
	               |	СУММА(ВТ_Данные.НераспределеннаяПрибыльУбытокПрошлыхЛет_КонОст - ВТ_Данные.НераспределеннаяПрибыльУбытокПрошлыхЛет_Оборот) КАК НераспределеннаяПрибыльУбытокПрошлыхЛет_СпецКонОст,
	               |	СУММА(ВТ_Данные.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_КонОст - ВТ_Данные.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_Оборот) КАК КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_СпецКонОст
	               |ИЗ
	               |	ВТ_Данные КАК ВТ_Данные
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Данные.Организация";
	Запрос.УстановитьПараметр("НачалоПериода", Объект.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("КонецПериодаГраница", Новый Граница(КонецДня(Объект.КонецПериода), ВидГраницы.Включая));
	// +СБ. Кузнецова С. 2014-09-05 
	//Запрос.УстановитьПараметр("ПериметрКонсолидации", ПериметрКонсолидации);
	// -СБ. Кузнецова С.
	// +СБ. Кузнецова С. 2014-11-05 
	Запрос.УстановитьПараметр("Организации", Организации);
	// -СБ. Кузнецова С.
	УстановитьПараметрыСчетов(Запрос);
	РезультатЗапроса = Запрос.Выполнить();
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции // СформироватьТаблицуКонечныеОстатки()

// Процедура производит установку значений списков счетов для параметров запросов
//
&НаСервере
Процедура УстановитьПараметрыСчетов(Запрос)
	
	// запрос по непредопределенным счетам
	СтруктураДопСчетов = Новый Структура("Счет52107, Счет52108, Счет52109, Счет528, Счет234, Счет17303, Счет226, Счет22412, Счет52612, Счет717, Счет71510, Счет71511, 
											|Счет71509, Счет73309, Счет73310, Счет72410, Счет72316, Счет72623");
	
	ЗапросДоп = Новый Запрос;
	ЗапросДоп.Текст = "ВЫБРАТЬ
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""ДЗ по транспортным услугам поставщикам (технический счет)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет52107,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""ДЗ по премиям (технический счет, в аксапте 62.01.05)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет52108,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""КЗ по товару в валюте""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет52109,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Кредиторская задолженность по начисленным аккрулам""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет528,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Краткосрочные займы выданные (в валюте)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет234,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Обесценение ICLL""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет17303,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Предоплаты выданные текущие в валюте""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет226,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""ДЗ подотчетных лиц в валюте""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет22412,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""КЗ перед подотчетными лицами в валюте""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет52612,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Расходы на проведение экспертизы и ремонта товара, возвращаемого покупателями  (не использовать с 2014 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет717,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Затраты на таможенные услуги (использовать с 2013 года)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет71510,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Затраты на таможенные платежи (использовать с 2013 года)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет71511,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Компенсация логистических затрат""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет71509,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Командировочные расходы: суточные и прочие (использовать только в 2013 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет73309,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Командировочные расходы: транспорт и такси (использовать только в 2013 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет73310,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Аренда квартир (использовать только в 2013 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет72410,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Сервисы для клиентов (использовать только в 2013 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет72316,
	                  |	МАКСИМУМ(ВЫБОР
	                  |			КОГДА бит_му_Настройки.Группа = ""Консолидированные отчеты МСФО""
	                  |					И бит_му_Настройки.ИмяНастройки = ""Компенсация коммунальных услуг арендаторами (использовать с 2013 г.)""
	                  |				ТОГДА бит_му_Настройки.Значение
	                  |			ИНАЧЕ НЕОПРЕДЕЛЕНО
	                  |		КОНЕЦ) КАК Счет72623
	                  |ИЗ
	                  |	РегистрСведений.бит_му_Настройки КАК бит_му_Настройки";
	РезультатЗапроса = ЗапросДоп.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(СтруктураДопСчетов, Выборка);
	КонецЕсли;
	
	СписокСчетов1 = Новый СписокЗначений;
	СписокСчетов1.Добавить(ПланыСчетов.бит_Дополнительный_2.ITОборудование);
	СписокСчетов1.Добавить(ПланыСчетов.бит_Дополнительный_2.ITОборудованиеНакопленнаяАмортизация);
	СписокСчетов1.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеITОборудования);
	Запрос.УстановитьПараметр("Счета_ITОборудование", СписокСчетов1);
	СписокСчетов2 = Новый СписокЗначений;
	СписокСчетов2.Добавить(ПланыСчетов.бит_Дополнительный_2.УставныйКапитал);
	Запрос.УстановитьПараметр("Счета_АкционерныйКапитал", СписокСчетов2);
	СписокСчетов3 = Новый СписокЗначений;
	СписокСчетов3.Добавить(ПланыСчетов.бит_Дополнительный_2.ВалютныйСчет);
	Запрос.УстановитьПараметр("Счета_ВалютныйСчет", СписокСчетов3);
	СписокСчетов4 = Новый СписокЗначений;
	СписокСчетов4.Добавить(ПланыСчетов.бит_Дополнительный_2.ГотоваяПродукция);
	Запрос.УстановитьПараметр("Счета_ГотоваяПродукция", СписокСчетов4);
	СписокСчетов5 = Новый СписокЗначений;
	СписокСчетов5.Добавить(ПланыСчетов.бит_Дополнительный_2.Гудвил_);
	СписокСчетов5.Добавить(ПланыСчетов.бит_Дополнительный_2.ИзменениеСтоимостиГудвила);
	Запрос.УстановитьПараметр("Счета_Гудвил", СписокСчетов5);
	СписокСчетов6 = Новый СписокЗначений;
	СписокСчетов6.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныйОтложенныйДоход_);
	Запрос.УстановитьПараметр("Счета_ДБП", СписокСчетов6);
	СписокСчетов7 = Новый СписокЗначений;
	СписокСчетов7.Добавить(ПланыСчетов.бит_Дополнительный_2.ДивидендыДеньгами);
	Запрос.УстановитьПараметр("Счета_ДивидендыЗаПредыдущийПериод", СписокСчетов7);
	СписокСчетов8 = Новый СписокЗначений;
	СписокСчетов8.Добавить(ПланыСчетов.бит_Дополнительный_2.ДивидендыДеньгами);
	Запрос.УстановитьПараметр("Счета_ДивидендыЗаТекущийПериод", СписокСчетов8);
	СписокСчетов9 = Новый СписокЗначений;
	СписокСчетов9.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнешнийAPIC);
	СписокСчетов9.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнутригрупповойAPIC);
	Запрос.УстановитьПараметр("Счета_ДобавочныйКапитал", СписокСчетов9);
	СписокСчетов10 = Новый СписокЗначений;
	СписокСчетов10.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочнаяДебиторскаяЗадолженность);
	Запрос.УстановитьПараметр("Счета_ДолгосрочнаяДЗ", СписокСчетов10);
	СписокСчетов11 = Новый СписокЗначений;
	СписокСчетов11.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеДолговыеЦБ);
	Запрос.УстановитьПараметр("Счета_ДолгосрочныеДолговыеЦБ", СписокСчетов11);
	СписокСчетов12 = Новый СписокЗначений;
	СписокСчетов12.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеЗаймыВыданные);
	СписокСчетов12.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеЗаймыВыданныеВал);
	Запрос.УстановитьПараметр("Счета_ДолгосрочныеЗаймыВыданные", СписокСчетов12);
	СписокСчетов13 = Новый СписокЗначений;
	СписокСчетов13.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеИнвестицииВПаиАкции);
	Запрос.УстановитьПараметр("Счета_ДолгосрочныеИнвестицииВПаиИАкции", СписокСчетов13);
	СписокСчетов14 = Новый СписокЗначений;
	СписокСчетов14.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеКредитыИЗаймыОсновнаяСумма);
	СписокСчетов14.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеКредитыИЗаймыОсновнаяСуммаВал);
	СписокСчетов14.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеКредитыИЗаймыПроценты);
	СписокСчетов14.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеКредитыИЗаймыПроцентыВал);
	СписокСчетов14.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеОблигационныеЗаймыОсновнаяСумма);
	Запрос.УстановитьПараметр("Счета_ДолгосрочныеКредитыИЗаймы", СписокСчетов14);
	СписокСчетов15 = Новый СписокЗначений;
	СписокСчетов15.Добавить(ПланыСчетов.бит_Дополнительный_2.ДенежныеСредстваВПути);
	СписокСчетов15.Добавить(ПланыСчетов.бит_Дополнительный_2.ДенежныеСредстваВПутиВал);
	Запрос.УстановитьПараметр("Счета_ДСвПути", СписокСчетов15);
	СписокСчетов16 = Новый СписокЗначений;
	СписокСчетов16.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗадолженностьПередПерсоналом);
	СписокСчетов16.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗадолженностьПоВыплатамНаОсновеАкций);
	Запрос.УстановитьПараметр("Счета_ЗадолженностьПередПерсоналом", СписокСчетов16);
	СписокСчетов17 = Новый СписокЗначений;
	СписокСчетов17.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗадолженностьПередУчредителями_);
	Запрос.УстановитьПараметр("Счета_ЗадолженностьПередУчредителями", СписокСчетов17);
	СписокСчетов18 = Новый СписокЗначений;
	СписокСчетов18.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗпоТовару);
	СписокСчетов18.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗпоРаботамУслугам);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов18.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗПокупателейЗаказчиков);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ЗадолженностьПокупателейИЗаказчиков", СписокСчетов18);
	СписокСчетов19 = Новый СписокЗначений;
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.НалогНаДоходыФизическихЛиз);
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.ЕСН);
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.НДС);
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.ТранспортныйНалог);
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.НалогНаИмущество);
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеНАлоги);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов19.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗадолженностьПоОперационнымНалогам);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ЗадолженностьПоНалогам", СписокСчетов19);
	СписокСчетов20 = Новый СписокЗначений;
	СписокСчетов20.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗадолженностьПоНалогуНаприбыль_);
	Запрос.УстановитьПараметр("Счета_ЗадолженностьПоНалогуНаПрибыль", СписокСчетов20);
	СписокСчетов21 = Новый СписокЗначений;
	СписокСчетов21.Добавить(ПланыСчетов.бит_Дополнительный_2.Здания);
	СписокСчетов21.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗданияНакопленнаяАмортизация);
	СписокСчетов21.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеЗданий);
	Запрос.УстановитьПараметр("Счета_Здания", СписокСчетов21);
	СписокСчетов22 = Новый СписокЗначений;
	СписокСчетов22.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗданияИнв);
	Запрос.УстановитьПараметр("Счета_ЗданияВИС", СписокСчетов22);
	СписокСчетов23 = Новый СписокЗначений;
	СписокСчетов23.Добавить(ПланыСчетов.бит_Дополнительный_2.Земля);
	СписокСчетов23.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеЗемли);
	Запрос.УстановитьПараметр("Счета_Земля", СписокСчетов23);
	СписокСчетов24 = Новый СписокЗначений;
	СписокСчетов24.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗемляИнв);
	Запрос.УстановитьПараметр("Счета_ЗемляВИС", СписокСчетов24);
	СписокСчетов25 = Новый СписокЗначений;
	СписокСчетов25.Добавить(ПланыСчетов.бит_Дополнительный_2.ИзменениеСтоимостиЗапасов);
	Запрос.УстановитьПараметр("Счета_ИзменениеСтоимостиЗапасов", СписокСчетов25);
	СписокСчетов26 = Новый СписокЗначений;
	СписокСчетов26.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнженерноеОборудование);
	СписокСчетов26.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнженерноеОборудованиеНакопленнаяАмортизация);
	СписокСчетов26.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеИнженерногоОборудования);
	Запрос.УстановитьПараметр("Счета_ИнженерноеОборудование", СписокСчетов26);
	СписокСчетов27 = Новый СписокЗначений;
	СписокСчетов27.Добавить(ПланыСчетов.бит_Дополнительный_2.Касса);
	Запрос.УстановитьПараметр("Счета_Касса", СписокСчетов27);
	СписокСчетов28 = Новый СписокЗначений;
	СписокСчетов28.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоИнвестиционнаяКраткоср);
	СписокСчетов28.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоИнвестиционнаяКраткосрВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов28.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоИнвестиционнаяВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_КЗинвестиционная", СписокСчетов28);
	СписокСчетов29 = Новый СписокЗначений;
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоТоваруКраткоср);
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоОперационнаяКраткоср);
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоОперационнаяКраткосрВал);
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗпоПремиямТехническийСчет);
	Если СтруктураДопСчетов.Счет52107 <> Неопределено Тогда
		СписокСчетов29.Добавить(СтруктураДопСчетов.Счет52107);
	КонецЕсли;
	Если СтруктураДопСчетов.Счет52108 <> Неопределено Тогда
		СписокСчетов29.Добавить(СтруктураДопСчетов.Счет52108);
	КонецЕсли;
	Если СтруктураДопСчетов.Счет52109 <> Неопределено Тогда
		СписокСчетов29.Добавить(СтруктураДопСчетов.Счет52109); 
	КонецЕсли;
	Если СтруктураДопСчетов.Счет528 <> Неопределено Тогда
		СписокСчетов29.Добавить(СтруктураДопСчетов.Счет528);
	КонецЕсли;
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоОперационнаяРуб);
	СписокСчетов29.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоОперационнаяВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_КЗоперационная", СписокСчетов29);
	СписокСчетов30 = Новый СписокЗначений;
	СписокСчетов30.Добавить(ПланыСчетов.бит_Дополнительный_2.ПоправкаРезультатовПрошлыхЛет);
	Запрос.УстановитьПараметр("Счета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет", СписокСчетов30);
	СписокСчетов30_1 = Новый СписокЗначений;
	СписокСчетов30_1.Добавить(ПланыСчетов.бит_Дополнительный_2.ЧистаяПрибыльОтчетногоГода);
	Запрос.УстановитьПараметр("КорСчета_КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет", СписокСчетов30_1);
	СписокСчетов31 = Новый СписокЗначений;
	СписокСчетов31.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеДолговыеЦБ);
	Запрос.УстановитьПараметр("Счета_КраткосрочныеДолговыеЦБ", СписокСчетов31);
	СписокСчетов32 = Новый СписокЗначений;
	СписокСчетов32.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеЗаймыВыданные);
	Если СтруктураДопСчетов.Счет234 <> Неопределено Тогда
		СписокСчетов32.Добавить(СтруктураДопСчетов.Счет234);
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_КраткосрочныеЗаймыВыданные", СписокСчетов32);
	СписокСчетов33 = Новый СписокЗначений;
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеКредитыЗаймыОсновнаяСумма);
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеКредитыЗаймыОсновнаяСуммаВал);
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеКредитыЗаймыПроценты);
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеКредитыЗаймыПроцентыВал);
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.КраткосрочныеОблигационныеЗаймыОсновнаяСумма);
	СписокСчетов33.Добавить(ПланыСчетов.бит_Дополнительный_2.ОблигационныеЗаймыПроценты);
	Запрос.УстановитьПараметр("Счета_КраткосрочныеКредитыИЗаймы", СписокСчетов33);
	СписокСчетов34 = Новый СписокЗначений;
	СписокСчетов34.Добавить(ПланыСчетов.бит_Дополнительный_2.НДСкВозмещению);
	СписокСчетов34.Добавить(ПланыСчетов.бит_Дополнительный_2.НДСсКраткосрочныхАвансовПолученных);  //ОК Довбешка  09.12.2014
	СписокСчетов34.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоНДС);
	Запрос.УстановитьПараметр("Счета_НДСкВозмещению", СписокСчетов34);
	СписокСчетов35 = Новый СписокЗначений;
	СписокСчетов35.Добавить(ПланыСчетов.бит_Дополнительный_2.НеотделимыеУлучшения);
	СписокСчетов35.Добавить(ПланыСчетов.бит_Дополнительный_2.НеотделимыеУлучшенияНакопленнаяАмортизация);
	СписокСчетов35.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеНеотделимыеУлучшения);
	Запрос.УстановитьПараметр("Счета_НеотделимыеУлучшения", СписокСчетов35);
	СписокСчетов36 = Новый СписокЗначений;
	СписокСчетов36.Добавить(ПланыСчетов.бит_Дополнительный_2.НераспределеннаяПрибыльУбытокПрошлыхЛет);
	Запрос.УстановитьПараметр("Счета_НераспределеннаяПрибыльУбытокПрошлыхЛет", СписокСчетов36);
	СписокСчетов36_1 = Новый СписокЗначений;
	СписокСчетов36_1.Добавить(ПланыСчетов.бит_Дополнительный_2.ЧистаяПрибыльОтчетногоГода);
	Запрос.УстановитьПараметр("КорСчета_НераспределеннаяПрибыльУбытокПрошлыхЛет", СписокСчетов36_1);
	СписокСчетов37 = Новый СписокЗначений;
	СписокСчетов37.Добавить(ПланыСчетов.бит_Дополнительный_2.НезавершенноеПроизводство);
	Запрос.УстановитьПараметр("Счета_НЗП", СписокСчетов37);
	СписокСчетов38 = Новый СписокЗначений;
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.КредитноеОбеспечение);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.СлужбаЗаказчика);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Проектирование);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Изыскания);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Согласования);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ПодготовительныеРаботы);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Общестроительные);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнутренниеСпециальныеРаботы);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ПодъемноТранспортноеОборудование);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Сети);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.Котельная);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.СобственноеБлагоустройство);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнешнееБлагоустройство);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ОТдельноСтоящиеРекламныеКонструкции);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ИНжиниринговыеУслуги);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходы);
	СписокСчетов38.Добавить(ПланыСчетов.бит_Дополнительный_2.КапитализируемыеРасходыПоЗемле);
	Запрос.УстановитьПараметр("Счета_НЗСздания", СписокСчетов38);
	СписокСчетов39 = Новый СписокЗначений;
	СписокСчетов39.Добавить(ПланыСчетов.бит_Дополнительный_2.НезавершенноеСтроительствоЗемля);
	Запрос.УстановитьПараметр("Счета_НЗСземля", СписокСчетов39);
	СписокСчетов40 = Новый СписокЗначений;
	СписокСчетов40.Добавить(ПланыСчетов.бит_Дополнительный_2.НезавершенноеСтроительствоОборудование);
	Запрос.УстановитьПараметр("Счета_НЗСоборудование", СписокСчетов40);
	//БИТ АКриштопов 10022016 -->>
	СписокСчетов40_1 = Новый СписокЗначений;
	СписокСчетов40_1.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("124"));
	Запрос.УстановитьПараметр("Счета_ОСВПути", СписокСчетов40_1);
	//БИТ АКриштопов 10022016 <<--
	СписокСчетов41 = Новый СписокЗначений;
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.ТоварныеЗнакиПатенты);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.ПОиЛицензии);
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.ПраваАренды);
	// -СБ Кузнецова С.
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.ЛицензииИСертификатыПоТорговойДеятельности);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеНМА);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.НМАдляПродажи);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАТовЗнаки);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАПОиЛиц);
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАПраваАренды);
	// -СБ Кузнецова С.
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАЛицензииТорг);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАПроч);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАТовЗнаки);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАПОиЛиц);
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАПраваАренды);
	// -СБ Кузнецова С.
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАЛицензииТорг);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАПроч);
	СписокСчетов41.Добавить(ПланыСчетов.бит_Дополнительный_2.НМАвПроцессеСоздания);
	Запрос.УстановитьПараметр("Счета_НМА", СписокСчетов41);
	СписокСчетов42 = Новый СписокЗначений;
	СписокСчетов42.Добавить(ПланыСчетов.бит_Дополнительный_2.ДивидендыДеньгами);
	Запрос.УстановитьПараметр("Счета_ОбъявленныеДивиденды", СписокСчетов42);
	СписокСчетов43 = Новый СписокЗначений;
	СписокСчетов43.Добавить(ПланыСчетов.бит_Дополнительный_2.ОтложенныеНалоговыеОбязательства);
	Запрос.УстановитьПараметр("Счета_ОНО", СписокСчетов43);
	СписокСчетов44 = Новый СписокЗначений;
	СписокСчетов44.Добавить(ПланыСчетов.бит_Дополнительный_2.ОСПредназначенныеДляПродажи);
	Запрос.УстановитьПараметр("Счета_ОСдляПродажи", СписокСчетов44);
	СписокСчетов45 = Новый СписокЗначений;
	СписокСчетов45.Добавить(ПланыСчетов.бит_Дополнительный_2.ОсновныеСредстваДо40);
	СписокСчетов45.Добавить(ПланыСчетов.бит_Дополнительный_2.ОсновныеСредстваДо40НакопленнаяАмортизация);
	Запрос.УстановитьПараметр("Счета_ОСдо40тсч", СписокСчетов45);
	СписокСчетов46 = Новый СписокЗначений;
	СписокСчетов46.Добавить(ПланыСчетов.бит_Дополнительный_2.ОтложенныеНалоговыеАктивы);
	Запрос.УстановитьПараметр("Счета_ОтложенныеНалоговыеАктивы", СписокСчетов46);
	СписокСчетов47 = Новый СписокЗначений;
	СписокСчетов47.Добавить(ПланыСчетов.бит_Дополнительный_2.ОхранноеОборудование);
	СписокСчетов47.Добавить(ПланыСчетов.бит_Дополнительный_2.ОхранноеОборудованиеНакопленнаяАмортизация);
	СписокСчетов47.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеОхранногоОборудования);
	Запрос.УстановитьПараметр("Счета_ОхранноеОборудование", СписокСчетов47);
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//СписокСчетов48 = Новый СписокЗначений;
	//СписокСчетов48.Добавить(ПланыСчетов.бит_Дополнительный_2.ПервоначальнаяСтоимостьЗатрат);
	//СписокСчетов48.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленнаяАмортизация);
	//Если СтруктураДопСчетов.Счет17303 <> Неопределено Тогда
	//	СписокСчетов48.Добавить(СтруктураДопСчетов.Счет17303); 
	//КонецЕсли;
	//Запрос.УстановитьПараметр("Счета_ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли", СписокСчетов48);
	// -СБ Кузнецова С.
	СписокСчетов49 = Новый СписокЗначений;
	СписокСчетов49.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыВыданныеТекущие);
	Если СтруктураДопСчетов.Счет226 <> Неопределено Тогда
		СписокСчетов49.Добавить(СтруктураДопСчетов.Счет226); 
	КонецЕсли;
	СписокСчетов49.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоСтрахованию);
	Запрос.УстановитьПараметр("Счета_ПредоплатыВыданныеТекущие", СписокСчетов49);
	СписокСчетов50 = Новый СписокЗначений;
	СписокСчетов50.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоАренде);
	Запрос.УстановитьПараметр("Счета_ПредоплатыПоАренде", СписокСчетов50);
	СписокСчетов51 = Новый СписокЗначений;
	СписокСчетов51.Добавить(ПланыСчетов.бит_Дополнительный_2.АвансыПоТоваруКраткоср);
	СписокСчетов51.Добавить(ПланыСчетов.бит_Дополнительный_2.АвансыПоРаботамУсоугамКраткоср);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов51.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПолученные);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ПредоплатыПолученные", СписокСчетов51);
	СписокСчетов52 = Новый СписокЗначений;
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоНДФЛ);
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоЕСН);
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоНалогуНаПрибыль);
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоТранспНалогу);
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоНалогуНаИмущество);
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоПрочимНалогам);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов52.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоОперационнымНалогам);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ПредоплатыПоНалогам", СписокСчетов52);
	СписокСчетов53 = Новый СписокЗначений;
	СписокСчетов53.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоОСиНМА);
	СписокСчетов53.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредоплатыПоОСиНМАВал);
	Запрос.УстановитьПараметр("Счета_ПредоплатыПоОСиНМА", СписокСчетов53);
	СписокСчетов54 = Новый СписокЗначений;
	СписокСчетов54.Добавить(ПланыСчетов.бит_Дополнительный_2.ЧистаяПрибыльОтчетногоГодаРосБУ);
	СписокСчетов54.Добавить(ПланыСчетов.бит_Дополнительный_2.МСФОКорректировкиНаПрибыльУбытокПериода);
	СписокСчетов54.Добавить(ПланыСчетов.бит_Дополнительный_2.КорректировкаНаУровнеOtherComprehensiveIncome);
	Запрос.УстановитьПараметр("Счета_ПрибыльЗаГод", СписокСчетов54);
	СписокСчетов54_1 = Новый СписокЗначений;
	СписокСчетов54_1.Добавить(ПланыСчетов.бит_Дополнительный_2.НераспределеннаяПрибыльУбытокПрошлыхЛет);
	СписокСчетов54_1.Добавить(ПланыСчетов.бит_Дополнительный_2.ПоправкаРезультатовПрошлыхЛет);
	Запрос.УстановитьПараметр("КорСчета_ПрибыльЗаГод", СписокСчетов54_1);
	СписокСчетов55 = Новый СписокЗначений;
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗПодотчетныхЛиц);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ДЗПерсоналаПоПрочимОперациям);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыСДебИКредРуб);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнвестиционноеФинансирование);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыПоЛизинговымОперациям);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыСДебИКредВал);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ОтложенныеНалоги);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочаяДебиторскаяЗадолженность);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ДепонированныеСуммы);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыПоПретензиямРуб);
	Если СтруктураДопСчетов.Счет22412 <> Неопределено Тогда
		СписокСчетов55.Добавить(СтруктураДопСчетов.Счет22412); 
	КонецЕсли;
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыПоПретензиямВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.БонусыПолученныеОтПоставщиков);
	СписокСчетов55.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочаяДЗВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ПрочаяДЗ", СписокСчетов55);
	//БИТ АКриштопов 10022016 -->>
	СписокСчетов55_1 = Новый СписокЗначений;
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	//СписокСчетов55_1.Добавить(ПланыСчетов.бит_Дополнительный_2.БонусыПолученныеОтПоставщиков);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2018-02-16 (#2987)
	СписокСчетов55_1.Добавить(ПланыСчетов.бит_Дополнительный_2.ДебиторскаяЗадолженностьПоПремиям);
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2018-02-16 (#2987)
	Запрос.УстановитьПараметр("Счета_БонусыПолученныеОтПоставщиков", СписокСчетов55_1); 
	//БИТ АКриштопов 10022016 <<--
	СписокСчетов56 = Новый СписокЗначений;
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпередПодотчетнымиЛицами);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоПрочимОперациямПередПерсоналом);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыСДебиторамиКредиторами);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнвестФинансирование);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыПоЛизингу);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыСДебиторамиКредиторамиВал);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.НДСсАвансовПолуч);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.ОтложенныеНалогиКромеНП);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.ДепСуммы);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетыПоПретензиям);
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочаяКЗ);
	Если СтруктураДопСчетов.Счет52612 <> Неопределено Тогда
		СписокСчетов56.Добавить(СтруктураДопСчетов.Счет52612);
	КонецЕсли;
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов56.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнутрихозяйственныеРасчеты);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ПрочаяКЗ", СписокСчетов56);
	СписокСчетов57 = Новый СписокЗначений;
	СписокСчетов57.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочееОборудование);
	СписокСчетов57.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочееОборудованиеНакопленнаяАмортизация);
	СписокСчетов57.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеПрочиеОС);
	Запрос.УстановитьПараметр("Счета_ПрочееОборудование", СписокСчетов57);
	СписокСчетов58 = Новый СписокЗначений;
	СписокСчетов58.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеДолгосрочныеАвансыВыданные);
	СписокСчетов58.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеДолгосрочныеАвансыВВалюте);
	Запрос.УстановитьПараметр("Счета_ПрочиеДолгосрочныеАвансыВыданные", СписокСчетов58);
	СписокСчетов59 = Новый СписокЗначений;
	СписокСчетов59.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеДолгосрочныеАктивы);
	Запрос.УстановитьПараметр("Счета_ПрочиеДолгосрочныеАктивы", СписокСчетов59);
	СписокСчетов60 = Новый СписокЗначений;
	СписокСчетов60.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеИнвестицииПрочие);
	СписокСчетов60.Добавить(ПланыСчетов.бит_Дополнительный_2.ВкладыПоДоговоруПростогоТоварищества);
	Запрос.УстановитьПараметр("Счета_ПрочиеДолгосрочныеИнвестиции", СписокСчетов60);
	СписокСчетов61 = Новый СписокЗначений;
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗпоТовару);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗИнвестиционная);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗИнвестиционнаяВал);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.КЗОперационная);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.АвансыПоТовару);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.АвансыПоРаботамУслугам);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.НДСсДолгосрочныхАвансовПолученных);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеДолгосрочныеНачисленныеОбязательства);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеАвансыПолученныеРуб);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочныеАвансыПолученныеВал);
	СписокСчетов61.Добавить(ПланыСчетов.бит_Дополнительный_2.ДолгосрочнаяОперационнаяКЗВал);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	Запрос.УстановитьПараметр("Счета_ПрочиеДолгосрочныеОбязательства", СписокСчетов61);
	СписокСчетов62 = Новый СписокЗначений;
	СписокСчетов62.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеКраткосрочныеИнвестиции);
	Запрос.УстановитьПараметр("Счета_ПрочиеКраткосрочныеИнвестиции", СписокСчетов62);
	СписокСчетов63 = Новый СписокЗначений;
	СписокСчетов63.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеОборотныеАктивы_);
	Запрос.УстановитьПараметр("Счета_ПрочиеОборотныеАктивы", СписокСчетов63);
	СписокСчетов64 = Новый СписокЗначений;
	СписокСчетов64.Добавить(ПланыСчетов.бит_Дополнительный_2.ПереоценкаДолгосрочныхАктивов);
	СписокСчетов64.Добавить(ПланыСчетов.бит_Дополнительный_2.КурсоваяРазницаПоИнвестициямВДочерниеПредприятия);
	СписокСчетов64.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРезервы);
	СписокСчетов64.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("324"));
	Запрос.УстановитьПараметр("Счета_ПрочиеРезервы", СписокСчетов64);
	СписокСчетов65 = Новый СписокЗначений;
	СписокСчетов65.Добавить(ПланыСчетов.бит_Дополнительный_2.РаспределениеАктивовDistributions);
	Запрос.УстановитьПараметр("Счета_РаспределениеАктивов", СписокСчетов65);
	СписокСчетов66 = Новый СписокЗначений;
	СписокСчетов66.Добавить(ПланыСчетов.бит_Дополнительный_2.РасчетныйСчет);
	Запрос.УстановитьПараметр("Счета_РасчетныйСчет", СписокСчетов66);
	СписокСчетов67 = Новый СписокЗначений;
	СписокСчетов67.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервПоСомнительнымДолгам);
	Запрос.УстановитьПараметр("Счета_РезервПоСомнительнымДолгам", СписокСчетов67);
	СписокСчетов68 = Новый СписокЗначений;
	СписокСчетов68.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервныйКапитал);
	Запрос.УстановитьПараметр("Счета_РезервыПоЗаконодательству", СписокСчетов68);
	СписокСчетов69 = Новый СписокЗначений;
	СписокСчетов69.Добавить(ПланыСчетов.бит_Дополнительный_2.РекламноеОборудование);
	СписокСчетов69.Добавить(ПланыСчетов.бит_Дополнительный_2.РекламноеОборудованиеНакопленнаяАмортизация);
	СписокСчетов69.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеРекламногоОборудования);
	Запрос.УстановитьПараметр("Счета_РекламноеОборудование", СписокСчетов69);
	СписокСчетов70 = Новый СписокЗначений;
	СписокСчетов70.Добавить(ПланыСчетов.бит_Дополнительный_2.СкладскоеОборудование);
	СписокСчетов70.Добавить(ПланыСчетов.бит_Дополнительный_2.СкладскоеОборудованиеНакопленнаяАмортизация);
	СписокСчетов70.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеСкладскогоОборудования);
	Запрос.УстановитьПараметр("Счета_СкладскоеОборудование", СписокСчетов70);
	СписокСчетов71 = Новый СписокЗначений;
	СписокСчетов71.Добавить(ПланыСчетов.бит_Дополнительный_2.СобственныеВыкупленныеАкции);
	Запрос.УстановитьПараметр("Счета_СобственныеВыкупленныеАкции", СписокСчетов71);
	СписокСчетов72 = Новый СписокЗначений;
	СписокСчетов72.Добавить(ПланыСчетов.бит_Дополнительный_2.Сооружения);
	СписокСчетов72.Добавить(ПланыСчетов.бит_Дополнительный_2.СооруженияНакопленнаяАмортизация);
	СписокСчетов72.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеСооружений);
	Запрос.УстановитьПараметр("Счета_Сооружения", СписокСчетов72);
	СписокСчетов73 = Новый СписокЗначений;
	СписокСчетов73.Добавить(ПланыСчетов.бит_Дополнительный_2.СпециальныеСчетаВБанках);
	Запрос.УстановитьПараметр("Счета_СпецСчетаВБанках", СписокСчетов73);
	СписокСчетов74 = Новый СписокЗначений;
	СписокСчетов74.Добавить(ПланыСчетов.бит_Дополнительный_2.СухоеОборудование);
	СписокСчетов74.Добавить(ПланыСчетов.бит_Дополнительный_2.СухоеОборудованиеНакопленнаяАмортизация);
	СписокСчетов74.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеСухогоОборудования);
	Запрос.УстановитьПараметр("Счета_СухоеОборудование", СписокСчетов74);
	СписокСчетов75 = Новый СписокЗначений;
	СписокСчетов75.Добавить(ПланыСчетов.бит_Дополнительный_2.СырьеМатериалы);
	Запрос.УстановитьПараметр("Счета_СырьеИМатериалы", СписокСчетов75);
	СписокСчетов76 = Новый СписокЗначений;
	СписокСчетов76.Добавить(ПланыСчетов.бит_Дополнительный_2.ТекущаяДоляДолгосрочныхОбязательств);
	СписокСчетов76.Добавить(ПланыСчетов.бит_Дополнительный_2.ТекущаяДоляДолгосрочныхОбязательствВал);
	Запрос.УстановитьПараметр("Счета_ТекущаяДоляДолгосрочныхОбязательств", СписокСчетов76);
	СписокСчетов77 = Новый СписокЗначений;
	СписокСчетов77.Добавить(ПланыСчетов.бит_Дополнительный_2.ТехнологическоеОборудование);
	СписокСчетов77.Добавить(ПланыСчетов.бит_Дополнительный_2.ТехнологическоеОборудованиеНакопленнаяАмортизация);
	СписокСчетов77.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеТехнологическогоОборудования);
	Запрос.УстановитьПараметр("Счета_ТехнологическоеОборудование", СписокСчетов77);
	СписокСчетов78 = Новый СписокЗначений;
	СписокСчетов78.Добавить(ПланыСчетов.бит_Дополнительный_2.ТоварыВПути);
	СписокСчетов78.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("216"));
	Запрос.УстановитьПараметр("Счета_ТоварыВПути", СписокСчетов78);
	СписокСчетов79 = Новый СписокЗначений;
	СписокСчетов79.Добавить(ПланыСчетов.бит_Дополнительный_2.ТрансляционнаяРазница_);
	Запрос.УстановитьПараметр("Счета_ТрансляционнаяРазница", СписокСчетов79);
	СписокСчетов80 = Новый СписокЗначений;
	СписокСчетов80.Добавить(ПланыСчетов.бит_Дополнительный_2.Транспорт);
	СписокСчетов80.Добавить(ПланыСчетов.бит_Дополнительный_2.ТранспортНакопленнаяАмортизация);
	СписокСчетов80.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеТранспорт);
	Запрос.УстановитьПараметр("Счета_Транспорт", СписокСчетов80);
	СписокСчетов81 = Новый СписокЗначений;
	СписокСчетов81.Добавить(ПланыСчетов.бит_Дополнительный_2.ХолодильноеОборудование);
	СписокСчетов81.Добавить(ПланыСчетов.бит_Дополнительный_2.ХолодильноеОборудованиеНакопленнаяАмортизация);
	СписокСчетов81.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеХолодильногоОборудования);
	Запрос.УстановитьПараметр("Счета_ХолодильноеОборудование", СписокСчетов81);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	//СписокСчетов82 = Новый СписокЗначений;
	//СписокСчетов82.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнутрихозяйственныеРасчеты);
	//Запрос.УстановитьПараметр("Счета_ЦелевоеФинансирование", СписокСчетов82);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	СписокСчетов83 = Новый СписокЗначений;
	СписокСчетов83.Добавить(ПланыСчетов.бит_Дополнительный_2.ЭмиссионныйДоход);
	Запрос.УстановитьПараметр("Счета_ЭмиссионныйДоход", СписокСчетов83);
    
	СписокСчетов84 = Новый СписокЗначений;
	СписокСчетов84.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтРеализацииТоваров);
	Запрос.УстановитьПараметр("Счета_ВыручкаОтРеализацииТоваров", СписокСчетов84);
	СписокСчетов85 = Новый СписокЗначений;
	СписокСчетов85.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ВыручкаОтРеализацииТоваров", СписокСчетов85);
	
	СписокСчетов86 = Новый СписокЗначений;
	СписокСчетов86.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтРеализацииПродукцииОбщественногоПитания);
	Запрос.УстановитьПараметр("Счета_ВыручкаОтРеализацииПродукцииОбщепита", СписокСчетов86);
	СписокСчетов87 = Новый СписокЗначений;
	СписокСчетов87.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ВыручкаОтРеализацииПродукцииОбщепита", СписокСчетов87);
	
	СписокСчетов88 = Новый СписокЗначений;
	СписокСчетов88.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыЗемли);
	Запрос.УстановитьПараметр("Счета_ДоходыОтАрендыЗемли", СписокСчетов88);
	СписокСчетов89 = Новый СписокЗначений;
	СписокСчетов89.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтАрендыЗемли", СписокСчетов89);
	
	СписокСчетов90 = Новый СписокЗначений;
	СписокСчетов90.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыОборудования);
	Запрос.УстановитьПараметр("Счета_ДоходыОтАрендыОборудования", СписокСчетов90);
	СписокСчетов91 = Новый СписокЗначений;
	СписокСчетов91.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтАрендыОборудования", СписокСчетов91);
	
	СписокСчетов92 = Новый СписокЗначений;
	СписокСчетов92.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПомещений);
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2018-02-16 (#2987)
	СписокСчетов92.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПомещенийПеременная);
	СписокСчетов92.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПомещенийДоплатаПоТО);
	СписокСчетов92.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПомещенийБАППоТО);
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2018-02-16 (#2987)
	Запрос.УстановитьПараметр("Счета_ДоходыОтАрендыПомещений", СписокСчетов92);
	
	СписокСчетов93 = Новый СписокЗначений;
	СписокСчетов93.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтАрендыПомещений", СписокСчетов93);
	
	СписокСчетов94 = Новый СписокЗначений;
	СписокСчетов94.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПлощадей);
	Запрос.УстановитьПараметр("Счета_ДоходыОтАрендыПлощадейПодБанкоматы", СписокСчетов94);
	СписокСчетов95 = Новый СписокЗначений;
	СписокСчетов95.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтАрендыПлощадейПодБанкоматы", СписокСчетов95);
	
	СписокСчетов96 = Новый СписокЗначений;
	СписокСчетов96.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыПрочие);
	Запрос.УстановитьПараметр("Счета_ПрочиеДоходыОтАренды", СписокСчетов96);
	СписокСчетов97 = Новый СписокЗначений;
	СписокСчетов97.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеДоходыОтАренды", СписокСчетов97);
	
	СписокСчетов98 = Новый СписокЗначений;
	СписокСчетов98.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтАрендыРекламныхПлощадей);
	Запрос.УстановитьПараметр("Счета_ДоходыОтАрендыРекламныхПлощадей", СписокСчетов98);
	СписокСчетов99 = Новый СписокЗначений;
	СписокСчетов99.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтАрендыРекламныхПлощадей", СписокСчетов99);
	
	СписокСчетов100 = Новый СписокЗначений;
	СписокСчетов100.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходыОтПрочихРекламныхУслуг);
	Запрос.УстановитьПараметр("Счета_ДоходыОтПрочихРекламныхУслуг", СписокСчетов100);
	СписокСчетов101 = Новый СписокЗначений;
	СписокСчетов101.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходыОтПрочихРекламныхУслуг", СписокСчетов101);
	
	СписокСчетов102 = Новый СписокЗначений;
	СписокСчетов102.Добавить(ПланыСчетов.бит_Дополнительный_2.СебестоимостьРеализацииТоваров);
	Запрос.УстановитьПараметр("Счета_СебестоимостьРеализацииТоваров", СписокСчетов102);
	СписокСчетов103 = Новый СписокЗначений;
	СписокСчетов103.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СебестоимостьРеализацииТоваров", СписокСчетов103);
	
	СписокСчетов104 = Новый СписокЗначений;
	СписокСчетов104.Добавить(ПланыСчетов.бит_Дополнительный_2.СебестоимостьРеализацииПродукцииОбщественногоПитания);
	Запрос.УстановитьПараметр("Счета_СебестоимостьРеализацииПродукцииОбщепита", СписокСчетов104);
	СписокСчетов105 = Новый СписокЗначений;
	СписокСчетов105.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СебестоимостьРеализацииПродукцииОбщепита", СписокСчетов105);
	
	СписокСчетов106 = Новый СписокЗначений;
	СписокСчетов106.Добавить(ПланыСчетов.бит_Дополнительный_2.ПремииПоставщиковРетро);
	Запрос.УстановитьПараметр("Счета_ПремииПоставщиковРетро", СписокСчетов106);
	СписокСчетов107 = Новый СписокЗначений;
	СписокСчетов107.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПремииПоставщиковРетро", СписокСчетов107);
	
	СписокСчетов108 = Новый СписокЗначений;
	СписокСчетов108.Добавить(ПланыСчетов.бит_Дополнительный_2.ПремииПоставщиковПромо);
	Запрос.УстановитьПараметр("Счета_ПремииПоставщиковПромо", СписокСчетов108);
	СписокСчетов109 = Новый СписокЗначений;
	СписокСчетов109.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПремииПоставщиковПромо", СписокСчетов109);
	
	СписокСчетов110 = Новый СписокЗначений;
	СписокСчетов110.Добавить(ПланыСчетов.бит_Дополнительный_2.ПремииПоставщиковАдминистративные);
	Запрос.УстановитьПараметр("Счета_ПремииПоставщиковАдм", СписокСчетов110);
	СписокСчетов111 = Новый СписокЗначений;
	СписокСчетов111.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПремииПоставщиковАдм", СписокСчетов111);
	
	//СофтЛаб Начало 2018-09-09 3074
	СписокСчетов_ПремииПоставщиковРекламныеУслуги = Новый СписокЗначений;
	СписокСчетов_ПремииПоставщиковРекламныеУслуги.Добавить(ПланыСчетов.бит_Дополнительный_2.ПремииПоставщиковРекламныеУслуги);
	Запрос.УстановитьПараметр("Счета_ПремииПоставщиковРекламныеУслуги", СписокСчетов_ПремииПоставщиковРекламныеУслуги);
	СписокКорСчетов_ПремииПоставщиковРекламныеУслуги = Новый СписокЗначений;
	СписокКорСчетов_ПремииПоставщиковРекламныеУслуги.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПремииПоставщиковРекламныеУслуги", СписокКорСчетов_ПремииПоставщиковРекламныеУслуги);
   //СофтЛаб Конец 2018-09-09 3074
	
	СписокСчетов112 = Новый СписокЗначений;
	//ОК+ Аверьянова 29.01.15 испр ошибки формирования
	//СписокСчетов112.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтЛогистическихУслугНеИсп);  ВыручкаОтЛогистическихУслуг
	//СписокСчетов112.Добавить(ПланыСчетов.бит_Дополнительный_2.ЛогистическиеБонусы); ЛогистическийДоходОтПоставщиковНеИсп
	СписокСчетов112.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("71506"));   
	СписокСчетов112.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("71507"));
	//ОК- Аверьянова 29.01.15 испр ошибки формирования
	Запрос.УстановитьПараметр("Счета_ДоходОтЛогистики", СписокСчетов112);
	СписокСчетов113 = Новый СписокЗначений;
	СписокСчетов113.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходОтЛогистики", СписокСчетов113);
	
	СписокСчетов114 = Новый СписокЗначений;
	СписокСчетов114.Добавить(ПланыСчетов.бит_Дополнительный_2.ШтрафыПоставщиков);
	Запрос.УстановитьПараметр("Счета_ШтрафыПоставщиков", СписокСчетов114);
	СписокСчетов115 = Новый СписокЗначений;
	СписокСчетов115.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ШтрафыПоставщиков", СписокСчетов115);
	
	СписокСчетов116 = Новый СписокЗначений;
	СписокСчетов116.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаОбработкуТоваровВнешние);
	Запрос.УстановитьПараметр("Счета_ЗатратыНаОбработкуТоваровВнеш", СписокСчетов116);
	СписокСчетов117 = Новый СписокЗначений;
	СписокСчетов117.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаОбработкуТоваровВнеш", СписокСчетов117);
	
	СписокСчетов118 = Новый СписокЗначений;
	СписокСчетов118.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаОбработкуТоваровВнутренние);
	Запрос.УстановитьПараметр("Счета_ЗатратыНаОбработкуТоваровВнутр", СписокСчетов118);
	СписокСчетов119 = Новый СписокЗначений;
	СписокСчетов119.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаОбработкуТоваровВнутр", СписокСчетов119);
	
	СписокСчетов120 = Новый СписокЗначений;
	СписокСчетов120.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаДоставку);
	СписокСчетов120.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаДоставкуВнутренние);   //ОК Довбешка 24.02.2015
	Запрос.УстановитьПараметр("Счета_ЗатратыНаДоставку", СписокСчетов120);
	СписокСчетов121 = Новый СписокЗначений;
	СписокСчетов121.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаДоставку", СписокСчетов121);
	
	СписокСчетов122 = Новый СписокЗначений;
	СписокСчетов122.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеЗатратыЛогистикаНеИсп);
	Если СтруктураДопСчетов.Счет717 <> Неопределено Тогда
		СписокСчетов122.Добавить(СтруктураДопСчетов.Счет717); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_ПрочиеЗатратыНаЛогистику", СписокСчетов122);
	СписокСчетов123 = Новый СписокЗначений;
	СписокСчетов123.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеЗатратыНаЛогистику", СписокСчетов123);
	
	СписокСчетов124 = Новый СписокЗначений;
	Если СтруктураДопСчетов.Счет71510 <> Неопределено Тогда
		СписокСчетов124.Добавить(СтруктураДопСчетов.Счет71510); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_ЗатратыНаТаможенныеУслуги", СписокСчетов124);
	СписокСчетов125 = Новый СписокЗначений;
	СписокСчетов125.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаТаможенныеУслуги", СписокСчетов125);
	
	СписокСчетов126 = Новый СписокЗначений;
	Если СтруктураДопСчетов.Счет71511 <> Неопределено Тогда
		СписокСчетов126.Добавить(СтруктураДопСчетов.Счет71511); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_ЗатратыНаТаможенныеПлатежи", СписокСчетов126);
	СписокСчетов127 = Новый СписокЗначений;
	СписокСчетов127.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаТаможенныеПлатежи", СписокСчетов127);
	
	СписокСчетов128 = Новый СписокЗначений;
	СписокСчетов128.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаАрендуСклада);
	Запрос.УстановитьПараметр("Счета_ЗатратыНаХранениеТоваров", СписокСчетов128);
	СписокСчетов129 = Новый СписокЗначений;
	СписокСчетов129.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаХранениеТоваров", СписокСчетов129);
	
	СписокСчетов130 = Новый СписокЗначений;
	Если СтруктураДопСчетов.Счет71509 <> Неопределено Тогда
		СписокСчетов130.Добавить(СтруктураДопСчетов.Счет71509);
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_КомпенсацияЛогистическихЗатрат", СписокСчетов130);
	СписокСчетов131 = Новый СписокЗначений;
	СписокСчетов131.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КомпенсацияЛогистическихЗатрат", СписокСчетов131);
	
	СписокСчетов132 = Новый СписокЗначений;
	СписокСчетов132.Добавить(ПланыСчетов.бит_Дополнительный_2.СтоимостьЛогистикиДляМагазинов);
	Запрос.УстановитьПараметр("Счета_СтоимостьЛогистикиДляМагазинов", СписокСчетов132);
	СписокСчетов133 = Новый СписокЗначений;
	СписокСчетов133.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтоимостьЛогистикиДляМагазинов", СписокСчетов133);
	
	СписокСчетов134 = Новый СписокЗначений;
	СписокСчетов134.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗащитныеМатериалы);
	Запрос.УстановитьПараметр("Счета_ЗащитныеМатериалы", СписокСчетов134);
	СписокСчетов135 = Новый СписокЗначений;
	СписокСчетов135.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗащитныеМатериалы", СписокСчетов135);
	
	СписокСчетов136 = Новый СписокЗначений;
	СписокСчетов136.Добавить(ПланыСчетов.бит_Дополнительный_2.Упаковка);
	Запрос.УстановитьПараметр("Счета_Упаковка", СписокСчетов136);
	СписокСчетов137 = Новый СписокЗначений;
	СписокСчетов137.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Упаковка", СписокСчетов137);
	
	СписокСчетов138 = Новый СписокЗначений;
	СписокСчетов138.Добавить(ПланыСчетов.бит_Дополнительный_2.ЭлементыЦенников);
	Запрос.УстановитьПараметр("Счета_ЭлементыЦенников", СписокСчетов138);
	СписокСчетов139 = Новый СписокЗначений;
	СписокСчетов139.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЭлементыЦенников", СписокСчетов139);
	
	СписокСчетов140 = Новый СписокЗначений;
	СписокСчетов140.Добавить(ПланыСчетов.бит_Дополнительный_2.ПотериТовараИнвентаризация);
	Запрос.УстановитьПараметр("Счета_ПотериТовараИнв", СписокСчетов140);
	СписокСчетов141 = Новый СписокЗначений;
	СписокСчетов141.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПотериТовараИнв", СписокСчетов141);
	
	СписокСчетов142 = Новый СписокЗначений;
	СписокСчетов142.Добавить(ПланыСчетов.бит_Дополнительный_2.ПотериТовараСписания);
	Запрос.УстановитьПараметр("Счета_ПотериТовараСпис", СписокСчетов142);
	СписокСчетов143 = Новый СписокЗначений;
	СписокСчетов143.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПотериТовараСпис", СписокСчетов143);
	
	СписокСчетов144 = Новый СписокЗначений;
	СписокСчетов144.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервПодСнижениеСтоимостиЗапасовТоварных);
	Запрос.УстановитьПараметр("Счета_РезервПодСнижениеСтоимостиЗапасов", СписокСчетов144);
	СписокСчетов145 = Новый СписокЗначений;
	СписокСчетов145.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РезервПодСнижениеСтоимостиЗапасов", СписокСчетов145);
	
	СписокСчетов144_1 = Новый СписокЗначений;
	СписокСчетов144_1.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("718"));
	Запрос.УстановитьПараметр("Счета_КорректировкаСебестоимостиПоОбратнойРеализации", СписокСчетов144_1);
	СписокСчетов145_1 = Новый СписокЗначений;
	СписокСчетов145_1.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КорректировкаСебестоимостиПоОбратнойРеализации", СписокСчетов145_1);
	
	СписокСчетов146 = Новый СписокЗначений;
	СписокСчетов146.Добавить(ПланыСчетов.бит_Дополнительный_2.ФОТ);
	СписокСчетов146.Добавить(ПланыСчетов.бит_Дополнительный_2.НДФЛ);
	СписокСчетов146.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервыНаОтпуска);
	Запрос.УстановитьПараметр("Счета_ФОТ", СписокСчетов146);
	СписокСчетов147 = Новый СписокЗначений;
	СписокСчетов147.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ФОТ", СписокСчетов147);
	
	СписокСчетов148 = Новый СписокЗначений;
	СписокСчетов148.Добавить(ПланыСчетов.бит_Дополнительный_2.СтраховыеВзносыСФОТ);
	СписокСчетов148.Добавить(ПланыСчетов.бит_Дополнительный_2.СтраховыеВзносыСРезервовНаОтпуска);
	Запрос.УстановитьПараметр("Счета_СтраховыеВзносы", СписокСчетов148);
	СписокСчетов149 = Новый СписокЗначений;
	СписокСчетов149.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтраховыеВзносы", СписокСчетов149);
	
	СписокСчетов150 = Новый СписокЗначений;
	СписокСчетов150.Добавить(ПланыСчетов.бит_Дополнительный_2.Пособия);
	Запрос.УстановитьПараметр("Счета_Пособия", СписокСчетов150);
	СписокСчетов151 = Новый СписокЗначений;
	СписокСчетов151.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Пособия", СписокСчетов151);
	
	СписокСчетов152 = Новый СписокЗначений;
	СписокСчетов152.Добавить(ПланыСчетов.бит_Дополнительный_2.ПремированиеСотрудников);
	Запрос.УстановитьПараметр("Счета_ПремированиеСотрудников", СписокСчетов152);
	СписокСчетов153 = Новый СписокЗначений;
	СписокСчетов153.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПремированиеСотрудников", СписокСчетов153);
	
	СписокСчетов154 = Новый СписокЗначений;
	СписокСчетов154.Добавить(ПланыСчетов.бит_Дополнительный_2.СтрахованиеСотрудников);
	Запрос.УстановитьПараметр("Счета_СтрахованиеСотрудников", СписокСчетов154);
	СписокСчетов155 = Новый СписокЗначений;
	СписокСчетов155.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтрахованиеСотрудников", СписокСчетов155);
	
	СписокСчетов156 = Новый СписокЗначений;
	СписокСчетов156.Добавить(ПланыСчетов.бит_Дополнительный_2.ПитаниеСотрудников);
	Запрос.УстановитьПараметр("Счета_ПитаниеСотрудников", СписокСчетов156);
	СписокСчетов157 = Новый СписокЗначений;
	СписокСчетов157.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПитаниеСотрудников", СписокСчетов157);
	
	СписокСчетов158 = Новый СписокЗначений;
	СписокСчетов158.Добавить(ПланыСчетов.бит_Дополнительный_2.МедосмотрСотрудников);
	Запрос.УстановитьПараметр("Счета_МедосмотрСотрудников", СписокСчетов158);
	СписокСчетов159 = Новый СписокЗначений;
	СписокСчетов159.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_МедосмотрСотрудников", СписокСчетов159);
	
	СписокСчетов160 = Новый СписокЗначений;
	СписокСчетов160.Добавить(ПланыСчетов.бит_Дополнительный_2.ОрганизацияКорпоративныхМероприятий);
	Запрос.УстановитьПараметр("Счета_ОрганизацияКорпМероприятий", СписокСчетов160);
	СписокСчетов161 = Новый СписокЗначений;
	СписокСчетов161.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОрганизацияКорпМероприятий", СписокСчетов161);
	
	СписокСчетов162 = Новый СписокЗначений;
	СписокСчетов162.Добавить(ПланыСчетов.бит_Дополнительный_2.Аутсорсинг);
	Запрос.УстановитьПараметр("Счета_Аутсорсинг", СписокСчетов162);
	СписокСчетов163 = Новый СписокЗначений;
	СписокСчетов163.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Аутсорсинг", СписокСчетов163);
	
	СписокСчетов164 = Новый СписокЗначений;
	СписокСчетов164.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходыНаСотрудников);
	Запрос.УстановитьПараметр("Счета_ПрочиеРасходыНаСотрудников", СписокСчетов164);
	СписокСчетов165 = Новый СписокЗначений;
	СписокСчетов165.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеРасходыНаСотрудников", СписокСчетов165);
	
	СписокСчетов166 = Новый СписокЗначений;
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеПроживание);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеСуточные_);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеТранспортТакси);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеПрочие); 
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеПроживаниеНеИсп); 
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеТранспорт);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеСуточные);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеТакси);
	СписокСчетов166.Добавить(ПланыСчетов.бит_Дополнительный_2.КомандировочныеРасходы);
	Если СтруктураДопСчетов.Счет73309 <> Неопределено Тогда
		СписокСчетов166.Добавить(СтруктураДопСчетов.Счет73309); 
	КонецЕсли;
	Если СтруктураДопСчетов.Счет73310 <> Неопределено Тогда
		СписокСчетов166.Добавить(СтруктураДопСчетов.Счет73310); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_КомандировочныеРасходы", СписокСчетов166);
	СписокСчетов167 = Новый СписокЗначений;
	СписокСчетов167.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КомандировочныеРасходы", СписокСчетов167);
	
	СписокСчетов168 = Новый СписокЗначений;
	СписокСчетов168.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбучениеПерсонала);
	СписокСчетов168.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбучениеПерсоналаНеИсп);
	Запрос.УстановитьПараметр("Счета_ОбучениеПерсонала", СписокСчетов168);
	СписокСчетов169 = Новый СписокЗначений;
	СписокСчетов169.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОбучениеПерсонала", СписокСчетов169);
	
	СписокСчетов170 = Новый СписокЗначений;
	СписокСчетов170.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбучениеПерсоналаСпециальное);
	СписокСчетов170.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбучениеПерсоналаОхранаТрудаНеИсп);
	Запрос.УстановитьПараметр("Счета_СпецОбучениеПерсонала", СписокСчетов170);
	СписокСчетов171 = Новый СписокЗначений;
	СписокСчетов171.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СпецОбучениеПерсонала", СписокСчетов171);
	
	СписокСчетов172 = Новый СписокЗначений;
	СписокСчетов172.Добавить(ПланыСчетов.бит_Дополнительный_2.ПоискПерсонала);
	СписокСчетов172.Добавить(ПланыСчетов.бит_Дополнительный_2.ПоискПерсоналаНеИсп);
	Запрос.УстановитьПараметр("Счета_ПоискПерсонала", СписокСчетов172);
	СписокСчетов173 = Новый СписокЗначений;
	СписокСчетов173.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПоискПерсонала", СписокСчетов173);
	
	СписокСчетов174 = Новый СписокЗначений;
	СписокСчетов174.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаКвартир);
	Если СтруктураДопСчетов.Счет72410 <> Неопределено Тогда
		СписокСчетов174.Добавить(СтруктураДопСчетов.Счет72410); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_АрендаКвартир", СписокСчетов174);
	СписокСчетов175 = Новый СписокЗначений;
	СписокСчетов175.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаКвартир", СписокСчетов175);
	
	//СофтЛаб Начало 2019-06-20 #3383
	СписокСчетов174_ = Новый СписокЗначений;
	СписокСчетов174_.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаКвартирСотрудникам);
	Запрос.УстановитьПараметр("Счета_АрендаКвартирСотрудникам", СписокСчетов174_);
	СписокСчетов175_ = Новый СписокЗначений;
	СписокСчетов175_.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаКвартирСотрудникам", СписокСчетов175_);
	//СофтЛаб Конец 2019-06-20 #3383
	
	СписокСчетов176 = Новый СписокЗначений;
	СписокСчетов176.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыплатаНаОсновеАкций);
	Запрос.УстановитьПараметр("Счета_ВыплатаНаОсновеАкций", СписокСчетов176);
	СписокСчетов177 = Новый СписокЗначений;
	СписокСчетов177.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВыплатаНаОсновеАкций", СписокСчетов177);
	
	СписокСчетов178 = Новый СписокЗначений;
	СписокСчетов178.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияОС_расх);
	Запрос.УстановитьПараметр("Счета_АмортизацияОС", СписокСчетов178);
	СписокСчетов179 = Новый СписокЗначений;
	СписокСчетов179.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АмортизацияОС", СписокСчетов179);
	
	СписокСчетов180 = Новый СписокЗначений;
	СписокСчетов180.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияОСдо40тыс);
	Запрос.УстановитьПараметр("Счета_АмортизацияОСдо40тсч", СписокСчетов180);
	СписокСчетов181 = Новый СписокЗначений;
	СписокСчетов181.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АмортизацияОСдо40тсч", СписокСчетов181);
	
	СписокСчетов182 = Новый СписокЗначений;
	СписокСчетов182.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМА_расх);
	Запрос.УстановитьПараметр("Счета_АмортизацияНМА", СписокСчетов182);
	СписокСчетов183 = Новый СписокЗначений;
	СписокСчетов183.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АмортизацияНМА", СписокСчетов183);
	
	СписокСчетов184 = Новый СписокЗначений;
	СписокСчетов184.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияICLL);
	Запрос.УстановитьПараметр("Счета_АмортизацияICLL", СписокСчетов184);
	СписокСчетов185 = Новый СписокЗначений;
	СписокСчетов185.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АмортизацияICLL", СписокСчетов185);
	
	СписокСчетов186 = Новый СписокЗначений;
	СписокСчетов186.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнутреннееОформлениеГипермаркетов);
	Запрос.УстановитьПараметр("Счета_ВнутрОформление", СписокСчетов186);
	СписокСчетов187 = Новый СписокЗначений;
	СписокСчетов187.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВнутрОформление", СписокСчетов187);
	
	СписокСчетов188 = Новый СписокЗначений;
	СписокСчетов188.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаОрганизациюПромоакций);
	Запрос.УстановитьПараметр("Счета_ЗатратыНаПромоакции", СписокСчетов188);
	СписокСчетов189 = Новый СписокЗначений;
	СписокСчетов189.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаПромоакции", СписокСчетов189);
	
	СписокСчетов190 = Новый СписокЗначений;
	СписокСчетов190.Добавить(ПланыСчетов.бит_Дополнительный_2.КаталогЛистовкиВыпуск);
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2020-01-17 (#3567)
	//СписокСчетов190.Добавить(ПланыСчетов.бит_Дополнительный_2.КаталогЛистовкиМакетРаспространение);
	//Заменено на:
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//СписокСчетов190.Добавить(ПланыСчетов.бит_Дополнительный_2.КаталогЛистовкиАудитРаспространение);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2020-01-17 (#3567)	
	СписокСчетов190.Добавить(ПланыСчетов.бит_Дополнительный_2.КаталогЛистовкиТранспортировка);
	Запрос.УстановитьПараметр("Счета_Листовки", СписокСчетов190);
	СписокСчетов191 = Новый СписокЗначений;
	СписокСчетов191.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Листовки", СписокСчетов191);
	
	СписокСчетов192 = Новый СписокЗначений;
	СписокСчетов192.Добавить(ПланыСчетов.бит_Дополнительный_2.НаружнаяРекламаНеИсп);
	СписокСчетов192.Добавить(ПланыСчетов.бит_Дополнительный_2.ВнешняяРекламаATL);
	Запрос.УстановитьПараметр("Счета_ВнешРеклама", СписокСчетов192);
	СписокСчетов193 = Новый СписокЗначений;
	СписокСчетов193.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВнешРеклама", СписокСчетов193);
	
	СписокСчетов194 = Новый СписокЗначений;
	СписокСчетов194.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОРекламногоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОреклОборудования", СписокСчетов194);
	СписокСчетов195 = Новый СписокЗначений;
	СписокСчетов195.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОреклОборудования", СписокСчетов195);
	
	СписокСчетов196 = Новый СписокЗначений;
	СписокСчетов196.Добавить(ПланыСчетов.бит_Дополнительный_2.PRактивность);
	Запрос.УстановитьПараметр("Счета_PRактивность", СписокСчетов196);
	СписокСчетов197 = Новый СписокЗначений;
	СписокСчетов197.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_PRактивность", СписокСчетов197);
	
	СписокСчетов198 = Новый СписокЗначений;
	СписокСчетов198.Добавить(ПланыСчетов.бит_Дополнительный_2.МаркетинговыеИсследования);
	Запрос.УстановитьПараметр("Счета_МаркетинговыеИсследования", СписокСчетов198);
	СписокСчетов199 = Новый СписокЗначений;
	СписокСчетов199.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_МаркетинговыеИсследования", СписокСчетов199);
	
	СписокСчетов200 = Новый СписокЗначений;
	СписокСчетов200.Добавить(ПланыСчетов.бит_Дополнительный_2.ПоддержкаБренда);
	Запрос.УстановитьПараметр("Счета_ПоддержкаБренда", СписокСчетов200);
	СписокСчетов201 = Новый СписокЗначений;
	СписокСчетов201.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПоддержкаБренда", СписокСчетов201);
	
	СписокСчетов202 = Новый СписокЗначений;
	СписокСчетов202.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрограммаЛояльности);
	Запрос.УстановитьПараметр("Счета_ПрограммаЛояльности", СписокСчетов202);
	СписокСчетов203 = Новый СписокЗначений;
	СписокСчетов203.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрограммаЛояльности", СписокСчетов203);
	
	СписокСчетов204 = Новый СписокЗначений;
	СписокСчетов204.Добавить(ПланыСчетов.бит_Дополнительный_2.НавигацияВТРКНеИсп);
	СписокСчетов204.Добавить(ПланыСчетов.бит_Дополнительный_2.РекламаНавигацияТРК);
	Запрос.УстановитьПараметр("Счета_РекламаИНавигация", СписокСчетов204);
	СписокСчетов205 = Новый СписокЗначений;
	СписокСчетов205.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РекламаИНавигация", СписокСчетов205);
	
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	СписокСчетовМониторинг = Новый СписокЗначений;
	СписокСчетовМониторинг.Добавить(ПланыСчетов.бит_Дополнительный_2.Мониторинг);
	Запрос.УстановитьПараметр("Счета_Мониторинг", СписокСчетовМониторинг);
	СписокСчетовКоррМониторинг = Новый СписокЗначений;
	СписокСчетовКоррМониторинг.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Мониторинг", СписокСчетовКоррМониторинг);
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	
	СписокСчетов206 = Новый СписокЗначений;
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2020-01-17 (#3527)
	//СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.SMSрассылкаНеИсп);
	//Заменено на:
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.SMSрассылка);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2020-01-17 (#3527)	
	
	Если СтруктураДопСчетов.Счет72316 <> Неопределено Тогда
		СписокСчетов206.Добавить(СтруктураДопСчетов.Счет72316); 
	КонецЕсли;
	СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходыМаркетинга);
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2020-01-17 (#3527)
	//СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.РекламаВСМИНеИсп);
	//Заменено на:
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнтернетРекламаСМИ);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2020-01-17 (#3527)		
	СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.РазработкаДизайнаНеИсп);
	СписокСчетов206.Добавить(ПланыСчетов.бит_Дополнительный_2.МузыкальноеСопровождениеНеИсп);
	Запрос.УстановитьПараметр("Счета_ПрочиеРасходыМаркетинга", СписокСчетов206);
	СписокСчетов207 = Новый СписокЗначений;
	СписокСчетов207.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеРасходыМаркетинга", СписокСчетов207);
	
	СписокСчетов208 = Новый СписокЗначений;
	СписокСчетов208.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаЗемли);
	Запрос.УстановитьПараметр("Счета_АрендаЗемли", СписокСчетов208);
	СписокСчетов209 = Новый СписокЗначений;
	СписокСчетов209.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаЗемли", СписокСчетов209);
	
	СписокСчетов210 = Новый СписокЗначений;
	СписокСчетов210.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаТорговыхПомещений);
	Запрос.УстановитьПараметр("Счета_АрендаТоргПомещений", СписокСчетов210);
	СписокСчетов211 = Новый СписокЗначений;
	СписокСчетов211.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаТоргПомещений", СписокСчетов211);
	
	СписокСчетов212 = Новый СписокЗначений;
	СписокСчетов212.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаПомещений);
	Запрос.УстановитьПараметр("Счета_АрендаОфиса", СписокСчетов212);
	СписокСчетов213 = Новый СписокЗначений;
	СписокСчетов213.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаОфиса", СписокСчетов213);
	
	СписокСчетов214 = Новый СписокЗначений;
	//ОК+ Аверьянова 29.01.15 испр ошибки формирования
	//СписокСчетов214.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаСклада); //АрендаСкладаНеИсп
	СписокСчетов214.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72407"));
	//ОК- Аверьянова 29.01.15 испр ошибки формирования
	Запрос.УстановитьПараметр("Счета_ЗатратыНаАрендуСклада", СписокСчетов214);
	СписокСчетов215 = Новый СписокЗначений;
	СписокСчетов215.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаАрендуСклада", СписокСчетов215);
	
	СписокСчетов216 = Новый СписокЗначений;
	СписокСчетов216.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаПрочая);
	СписокСчетов216.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаРекламныхПлощадейНеИсп);
	СписокСчетов216.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаТорговыхПомещенийДополнительная);
	//Если СтруктураДопСчетов.Счет72410 <> Неопределено Тогда
	//	СписокСчетов216.Добавить(СтруктураДопСчетов.Счет72410); 
	//КонецЕсли;
	Запрос.УстановитьПараметр("Счета_ПрочаяАренда", СписокСчетов216);
	СписокСчетов217 = Новый СписокЗначений;
	СписокСчетов217.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочаяАренда", СписокСчетов217);
	
	СписокСчетов218 = Новый СписокЗначений;
	СписокСчетов218.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтИОбслуживаниеЗданийИПомещенийНеИсп);
	СписокСчетов218.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбслуживаниеЗданийПомещений);
	Запрос.УстановитьПараметр("Счета_ОбслуживаниеЗданийПомещений", СписокСчетов218);
	СписокСчетов219 = Новый СписокЗначений;
	СписокСчетов219.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОбслуживаниеЗданийПомещений", СписокСчетов219);
	
	СписокСчетов220 = Новый СписокЗначений;
	СписокСчетов220.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтЗданийПомещений);
	Запрос.УстановитьПараметр("Счета_РемонтЗданийПомещений", СписокСчетов220);
	СписокСчетов221 = Новый СписокЗначений;
	СписокСчетов221.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтЗданийПомещений", СписокСчетов221);
	
	СписокСчетов222 = Новый СписокЗначений;
	СписокСчетов222.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтИОбслуживаниеТерритории);
	Запрос.УстановитьПараметр("Счета_РемонтИОбслуживаниеТерритории", СписокСчетов222);
	СписокСчетов223 = Новый СписокЗначений;
	СписокСчетов223.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтИОбслуживаниеТерритории", СписокСчетов223);
	
	СписокСчетов224 = Новый СписокЗначений;
	СписокСчетов224.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей);
	Запрос.УстановитьПараметр("Счета_РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей", СписокСчетов224);
	СписокСчетов225 = Новый СписокЗначений;
	СписокСчетов225.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей", СписокСчетов225);
	
	СписокСчетов226 = Новый СписокЗначений;
	СписокСчетов226.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОАвтотранспорта);
	Запрос.УстановитьПараметр("Счета_ТОавтотранспорта", СписокСчетов226);
	СписокСчетов227 = Новый СписокЗначений;
	СписокСчетов227.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОавтотранспорта", СписокСчетов227);
	
	СписокСчетов228 = Новый СписокЗначений;
	СписокСчетов228.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОИнженерногоОборудованияРегулярное);
	СписокСчетов228.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОИнженерногоОборудованияНеРегулярное);
	Запрос.УстановитьПараметр("Счета_ТОинженерногоОборудования", СписокСчетов228);
	СписокСчетов229 = Новый СписокЗначений;
	СписокСчетов229.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОинженерногоОборудования", СписокСчетов229);
	
	СписокСчетов230 = Новый СписокЗначений;
	СписокСчетов230.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОКулинарногоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОкулинарногоОборудования", СписокСчетов230);
	СписокСчетов231 = Новый СписокЗначений;
	СписокСчетов231.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОкулинарногоОборудования", СписокСчетов231);
	
	СписокСчетов232 = Новый СписокЗначений;
	СписокСчетов232.Добавить(ПланыСчетов.бит_Дополнительный_2.ТООргтехники);
	Запрос.УстановитьПараметр("Счета_ОбслуживаниеОфисногоОборудования", СписокСчетов232);
	СписокСчетов233 = Новый СписокЗначений;
	СписокСчетов233.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОбслуживаниеОфисногоОборудования", СписокСчетов233);
	
	СписокСчетов234 = Новый СписокЗначений;
	СписокСчетов234.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОохранногоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОохранногоОборудования", СписокСчетов234);
	СписокСчетов235 = Новый СписокЗначений;
	СписокСчетов235.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОохранногоОборудования", СписокСчетов235);
	
	СписокСчетов236 = Новый СписокЗначений;
	СписокСчетов236.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОСкладскогоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОскладскогоОборудования", СписокСчетов236);
	СписокСчетов237 = Новый СписокЗначений;
	СписокСчетов237.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОскладскогоОборудования", СписокСчетов237);
	
	СписокСчетов238 = Новый СписокЗначений;
	СписокСчетов238.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОСухогоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОсухогоОборудования", СписокСчетов238);
	СписокСчетов239 = Новый СписокЗначений;
	СписокСчетов239.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОсухогоОборудования", СписокСчетов239);
	
	СписокСчетов240 = Новый СписокЗначений;
	СписокСчетов240.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОХолодильногоОборудования);
	Запрос.УстановитьПараметр("Счета_ТОхолодильногоОборудования", СписокСчетов240);
	СписокСчетов241 = Новый СписокЗначений;
	СписокСчетов241.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОхолодильногоОборудования", СписокСчетов241);
	
	СписокСчетов242 = Новый СписокЗначений;
	СписокСчетов242.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОЭлектронногоОборудованияЭКЛЗ);
	Запрос.УстановитьПараметр("Счета_ТОэлектронногоОборудованияЭКЛЗ", СписокСчетов242);
	СписокСчетов243 = Новый СписокЗначений;
	СписокСчетов243.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОэлектронногоОборудованияЭКЛЗ", СписокСчетов243);
	
	СписокСчетов244 = Новый СписокЗначений;
	СписокСчетов244.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОЭлектронногоОборудованияЕжемесячное);
	Запрос.УстановитьПараметр("Счета_ТОэлектронногоОборудованияЕжемесячное", СписокСчетов244);
	СписокСчетов245 = Новый СписокЗначений;
	СписокСчетов245.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОэлектронногоОборудованияЕжемесячное", СписокСчетов245);
	
	СписокСчетов246 = Новый СписокЗначений;
	СписокСчетов246.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОЭлектронногоОборудованияПлановое);
	Запрос.УстановитьПараметр("Счета_ТОэлектронногоОборудованияПлановое", СписокСчетов246);
	СписокСчетов247 = Новый СписокЗначений;
	СписокСчетов247.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОэлектронногоОборудованияПлановое", СписокСчетов247);
	
	СписокСчетов248 = Новый СписокЗначений;
	СписокСчетов248.Добавить(ПланыСчетов.бит_Дополнительный_2.ТОПрочихОСИИнвентаря);
	Запрос.УстановитьПараметр("Счета_ТОпрочихОСиИнвентаря", СписокСчетов248);
	СписокСчетов249 = Новый СписокЗначений;
	СписокСчетов249.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТОпрочихОСиИнвентаря", СписокСчетов249);
	
	СписокСчетов250 = Новый СписокЗначений;
	СписокСчетов250.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтИнженерногоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтИнженерногоОборудования", СписокСчетов250);
	СписокСчетов251 = Новый СписокЗначений;
	СписокСчетов251.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтИнженерногоОборудования", СписокСчетов251);
	
	СписокСчетов252 = Новый СписокЗначений;
	СписокСчетов252.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтКулинарногоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтКулинарногоОборудования", СписокСчетов252);
	СписокСчетов253 = Новый СписокЗначений;
	СписокСчетов253.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтКулинарногоОборудования", СписокСчетов253);
	
	СписокСчетов254 = Новый СписокЗначений;
	СписокСчетов254.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтСкладскогоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтСкладскогоОборудования", СписокСчетов254);
	СписокСчетов255 = Новый СписокЗначений;
	СписокСчетов255.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтСкладскогоОборудования", СписокСчетов255);
	
	СписокСчетов256 = Новый СписокЗначений;
	СписокСчетов256.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтСухогоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтСухогоОборудования", СписокСчетов256);
	СписокСчетов257 = Новый СписокЗначений;
	СписокСчетов257.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтСухогоОборудования", СписокСчетов257);
	
	СписокСчетов258 = Новый СписокЗначений;
	СписокСчетов258.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтХолодильногоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтХолодильногоОборудования", СписокСчетов258);
	СписокСчетов259 = Новый СписокЗначений;
	СписокСчетов259.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтХолодильногоОборудования", СписокСчетов259);
	
	СписокСчетов260 = Новый СписокЗначений;
	СписокСчетов260.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтЭлектронногоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтЭлектронногоОборудования", СписокСчетов260);
	СписокСчетов261 = Новый СписокЗначений;
	СписокСчетов261.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтЭлектронногоОборудования", СписокСчетов261);
	
	СписокСчетов262 = Новый СписокЗначений;
	СписокСчетов262.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтОхранногоОборудования);
	Запрос.УстановитьПараметр("Счета_РемонтОхранногоОборудования", СписокСчетов262);
	СписокСчетов263 = Новый СписокЗначений;
	СписокСчетов263.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтОхранногоОборудования", СписокСчетов263);
	
	СписокСчетов264 = Новый СписокЗначений;
	СписокСчетов264.Добавить(ПланыСчетов.бит_Дополнительный_2.РемонтПрочихОСИИнвентаря);
	Запрос.УстановитьПараметр("Счета_РемонтПрочихОСиИнвентаря", СписокСчетов264);
	СписокСчетов265 = Новый СписокЗначений;
	СписокСчетов265.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РемонтПрочихОСиИнвентаря", СписокСчетов265);
	
	СписокСчетов266 = Новый СписокЗначений;
	СписокСчетов266.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочийРемонтСтройматериалы);
	Запрос.УстановитьПараметр("Счета_ПрочийРемонт", СписокСчетов266);
	СписокСчетов267 = Новый СписокЗначений;
	СписокСчетов267.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочийРемонт", СписокСчетов267);
	
	СписокСчетов268 = Новый СписокЗначений;
	СписокСчетов268.Добавить(ПланыСчетов.бит_Дополнительный_2.ОзеленениеТерритории);
	Запрос.УстановитьПараметр("Счета_ОзеленениеТерритории", СписокСчетов268);
	СписокСчетов269 = Новый СписокЗначений;
	СписокСчетов269.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОзеленениеТерритории", СписокСчетов269);
	
	СписокСчетов270 = Новый СписокЗначений;
	СписокСчетов270.Добавить(ПланыСчетов.бит_Дополнительный_2.СодержаниеШатров);
	Запрос.УстановитьПараметр("Счета_СодержаниеШатров", СписокСчетов270);
	СписокСчетов271 = Новый СписокЗначений;
	СписокСчетов271.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СодержаниеШатров", СписокСчетов271);
	
	СписокСчетов272 = Новый СписокЗначений;
	СписокСчетов272.Добавить(ПланыСчетов.бит_Дополнительный_2.Водоснабжение);
	Запрос.УстановитьПараметр("Счета_Водоснабжение", СписокСчетов272);
	СписокСчетов273 = Новый СписокЗначений;
	СписокСчетов273.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Водоснабжение", СписокСчетов273);
	
	СписокСчетов274 = Новый СписокЗначений;
	СписокСчетов274.Добавить(ПланыСчетов.бит_Дополнительный_2.Газоснабжение);
	Запрос.УстановитьПараметр("Счета_Газоснабжение", СписокСчетов274);
	СписокСчетов275 = Новый СписокЗначений;
	СписокСчетов275.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Газоснабжение", СписокСчетов275);
	
	СписокСчетов276 = Новый СписокЗначений;
	СписокСчетов276.Добавить(ПланыСчетов.бит_Дополнительный_2.Теплоснабжение);
	Запрос.УстановитьПараметр("Счета_Теплоснабжение", СписокСчетов276);
	СписокСчетов277 = Новый СписокЗначений;
	СписокСчетов277.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Теплоснабжение", СписокСчетов277);
	
	СписокСчетов278 = Новый СписокЗначений;
	СписокСчетов278.Добавить(ПланыСчетов.бит_Дополнительный_2.Электроснабжение);
	Запрос.УстановитьПараметр("Счета_Электроснабжение", СписокСчетов278);
	СписокСчетов279 = Новый СписокЗначений;
	СписокСчетов279.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Электроснабжение", СписокСчетов279);
	
	СписокСчетов280 = Новый СписокЗначений;
	СписокСчетов280.Добавить(ПланыСчетов.бит_Дополнительный_2.СодержаниеДизельгенераторовТопливо);
	Запрос.УстановитьПараметр("Счета_РасходыНаСодержаниеДизельгенераторовТопливо", СписокСчетов280);
	СписокСчетов281 = Новый СписокЗначений;
	СписокСчетов281.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РасходыНаСодержаниеДизельгенераторовТопливо", СписокСчетов281);
	
	СписокСчетов282 = Новый СписокЗначений;
	СписокСчетов282.Добавить(ПланыСчетов.бит_Дополнительный_2.СодержаниеДизельгенераторовУслуги);
	Запрос.УстановитьПараметр("Счета_РасходыНаСодержаниеДизельгенераторовУслуги", СписокСчетов282);
	СписокСчетов283 = Новый СписокЗначений;
	СписокСчетов283.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РасходыНаСодержаниеДизельгенераторовУслуги", СписокСчетов283);
	
	СписокСчетов283_1 = Новый СписокЗначений;
	СписокСчетов283_1.Добавить(ПланыСчетов.бит_Дополнительный_2.РасходыНаСодержаниеДизельгенераторов);
	Запрос.УстановитьПараметр("Счета_РасходыНаСодержаниеДизельгенераторов", СписокСчетов283_1);
	СписокСчетов283_2 = Новый СписокЗначений;
	СписокСчетов283_2.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РасходыНаСодержаниеДизельгенераторов", СписокСчетов283_2);
	//БИТ АКриштопов Расходы на содержание дизельгенераторов 2016
	
	СписокСчетов284 = Новый СписокЗначений;
	СписокСчетов284.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеКоммунальныеРасходы);
	Если СтруктураДопСчетов.Счет72623 <> Неопределено Тогда
		СписокСчетов284.Добавить(СтруктураДопСчетов.Счет72623); 
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_ПрочиеКоммРасходы", СписокСчетов284);
	СписокСчетов285 = Новый СписокЗначений;
	СписокСчетов285.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеКоммРасходы", СписокСчетов285);
	
	СписокСчетов286 = Новый СписокЗначений;
	СписокСчетов286.Добавить(ПланыСчетов.бит_Дополнительный_2.ВывозМусораРасходы);
	Запрос.УстановитьПараметр("Счета_ВывозМусора", СписокСчетов286);
	СписокСчетов287 = Новый СписокЗначений;
	СписокСчетов287.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВывозМусора", СписокСчетов287);
	
	СписокСчетов288 = Новый СписокЗначений;
	СписокСчетов288.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтПродажиВторсырья);
	Запрос.УстановитьПараметр("Счета_ВыручкаОтРеализацииВторсырья", СписокСчетов288);
	СписокСчетов289 = Новый СписокЗначений;
	СписокСчетов289.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВыручкаОтРеализацииВторсырья", СписокСчетов289);
	
	СписокСчетов290 = Новый СписокЗначений;
	СписокСчетов290.Добавить(ПланыСчетов.бит_Дополнительный_2.ДератизацияИДезинфекция);
	Запрос.УстановитьПараметр("Счета_ДератизацияДезинфекция", СписокСчетов290);
	СписокСчетов291 = Новый СписокЗначений;
	СписокСчетов291.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ДератизацияДезинфекция", СписокСчетов291);
	
	СписокСчетов292 = Новый СписокЗначений;
	СписокСчетов292.Добавить(ПланыСчетов.бит_Дополнительный_2.ОчисткаЖиропескоуловителей);
	Запрос.УстановитьПараметр("Счета_ОчисткаЖиропескоуловителей", СписокСчетов292);
	СписокСчетов293 = Новый СписокЗначений;
	СписокСчетов293.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОчисткаЖиропескоуловителей", СписокСчетов293);
	
	СписокСчетов294 = Новый СписокЗначений;
	СписокСчетов294.Добавить(ПланыСчетов.бит_Дополнительный_2.УборкаПомещенийУслуги);
	Запрос.УстановитьПараметр("Счета_УборкаПомещенийУслуги", СписокСчетов294);
	СписокСчетов295 = Новый СписокЗначений;
	СписокСчетов295.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УборкаПомещенийУслуги", СписокСчетов295);
	
	СписокСчетов296 = Новый СписокЗначений;
	СписокСчетов296.Добавить(ПланыСчетов.бит_Дополнительный_2.УборкаПомещенийРасходники);
	Запрос.УстановитьПараметр("Счета_УборкаПомещенийРасходники", СписокСчетов296);
	СписокСчетов297 = Новый СписокЗначений;
	СписокСчетов297.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УборкаПомещенийРасходники", СписокСчетов297);
	
	СписокСчетов298 = Новый СписокЗначений;
	СписокСчетов298.Добавить(ПланыСчетов.бит_Дополнительный_2.УборкаТерритории);
	Запрос.УстановитьПараметр("Счета_УборкаТерритории", СписокСчетов298);
	СписокСчетов299 = Новый СписокЗначений;
	СписокСчетов299.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УборкаТерритории", СписокСчетов299);
	
	СписокСчетов300 = Новый СписокЗначений;
	СписокСчетов300.Добавить(ПланыСчетов.бит_Дополнительный_2.СборТележек);
	Запрос.УстановитьПараметр("Счета_СборТележек", СписокСчетов300);
	СписокСчетов301 = Новый СписокЗначений;
	СписокСчетов301.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СборТележек", СписокСчетов301);
	
	СписокСчетов302 = Новый СписокЗначений;
	СписокСчетов302.Добавить(ПланыСчетов.бит_Дополнительный_2.УборкаКрыши);
	Запрос.УстановитьПараметр("Счета_УборкаКрыши", СписокСчетов302);
	СписокСчетов303 = Новый СписокЗначений;
	СписокСчетов303.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УборкаКрыши", СписокСчетов303);
	
	СписокСчетов304 = Новый СписокЗначений;
	СписокСчетов304.Добавить(ПланыСчетов.бит_Дополнительный_2.ВывозСнега);
	Запрос.УстановитьПараметр("Счета_ВывозСнега", СписокСчетов304);
	СписокСчетов305 = Новый СписокЗначений;
	СписокСчетов305.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ВывозСнега", СписокСчетов305);
	
	СписокСчетов306 = Новый СписокЗначений;
	СписокСчетов306.Добавить(ПланыСчетов.бит_Дополнительный_2.ЧисткаКовров);
	Запрос.УстановитьПараметр("Счета_ЧисткаКовров", СписокСчетов306);
	СписокСчетов307 = Новый СписокЗначений;
	СписокСчетов307.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЧисткаКовров", СписокСчетов307);
	
	СписокСчетов308 = Новый СписокЗначений;
	СписокСчетов308.Добавить(ПланыСчетов.бит_Дополнительный_2.СтационарнаяСвязьНеИсп);
	СписокСчетов308.Добавить(ПланыСчетов.бит_Дополнительный_2.СтационарнаяСвязьИнтернет);
	СписокСчетов308.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнтернетТрафикНеИсп);
	Запрос.УстановитьПараметр("Счета_СтационарнаяСвязьИнтернет", СписокСчетов308);
	СписокСчетов309 = Новый СписокЗначений;
	СписокСчетов309.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтационарнаяСвязьИнтернет", СписокСчетов309);
	
	СписокСчетов310 = Новый СписокЗначений;
	СписокСчетов310.Добавить(ПланыСчетов.бит_Дополнительный_2.МобильнаяСвязь);
	Запрос.УстановитьПараметр("Счета_МобильнаяСвязь", СписокСчетов310);
	СписокСчетов311 = Новый СписокЗначений;
	СписокСчетов311.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_МобильнаяСвязь", СписокСчетов311);
	
	СписокСчетов312 = Новый СписокЗначений;
	СписокСчетов312.Добавить(ПланыСчетов.бит_Дополнительный_2.ПочтовыеУслуги);
	Запрос.УстановитьПараметр("Счета_ПочтовыеРасходы", СписокСчетов312);
	СписокСчетов313 = Новый СписокЗначений;
	СписокСчетов313.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПочтовыеРасходы", СписокСчетов313);
	
	СписокСчетов314 = Новый СписокЗначений;
	СписокСчетов314.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаОборудования);
	СписокСчетов314.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаОборудованияНеИсп);
	Запрос.УстановитьПараметр("Счета_АрендаОборудования", СписокСчетов314);
	СписокСчетов315 = Новый СписокЗначений;
	СписокСчетов315.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаОборудования", СписокСчетов315);
	
	СписокСчетов316 = Новый СписокЗначений;
	СписокСчетов316.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаОборудованияДизельгенераторов);
	СписокСчетов316.Добавить(ПланыСчетов.бит_Дополнительный_2.АрендаОборудованияДизельгенераторовНеИсп);
	Запрос.УстановитьПараметр("Счета_АрендаДизельгенераторов", СписокСчетов316);
	СписокСчетов317 = Новый СписокЗначений;
	СписокСчетов317.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АрендаДизельгенераторов", СписокСчетов317);
	
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	СписокСчетовШтрафыПДКиПНВ = Новый СписокЗначений;
	СписокСчетовШтрафыПДКиПНВ.Добавить(ПланыСчетов.бит_Дополнительный_2.ШтрафыПДКиПНВ);
	Запрос.УстановитьПараметр("Счета_ШтрафыПДКиПНВ", СписокСчетовШтрафыПДКиПНВ);
	СписокСчетовКоррШтрафыПДКиПНВ = Новый СписокЗначений;
	СписокСчетовКоррШтрафыПДКиПНВ.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ШтрафыПДКиПНВ", СписокСчетовКоррШтрафыПДКиПНВ);
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	
	СписокСчетов318 = Новый СписокЗначений;
	СписокСчетов318.Добавить(ПланыСчетов.бит_Дополнительный_2.ПроизводственныйИнвентарь);
	Запрос.УстановитьПараметр("Счета_ПроизводственныйИнвентарь", СписокСчетов318);
	СписокСчетов319 = Новый СписокЗначений;
	СписокСчетов319.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПроизводственныйИнвентарь", СписокСчетов319);
	
	СписокСчетов320 = Новый СписокЗначений;
	СписокСчетов320.Добавить(ПланыСчетов.бит_Дополнительный_2.ХозтоварыИнвентарь);
	Запрос.УстановитьПараметр("Счета_ХозтоварыИнвентарь", СписокСчетов320);
	СписокСчетов321 = Новый СписокЗначений;
	СписокСчетов321.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ХозтоварыИнвентарь", СписокСчетов321);
	
	СписокСчетов322 = Новый СписокЗначений;
	СписокСчетов322.Добавить(ПланыСчетов.бит_Дополнительный_2.МатериалыДляАУПИМедикаменты);
	Запрос.УстановитьПараметр("Счета_МатериалыДляАУПиМедикаменты", СписокСчетов322);
	СписокСчетов323 = Новый СписокЗначений;
	СписокСчетов323.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_МатериалыДляАУПиМедикаменты", СписокСчетов323);
	
	СписокСчетов324 = Новый СписокЗначений;
	СписокСчетов324.Добавить(ПланыСчетов.бит_Дополнительный_2.КанцелярскиеТовары);
	СписокСчетов324.Добавить(ПланыСчетов.бит_Дополнительный_2.Картриджи);
	Запрос.УстановитьПараметр("Счета_КанцТовары", СписокСчетов324);
	СписокСчетов325 = Новый СписокЗначений;
	СписокСчетов325.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КанцТовары", СписокСчетов325);
	
	СписокСчетов326 = Новый СписокЗначений;
	СписокСчетов326.Добавить(ПланыСчетов.бит_Дополнительный_2.Спецодежда);
	Запрос.УстановитьПараметр("Счета_Спецодежда", СписокСчетов326);
	СписокСчетов327 = Новый СписокЗначений;
	СписокСчетов327.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Спецодежда", СписокСчетов327);
	
	СписокСчетов328 = Новый СписокЗначений;
	СписокСчетов328.Добавить(ПланыСчетов.бит_Дополнительный_2.Топливо);
	Запрос.УстановитьПараметр("Счета_Топливо", СписокСчетов328);
	СписокСчетов329 = Новый СписокЗначений;
	СписокСчетов329.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Топливо", СписокСчетов329);
	
	СписокСчетов330 = Новый СписокЗначений;
	СписокСчетов330.Добавить(ПланыСчетов.бит_Дополнительный_2.УслугиОхраннойОрганизацииПостоянныеНеИсп);
	СписокСчетов330.Добавить(ПланыСчетов.бит_Дополнительный_2.УслугиОхраннойОрганизацииСезонныеНеИсп);
	СписокСчетов330.Добавить(ПланыСчетов.бит_Дополнительный_2.УслугиОхраннойОрганизации);
	Запрос.УстановитьПараметр("Счета_УслугиОхраннойСигнализации", СписокСчетов330);
	СписокСчетов331 = Новый СписокЗначений;
	СписокСчетов331.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УслугиОхраннойСигнализации", СписокСчетов331);
	
	СписокСчетов332 = Новый СписокЗначений;
	СписокСчетов332.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходыНаОхрану);
	Запрос.УстановитьПараметр("Счета_ПрочиеРасходыНаОхрану", СписокСчетов332);
	СписокСчетов333 = Новый СписокЗначений;
	СписокСчетов333.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеРасходыНаОхрану", СписокСчетов333);
	
	СписокСчетов334 = Новый СписокЗначений;
	СписокСчетов334.Добавить(ПланыСчетов.бит_Дополнительный_2.Эквайринг);
	Запрос.УстановитьПараметр("Счета_Эквайринг", СписокСчетов334);
	СписокСчетов335 = Новый СписокЗначений;
	СписокСчетов335.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Эквайринг", СписокСчетов335);
	
	СписокСчетов336 = Новый СписокЗначений;
	СписокСчетов336.Добавить(ПланыСчетов.бит_Дополнительный_2.СтрахованиеИмуществаИТоварныхЗапасов);
	Запрос.УстановитьПараметр("Счета_СтрахованиеИмуществаТоварныхЗапасов", СписокСчетов336);
	СписокСчетов337 = Новый СписокЗначений;
	СписокСчетов337.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтрахованиеИмуществаТоварныхЗапасов", СписокСчетов337);
	
	СписокСчетов338 = Новый СписокЗначений;
	СписокСчетов338.Добавить(ПланыСчетов.бит_Дополнительный_2.СтрахованиеГрузов);
	Запрос.УстановитьПараметр("Счета_СтрахованиеГрузов", СписокСчетов338);
	СписокСчетов339 = Новый СписокЗначений;
	СписокСчетов339.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтрахованиеГрузов", СписокСчетов339);
	
	СписокСчетов340 = Новый СписокЗначений;
	СписокСчетов340.Добавить(ПланыСчетов.бит_Дополнительный_2.СтрахованиеАвтотранспорта);
	Запрос.УстановитьПараметр("Счета_СтрахованиеАвтотранспорта", СписокСчетов340);
	СписокСчетов341 = Новый СписокЗначений;
	СписокСчетов341.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СтрахованиеАвтотранспорта", СписокСчетов341);
	
	СписокСчетов342 = Новый СписокЗначений;
	СписокСчетов342.Добавить(ПланыСчетов.бит_Дополнительный_2.СтрахованиеПрочее);
	Запрос.УстановитьПараметр("Счета_ПрочееСтрахование", СписокСчетов342);
	СписокСчетов343 = Новый СписокЗначений;
	СписокСчетов343.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочееСтрахование", СписокСчетов343);
	
	СписокСчетов344 = Новый СписокЗначений;
	СписокСчетов344.Добавить(ПланыСчетов.бит_Дополнительный_2.БанковскоеОбслуживание);
	Запрос.УстановитьПараметр("Счета_БанковскоеОбслуживание", СписокСчетов344);
	СписокСчетов345 = Новый СписокЗначений;
	СписокСчетов345.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_БанковскоеОбслуживание", СписокСчетов345);
	
	СписокСчетов346 = Новый СписокЗначений;
	СписокСчетов346.Добавить(ПланыСчетов.бит_Дополнительный_2.СодержаниеАрхива);
	Запрос.УстановитьПараметр("Счета_СодержаниеАрхива", СписокСчетов346);
	СписокСчетов347 = Новый СписокЗначений;
	СписокСчетов347.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СодержаниеАрхива", СписокСчетов347);
	
	СписокСчетов348 = Новый СписокЗначений;
	СписокСчетов348.Добавить(ПланыСчетов.бит_Дополнительный_2.АудитИОценка);
	Запрос.УстановитьПараметр("Счета_АудитИОценка", СписокСчетов348);
	СписокСчетов349 = Новый СписокЗначений;
	СписокСчетов349.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АудитИОценка", СписокСчетов349);
	
	СписокСчетов350 = Новый СписокЗначений;
	СписокСчетов350.Добавить(ПланыСчетов.бит_Дополнительный_2.ОформлениеДокументов);
	Запрос.УстановитьПараметр("Счета_ОформлениеДокументов", СписокСчетов350);
	СписокСчетов351 = Новый СписокЗначений;
	СписокСчетов351.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОформлениеДокументов", СписокСчетов351);
	
	СписокСчетов352 = Новый СписокЗначений;
	СписокСчетов352.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗатратыНаПО);
	Запрос.УстановитьПараметр("Счета_ЗатратыНаПО", СписокСчетов352);
	СписокСчетов353 = Новый СписокЗначений;
	СписокСчетов353.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗатратыНаПО", СписокСчетов353);
	
	СписокСчетов354 = Новый СписокЗначений;
	СписокСчетов354.Добавить(ПланыСчетов.бит_Дополнительный_2.СертификацияИЛицензированиеНеИсп);
	СписокСчетов354.Добавить(ПланыСчетов.бит_Дополнительный_2.РазрешительнаяДокументацияНеИсп);
	СписокСчетов354.Добавить(ПланыСчетов.бит_Дополнительный_2.РазрешительнаяДокументацияСертификацияЛицензирование);
	Запрос.УстановитьПараметр("Счета_РазрешительнаяДокументацияСертификацияЛицензирование", СписокСчетов354);
	СписокСчетов355 = Новый СписокЗначений;
	СписокСчетов355.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РазрешительнаяДокументацияСертификацияЛицензирование", СписокСчетов355);
	
	СписокСчетов356 = Новый СписокЗначений;
	СписокСчетов356.Добавить(ПланыСчетов.бит_Дополнительный_2.ЮридическиеУслуги);
	Запрос.УстановитьПараметр("Счета_ЮрУслуги", СписокСчетов356);
	СписокСчетов357 = Новый СписокЗначений;
	СписокСчетов357.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЮрУслуги", СписокСчетов357);
	
	СписокСчетов358 = Новый СписокЗначений;
	СписокСчетов358.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнформационныеУслуги);
	Запрос.УстановитьПараметр("Счета_ИнфУслуги", СписокСчетов358);
	СписокСчетов359 = Новый СписокЗначений;
	СписокСчетов359.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ИнфУслуги", СписокСчетов359);
	
	СписокСчетов360 = Новый СписокЗначений;
	СписокСчетов360.Добавить(ПланыСчетов.бит_Дополнительный_2.БухгалтерскоеОбслуживание);
	Запрос.УстановитьПараметр("Счета_БухОбслуживание", СписокСчетов360);
	СписокСчетов361 = Новый СписокЗначений;
	СписокСчетов361.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_БухОбслуживание", СписокСчетов361);
	
	СписокСчетов362 = Новый СписокЗначений;
	СписокСчетов362.Добавить(ПланыСчетов.бит_Дополнительный_2.КонсультационныеУслуги);
	Запрос.УстановитьПараметр("Счета_КонсУслуги", СписокСчетов362);
	СписокСчетов363 = Новый СписокЗначений;
	СписокСчетов363.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КонсУслуги", СписокСчетов363);
	
	СписокСчетов364 = Новый СписокЗначений;
	СписокСчетов364.Добавить(ПланыСчетов.бит_Дополнительный_2.РасходНалогНаИмущество);
	Запрос.УстановитьПараметр("Счета_НалогНаИмущество", СписокСчетов364);
	СписокСчетов365 = Новый СписокЗначений;
	СписокСчетов365.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_НалогНаИмущество", СписокСчетов365);
	
	СписокСчетов366 = Новый СписокЗначений;
	СписокСчетов366.Добавить(ПланыСчетов.бит_Дополнительный_2.РасходЗемельныйНалог);
	Запрос.УстановитьПараметр("Счета_ЗемНалог", СписокСчетов366);
	СписокСчетов367 = Новый СписокЗначений;
	СписокСчетов367.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЗемНалог", СписокСчетов367);
	
	СписокСчетов368 = Новый СписокЗначений;
	СписокСчетов368.Добавить(ПланыСчетов.бит_Дополнительный_2.РасходТранспортныйНалог);
	Запрос.УстановитьПараметр("Счета_ТранспНалог", СписокСчетов368);
	СписокСчетов369 = Новый СписокЗначений;
	СписокСчетов369.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТранспНалог", СписокСчетов369);
	
	СписокСчетов370 = Новый СписокЗначений;
	СписокСчетов370.Добавить(ПланыСчетов.бит_Дополнительный_2.НДСНеПринимаемыйКВычету);
	Запрос.УстановитьПараметр("Счета_НДСнепринимаемыйКвычету", СписокСчетов370);
	СписокСчетов371 = Новый СписокЗначений;
	СписокСчетов371.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_НДСнепринимаемыйКвычету", СписокСчетов371);
	
	СписокСчетов372 = Новый СписокЗначений;
	СписокСчетов372.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеОперационныеНалоги);
	Запрос.УстановитьПараметр("Счета_ПрочиеОперНалоги", СписокСчетов372);
	СписокСчетов373 = Новый СписокЗначений;
	СписокСчетов373.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеОперНалоги", СписокСчетов373);
	
	СписокСчетов374 = Новый СписокЗначений;
	СписокСчетов374.Добавить(ПланыСчетов.бит_Дополнительный_2.ТранспортныеУслуги);
	Запрос.УстановитьПараметр("Счета_ТранспУслуги", СписокСчетов374);
	СписокСчетов375 = Новый СписокЗначений;
	СписокСчетов375.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ТранспУслуги", СписокСчетов375);
	
	СписокСчетов376 = Новый СписокЗначений;
	СписокСчетов376.Добавить(ПланыСчетов.бит_Дополнительный_2.ПредставительскиеРасходы);
	Запрос.УстановитьПараметр("Счета_ПредставительскиеРасходы", СписокСчетов376);
	СписокСчетов377 = Новый СписокЗначений;
	СписокСчетов377.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПредставительскиеРасходы", СписокСчетов377);
	
	СписокСчетов378 = Новый СписокЗначений;
	СписокСчетов378.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРаботыУслугиНеИсп);
	Запрос.УстановитьПараметр("Счета_ПрочиеРасходы", СписокСчетов378);
	СписокСчетов379 = Новый СписокЗначений;
	СписокСчетов379.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеРасходы", СписокСчетов379);
	
	СписокСчетов380 = Новый СписокЗначений;
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтРеализацииОСиПрочихАктивов);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.СтоимостьОСиПрочихАктивов);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.УбыткиОтСписанияОСиПрочихАктивов);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходыВыбытиеОС);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтРеализацииICLL);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтСписанияICLL_);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.ВыручкаОтРеализацииПрочихАктивовНеисп);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.СтоимостьПрочихАктивовНеисп);
	СписокСчетов380.Добавить(ПланыСчетов.бит_Дополнительный_2.УбыткиОтСписанияПрочихАктивовНеисп);
	Запрос.УстановитьПараметр("Счета_ПрибыльУбытокОтРеализацииОСиПрочихАктивов", СписокСчетов380);
	СписокСчетов381 = Новый СписокЗначений;
	СписокСчетов381.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	СписокСчетов381.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрибыльУбытокОтРеализацииОСиПрочихАктивов", СписокСчетов381);
	
	СписокСчетов382 = Новый СписокЗначений;
	СписокСчетов382.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтСписанияДЗ);
	СписокСчетов382.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрибытьОтСписанияКЗ);
	СписокСчетов382.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервПодСомнительнуюДЗ);
	Запрос.УстановитьПараметр("Счета_ПрибыльУбытокОтСписанияКЗДЗ", СписокСчетов382);
	СписокСчетов383 = Новый СписокЗначений;
	СписокСчетов383.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	СписокСчетов383.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрибыльУбытокОтСписанияКЗДЗ", СписокСчетов383);
	
	СписокСчетов384 = Новый СписокЗначений;
	СписокСчетов384.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрибыльУбытокОтПереоценкиИнвСоб);
	СписокСчетов384.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрибыльУбытокОтПереоценкиОС);
	Запрос.УстановитьПараметр("Счета_ПрибыльУбытокОтПереоценкиИнвСобственности", СписокСчетов384);
	СписокСчетов385 = Новый СписокЗначений;
	СписокСчетов385.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрибыльУбытокОтПереоценкиИнвСобственности", СписокСчетов385);
	
	СписокСчетов386 = Новый СписокЗначений;
	СписокСчетов386.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеОСрасх);
	СписокСчетов386.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеНМАрасх);
	СписокСчетов386.Добавить(ПланыСчетов.бит_Дополнительный_2.РезервПодСнижениеСтоимостиЗапасовКромеТовара);
	СписокСчетов386.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочееОбесценение);
	Запрос.УстановитьПараметр("Счета_ОбесценениеОСНМА", СписокСчетов386);
	СписокСчетов386_1 = Новый СписокЗначений;	
	СписокСчетов386_1.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("718"));
	//БИТ АКриштопов Корректировка себестоимости по обработной реализации Запрос.УстановитьПараметр("Счета_ОбесценениеОСНМА", СписокСчетов386_1);
	СписокСчетов387 = Новый СписокЗначений;
	СписокСчетов387.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОбесценениеОСНМА", СписокСчетов387);
	
	СписокСчетов388 = Новый СписокЗначений;
	СписокСчетов388.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходотСтраховогоВозмещения);
	Запрос.УстановитьПараметр("Счета_ДоходОтСтраховогоВозмещения", СписокСчетов388);
	СписокСчетов389 = Новый СписокЗначений;
	СписокСчетов389.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходОтСтраховогоВозмещения", СписокСчетов389);
	
	СписокСчетов390 = Новый СписокЗначений;
	СписокСчетов390.Добавить(ПланыСчетов.бит_Дополнительный_2.ПолученныеШтрафыНеустойки);
	Запрос.УстановитьПараметр("Счета_ДоходОтШтрафовНеустоек", СписокСчетов390);
	СписокСчетов391 = Новый СписокЗначений;
	СписокСчетов391.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходОтШтрафовНеустоек", СписокСчетов391);
	
	СписокСчетов392 = Новый СписокЗначений;
	СписокСчетов392.Добавить(ПланыСчетов.бит_Дополнительный_2.УплаченныеШтрафыНеустойки);
	Запрос.УстановитьПараметр("Счета_УбытокОтШтрафовНеустоек", СписокСчетов392);
	СписокСчетов393 = Новый СписокЗначений;
	СписокСчетов393.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_УбытокОтШтрафовНеустоек", СписокСчетов393);
	
	СписокСчетов394 = Новый СписокЗначений;
	СписокСчетов394.Добавить(ПланыСчетов.бит_Дополнительный_2.Благотворительность);
	Запрос.УстановитьПараметр("Счета_Благотворительность", СписокСчетов394);
	СписокСчетов395 = Новый СписокЗначений;
	СписокСчетов395.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Благотворительность", СписокСчетов395);
	
	СписокСчетов396 = Новый СписокЗначений;
	СписокСчетов396.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеОперационныеДох_НеИсп);
	СписокСчетов396.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеДоходы);
	СписокСчетов396.Добавить(ПланыСчетов.бит_Дополнительный_2.КомиссионноеВознаграждение);
	Запрос.УстановитьПараметр("Счета_ПрочиеОперДоходы", СписокСчетов396);
	
	СписокСчетов397 = Новый СписокЗначений;
	СписокСчетов397.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеОперДоходы", СписокСчетов397);
	
	СписокСчетов398 = Новый СписокЗначений;
	СписокСчетов398.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходы_);
	СписокСчетов398.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеОперационныеРасходы_НеИсп);
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2018-02-16 (#2987)
	СписокСчетов398.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрочиеРасходыДоходы);
	//ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2018-02-16 (#2987)
	Запрос.УстановитьПараметр("Счета_ПрочиеОперРасходы", СписокСчетов398);
	
	СписокСчетов399 = Новый СписокЗначений;
	СписокСчетов399.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеОперРасходы", СписокСчетов399);
	
	СписокСчетов400 = Новый СписокЗначений;
	СписокСчетов400.Добавить(ПланыСчетов.бит_Дополнительный_2.ДоходОтУчастияВАссоциированныхКомпаниях_);
	Запрос.УстановитьПараметр("Счета_ДоходОтУчастияВАссоцКомпаниях", СписокСчетов400);
	СписокСчетов401 = Новый СписокЗначений;
	СписокСчетов401.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ДоходОтУчастияВАссоцКомпаниях", СписокСчетов401);
	
	СписокСчетов402 = Новый СписокЗначений;
	СписокСчетов402.Добавить(ПланыСчетов.бит_Дополнительный_2.ПроцентыПоОстаткамНаСчетах);
	Запрос.УстановитьПараметр("Счета_ПроцентыПоОстаткамНаСчетах", СписокСчетов402);
	СписокСчетов403 = Новый СписокЗначений;
	СписокСчетов403.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ПроцентыПоОстаткамНаСчетах", СписокСчетов403);
	
	СписокСчетов404 = Новый СписокЗначений;
	СписокСчетов404.Добавить(ПланыСчетов.бит_Дополнительный_2.ПроцентыПолученныеПоПредоставленнымКредитамИЗаймам);
	Запрос.УстановитьПараметр("Счета_ПроцентыПолучениеПоПредостКредитамЗаймам", СписокСчетов404);
	СписокСчетов405 = Новый СписокЗначений;
	СписокСчетов405.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ПроцентыПолучениеПоПредостКредитамЗаймам", СписокСчетов405);
	
	СписокСчетов406 = Новый СписокЗначений;
	СписокСчетов406.Добавить(ПланыСчетов.бит_Дополнительный_2.ПроцентыНачисленныеПоДолговымОбязательствам_);
	Запрос.УстановитьПараметр("Счета_ПроцентыНачисленныеПоДолгОбязательствам", СписокСчетов406);
	СписокСчетов407 = Новый СписокЗначений;
	СписокСчетов407.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПроцентыНачисленныеПоДолгОбязательствам", СписокСчетов407);
	
	СписокСчетов408 = Новый СписокЗначений;
	СписокСчетов408.Добавить(ПланыСчетов.бит_Дополнительный_2.РасходыПоФинансовойАренде);
	Запрос.УстановитьПараметр("Счета_ПроцентыНачисленныеПоФинАренде", СписокСчетов408);
	СписокСчетов409 = Новый СписокЗначений;
	СписокСчетов409.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПроцентыНачисленныеПоФинАренде", СписокСчетов409);
	
	СписокСчетов410 = Новый СписокЗначений;
	СписокСчетов410.Добавить(ПланыСчетов.бит_Дополнительный_2.ХеджированиеПроцентов);
	Запрос.УстановитьПараметр("Счета_ХеджированиеПроцентов", СписокСчетов410);
	СписокСчетов411 = Новый СписокЗначений;
	СписокСчетов411.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ХеджированиеПроцентов", СписокСчетов411);
	
	СписокСчетов412 = Новый СписокЗначений;
	СписокСчетов412.Добавить(ПланыСчетов.бит_Дополнительный_2.КомиссииПоКредитам);
	Запрос.УстановитьПараметр("Счета_КомиссииПоКредитам", СписокСчетов412);
	СписокСчетов413 = Новый СписокЗначений;
	СписокСчетов413.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_КомиссииПоКредитам", СписокСчетов413);
	
	СписокСчетов414 = Новый СписокЗначений;
	СписокСчетов414.Добавить(ПланыСчетов.бит_Дополнительный_2.ПРочиеРасходыНаФинансирование);
	Запрос.УстановитьПараметр("Счета_ПрочиеРасходыНаФинансирование", СписокСчетов414);
	СписокСчетов415 = Новый СписокЗначений;
	СписокСчетов415.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПрочиеРасходыНаФинансирование", СписокСчетов415);
	
	СписокСчетов416 = Новый СписокЗначений;
	СписокСчетов416.Добавить(ПланыСчетов.бит_Дополнительный_2.КурсовыеРАзницыПрибыль);
	СписокСчетов416.Добавить(ПланыСчетов.бит_Дополнительный_2.КурсовыеРАзницыУбыток);
	СписокСчетов416.Добавить(ПланыСчетов.бит_Дополнительный_2.ХеджированиеКурса);
	Запрос.УстановитьПараметр("Счета_КурсовыеРазницы", СписокСчетов416);
	СписокСчетов417 = Новый СписокЗначений;
	СписокСчетов417.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_КурсовыеРазницы", СписокСчетов417);
	
	СписокСчетов418 = Новый СписокЗначений;
	СписокСчетов418.Добавить(ПланыСчетов.бит_Дополнительный_2.СуммаНачисленногоНПпоФорме2);
	СписокСчетов418.Добавить(ПланыСчетов.бит_Дополнительный_2.ОтложенныйНалогМСФО);
	СписокСчетов418.Добавить(ПланыСчетов.бит_Дополнительный_2.ПричитающиесяНалоговыеСанкции);
	СписокСчетов418.Добавить(ПланыСчетов.бит_Дополнительный_2.НалогНаДивиденды);   //ОК Довбешка 24.02.2015
	Запрос.УстановитьПараметр("Счета_РасходПоНалогуНаПрибыль", СписокСчетов418);
	СписокСчетов419 = Новый СписокЗначений;
	СписокСчетов419.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РасходПоНалогуНаПрибыль", СписокСчетов419);
	
	// +СБ Кузнецова С. 2016-06-06 
	СписокСчетов419 = Новый СписокЗначений;
	СчетПоиска = ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("247", ПланыСчетов.бит_Дополнительный_2.ДенежныеСредстваИэквиваленты);
	Если СчетПоиска <> ПланыСчетов.бит_Дополнительный_2.ПустаяСсылка() Тогда
		СписокСчетов419.Добавить(СчетПоиска);
	КонецЕсли;
	Запрос.УстановитьПараметр("Счета_СпецСчетаВБанкахВВалюте", СписокСчетов419);
	// -СБ Кузнецова С.
	
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	СписокСчетов420 = Новый СписокЗначений;
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.ПраваАренды); // 14103
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияНМАПраваАренды); // 14203
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.УбытокОтОбесцененияНМАПраваАренды); // 14303
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.ПервоначальнаяСтоимостьЗатрат); // 17301
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленнаяАмортизация); // 17302
	СписокСчетов420.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("17303"));
	Запрос.УстановитьПараметр("Счета_ПраваАренды", СписокСчетов420);
	// -СБ Кузнецова С.
	
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)
	СписокСчетов421 = Новый СписокЗначений;	
	СписокСчетов421.Добавить(ПланыСчетов.бит_Дополнительный_2.АктивыВформеПраваПользованияЗемля); // 18101
	СписокСчетов421.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленнаяАмортизацияПоАктивамВформеПраваПользованияЗемля); // 18201
	СписокСчетов421.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленныйУбытокОтОбесцененияАктивовВформеПраваПользованияЗемля); // 18301
	Запрос.УстановитьПараметр("Счета_АктивыВФормеПраваПользованияЗемля", СписокСчетов421);
	
	СписокСчетов422 = Новый СписокЗначений;	
	СписокСчетов422.Добавить(ПланыСчетов.бит_Дополнительный_2.АктивыВформеПраваПользованияТорговыеПомещения); // 18102
	СписокСчетов422.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленнаяАмортизацияПоАктивамВформеПраваПользованияТорговыеПомещения); // 18202
	СписокСчетов422.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленныйУбытокОтОбесцененияАктивовВформеПраваПользованияТорговыеПомещения); // 18302
	Запрос.УстановитьПараметр("Счета_АктивыВФормеПраваПользованияТорговыеПомещения", СписокСчетов422);
	
	СписокСчетов423 = Новый СписокЗначений;
	СписокСчетов423.Добавить(ПланыСчетов.бит_Дополнительный_2.АктивыВформеПраваПользованияПрочее); // 18103
	СписокСчетов423.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленнаяАмортизацияПоАктивамВформеПраваПользованияПрочее); // 18203
	СписокСчетов423.Добавить(ПланыСчетов.бит_Дополнительный_2.НакопленныйУбытокОтОбесцененияАктивовВформеПраваПользованияПрочее); // 18303
	Запрос.УстановитьПараметр("Счета_АктивыВФормеПраваПользованияПрочее", СписокСчетов423);
	
	СписокСчетов424 = Новый СписокЗначений;
	СписокСчетов424.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбязательстваПоАрендеДолгосрочные_); // 451
	Запрос.УстановитьПараметр("Счета_ОбязательстваПоАрендеДолгосрочные451", СписокСчетов424);
	
	СписокСчетов425 = Новый СписокЗначений;
	СписокСчетов425.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбязательстваПоАрендеДолгосрочныеВВалюте); // 452
	Запрос.УстановитьПараметр("Счета_ОбязательстваПоАрендеДолгосрочныеВВалюте", СписокСчетов425);
	
	СписокСчетов426 = Новый СписокЗначений;
	СписокСчетов426.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбязательстваПоАрендеКраткосрочные_); // 551
	Запрос.УстановитьПараметр("Счета_ОбязательстваПоАрендеКраткосрочные551", СписокСчетов426);
	
	СписокСчетов427 = Новый СписокЗначений;
	СписокСчетов427.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбязательстваПоАрендеКраткосрочныеВВалюте); // 552
	Запрос.УстановитьПараметр("Счета_ОбязательстваПоАрендеКраткосрочныеВВалюте", СписокСчетов427);
	
	СписокСчетов428 = Новый СписокЗначений;
	СписокСчетов428.Добавить(ПланыСчетов.бит_Дополнительный_2.АмортизацияАктивовВформеПраваПользования); // 72205
	Запрос.УстановитьПараметр("Счета_АмортизацияАктивовВФормеПраваПользования", СписокСчетов428);
	
	СписокСчетов429 = Новый СписокЗначений;
	СписокСчетов429.Добавить(ПланыСчетов.бит_Дополнительный_2.ОбесценениеАктивовВформеПраваПользования); // 74108
	Запрос.УстановитьПараметр("Счета_ОбесценениеАктивовВФормеПраваПользования", СписокСчетов429);
	
	СписокСчетов430 = Новый СписокЗначений;
	СписокСчетов430.Добавить(ПланыСчетов.бит_Дополнительный_2.ПрибыльУбытокОтВыбытияМодификацииАктивовВформеПраваПользования); // 628
	Запрос.УстановитьПараметр("Счета_ПрибыльУбытокОтВыбытияМодификацииАктивов", СписокСчетов430);
	
	СписокСчетов431 = Новый СписокЗначений;
	СписокСчетов431.Добавить(ПланыСчетов.бит_Дополнительный_2.ПроцентыНачисленныеПоОбязательствамПоАренде); // 75104
	Запрос.УстановитьПараметр("Счета_ПроцентыНачисленныеПоОбязательствамПоАренде", СписокСчетов431);
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)

	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-07-02 (#3803)
	СписокСчетов448 = Новый СписокЗначений;
	СписокСчетов448.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_АмортизацияАктивовВФормеПраваПользования", СписокСчетов448);
	
	СписокСчетов449 = Новый СписокЗначений;
	СписокСчетов449.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПроцентыНачисленныеПоОбязательствамПоАренде", СписокСчетов449);
	
	СписокСчетов450 = Новый СписокЗначений;
	СписокСчетов450.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ОбесценениеАктивовВФормеПраваПользования", СписокСчетов450);
	
	СписокСчетов451 = Новый СписокЗначений;
	СписокСчетов451.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовДоходов);
	Запрос.УстановитьПараметр("КорСчета_ПрибыльУбытокОтВыбытияМодификацииАктивов", СписокСчетов451);
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-07-02 (#3803)

	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	СписокСчетов432 = Новый СписокЗначений;
	СписокСчетов432.Добавить(ПланыСчетов.бит_Дополнительный_2.ИнтернетРекламаСМИ);
	Запрос.УстановитьПараметр("Счета_ИнтернетРекламаСМИ", СписокСчетов432);
	СписокСчетов433 = Новый СписокЗначений;
	СписокСчетов433.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ИнтернетРекламаСМИ", СписокСчетов433);
	
	СписокСчетов434 = Новый СписокЗначений;
	СписокСчетов434.Добавить(ПланыСчетов.бит_Дополнительный_2.КаталогЛистовкиАудитРаспространение);
	Запрос.УстановитьПараметр("Счета_ЛистовкиАудитРаспространение", СписокСчетов434);
	СписокСчетов435 = Новый СписокЗначений;
	СписокСчетов435.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ЛистовкиАудитРаспространение", СписокСчетов435);
	
	СписокСчетов436 = Новый СписокЗначений;
	СписокСчетов436.Добавить(ПланыСчетов.бит_Дополнительный_2.SMSрассылка);
	Запрос.УстановитьПараметр("Счета_СМСViber", СписокСчетов436);
	СписокСчетов437 = Новый СписокЗначений;
	СписокСчетов437.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_СМСViber", СписокСчетов437);
	
	СписокСчетов438 = Новый СписокЗначений;
	СписокСчетов438.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72322"));
	Запрос.УстановитьПараметр("Счета_РегиональныеПромоакции", СписокСчетов438);
	СписокСчетов439 = Новый СписокЗначений;
	СписокСчетов439.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_РегиональныеПромоакции", СписокСчетов439);
	
	СписокСчетов440 = Новый СписокЗначений;
	СписокСчетов440.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72323"));
	Запрос.УстановитьПараметр("Счета_Видеореклама", СписокСчетов440);
	СписокСчетов441 = Новый СписокЗначений;
	СписокСчетов441.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Видеореклама", СписокСчетов441);
	
	СписокСчетов442 = Новый СписокЗначений;
	СписокСчетов442.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72324"));
	Запрос.УстановитьПараметр("Счета_Радиореклама", СписокСчетов442);
	СписокСчетов443 = Новый СписокЗначений;
	СписокСчетов443.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_Радиореклама", СписокСчетов443);
	
	СписокСчетов444 = Новый СписокЗначений;
	СписокСчетов444.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72325"));
	Запрос.УстановитьПараметр("Счета_ИнтернетРекламаECom", СписокСчетов444);
	СписокСчетов445 = Новый СписокЗначений;
	СписокСчетов445.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ИнтернетРекламаECom", СписокСчетов445);
	
	СписокСчетов446 = Новый СписокЗначений;
	СписокСчетов446.Добавить(ПланыСчетов.бит_Дополнительный_2.НайтиПоКоду("72326"));
	Запрос.УстановитьПараметр("Счета_ПоддержкаБрендаСТМ", СписокСчетов446);
	СписокСчетов447 = Новый СписокЗначений;
	СписокСчетов447.Добавить(ПланыСчетов.бит_Дополнительный_2.ЗакрытиеСчетовРасходов);
	Запрос.УстановитьПараметр("КорСчета_ПоддержкаБрендаСТМ", СписокСчетов447);
	
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	
КонецПроцедуры // УстановитьПараметрыСчетов()

// Функция возвращает текстовое представление периода отчета с учетом выбранного языка
//
&НаСервере
Функция ПолучитьНадписьПериода()
	
	НазваниеПериода = "";
	
	// рус. квартал
	Если Объект.НачалоПериода = НачалоКвартала(Объект.НачалоПериода) И КонецДня(Объект.КонецПериода) = КонецКвартала(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Русский" Тогда
		Если Месяц(Объект.НачалоПериода) = 1 Тогда
			НомерКвартала = "1";
		ИначеЕсли Месяц(Объект.НачалоПериода) = 4 Тогда
			НомерКвартала = "2";
		ИначеЕсли Месяц(Объект.НачалоПериода) = 7 Тогда
			НомерКвартала = "3";
		Иначе                                                       
			НомерКвартала = "4";
		КонецЕсли;
		НазваниеПериода = НомерКвартала + " квартал " + СтрЗаменить(Строка(Год(Объект.НачалоПериода)), Символы.НПП, "") + " г.";
	// рус. полугодие
	ИначеЕсли (День(Объект.НачалоПериода) = 1 И Месяц(Объект.НачалоПериода) = 1 И День(Объект.КонецПериода) = 30 И Месяц(Объект.КонецПериода) = 6 И Год(Объект.НачалоПериода) = Год(Объект.КонецПериода) Или
		День(Объект.НачалоПериода) = 1 И Месяц(Объект.НачалоПериода) = 7 И День(Объект.КонецПериода) = 31 И Месяц(Объект.КонецПериода) = 12 И Год(Объект.НачалоПериода) = Год(Объект.КонецПериода)) И Объект.ЯзыкОтчета = "Русский" Тогда
		Если Месяц(Объект.НачалоПериода) = 1 Тогда
			НомерПолугодия = "1";
		Иначе
			НомерПолугодия = "2";
		КонецЕсли;
		НазваниеПериода = НомерПолугодия + " полугодие " + СтрЗаменить(Строка(Год(Объект.НачалоПериода)), Символы.НПП, "") + " г.";
	// рус. 9 месяцев
	ИначеЕсли Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода) И День(Объект.КонецПериода) = 30 И Месяц(Объект.КонецПериода) = 9 И Год(Объект.КонецПериода) = Год(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Русский" Тогда
		НазваниеПериода = "9 месяцев " + СтрЗаменить(Строка(Год(Объект.НачалоПериода)), Символы.НПП, "") + " г.";
	// рус. год
	ИначеЕсли Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода) И КонецДня(Объект.КонецПериода) = КонецГода(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Русский" Тогда
		НазваниеПериода = СтрЗаменить(Строка(Год(Объект.НачалоПериода)), Символы.НПП, "") + " г.";
	// англ. квартал
	ИначеЕсли Объект.НачалоПериода = НачалоКвартала(Объект.НачалоПериода) И КонецДня(Объект.КонецПериода) = КонецКвартала(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Английский" Тогда
		НазваниеПериода = "3 months ended " + Формат(Объект.КонецПериода, "Л=en_GB; ДФ=dd.MM.yy");
	// англ. полугодие
	ИначеЕсли (День(Объект.НачалоПериода) = 1 И Месяц(Объект.НачалоПериода) = 1 И День(Объект.КонецПериода) = 30 И Месяц(Объект.КонецПериода) = 6 И Год(Объект.НачалоПериода) = Год(Объект.КонецПериода) Или
		День(Объект.НачалоПериода) = 1 И Месяц(Объект.НачалоПериода) = 7 И День(Объект.КонецПериода) = 31 И Месяц(Объект.КонецПериода) = 12 И Год(Объект.НачалоПериода) = Год(Объект.КонецПериода)) И Объект.ЯзыкОтчета = "Английский" Тогда
		НазваниеПериода = "6 months ended " + Формат(Объект.КонецПериода, "Л=en_GB; ДФ=dd.MM.yy");
	// англ. 9 месяцев
	ИначеЕсли Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода) И День(Объект.КонецПериода) = 30 И Месяц(Объект.КонецПериода) = 9 И Год(Объект.КонецПериода) = Год(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Английский" Тогда
		НазваниеПериода = "9 months ended " + Формат(Объект.КонецПериода, "Л=en_GB; ДФ=dd.MM.yy");
	// англ. год
	ИначеЕсли Объект.НачалоПериода = НачалоГода(Объект.НачалоПериода) И КонецДня(Объект.КонецПериода) = КонецГода(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Английский" Тогда
		НазваниеПериода = "Year " + СтрЗаменить(Строка(Год(Объект.НачалоПериода)), Символы.НПП, "");
	// англ. месяц
	ИначеЕсли Объект.НачалоПериода = НачалоМесяца(Объект.НачалоПериода) И КонецДня(Объект.КонецПериода) = КонецМесяца(Объект.НачалоПериода) И Объект.ЯзыкОтчета = "Английский" Тогда
		НазваниеПериода = ПредставлениеПериода(НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода), "Л=en");
	Иначе
		НазваниеПериода = ПредставлениеПериода(НачалоДня(Объект.НачалоПериода), КонецДня(Объект.КонецПериода));
	КонецЕсли;
	
	Возврат НазваниеПериода;
	
КонецФункции // ПолучитьНадписьПериода()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	мНастройкаПериода   = Новый СтандартныйПериод;
	
	СписокЯзыков = Новый СписокЗначений;
	СписокЯзыков.Добавить("Русский");
	СписокЯзыков.Добавить("Английский");
	Элементы.ЯзыкОтчета.СписокВыбора.Очистить();
	Для Каждого тек_Значение_уник Из  СписокЯзыков Цикл		
	Элементы.ЯзыкОтчета.СписокВыбора.Добавить(тек_Значение_уник.Значение, тек_Значение_уник.Представление);
	КонецЦикла;
	Объект.ЯзыкОтчета = "Русский";
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ДЕЙСТВИЯ КОМАНДНЫХ ПАНЕЛЕЙ ФОРМЫ

// Процедура-обработчик события "Нажатие" кнопки "Сформировать"
//
&НаКлиенте
Процедура ДействияФормыСформировать(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериметрКонсолидации) Тогда
		Сообщить("Не заполнен периметр консолидации!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
	
КонецПроцедуры // ДействияФормыСформировать()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

// Процедура-обработчик события "Нажатие" кнопки "НастройкаПериода"
//
&НаКлиенте
Процедура КнопкаНастройкаПериодаНажатие(Элемент)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода;
	Диалог.Период = мНастройкаПериода;
	Диалог.Показать(Новый ОписаниеОповещения("КнопкаНастройкаПериодаНажатиеЗавершение", ЭтаФорма, Новый Структура("Диалог", Диалог)));
	
КонецПроцедуры

&НаКлиенте
Процедура КнопкаНастройкаПериодаНажатиеЗавершение(Период, ДополнительныеПараметры) Экспорт
    
    Диалог = ДополнительныеПараметры.Диалог;
    
    Объект.НачалоПериода    = Диалог.Период.ДатаНачала;
    Объект.КонецПериода = Диалог.Период.ДатаОкончания;

КонецПроцедуры // КнопкаНастройкаПериодаНажатие()

// Процедура-обработчик события "Нажатие" кнопки "Расшифровать"
//
&НаКлиенте
Процедура КнопкаРасшифроватьНажатие(Элемент)
	
	ИмяТекущейЯчейки = Результат.ВыделенныеОбласти[0].Имя;
	СтруктураВозврата = КнопкаРасшифроватьНажатиеНаСервере(ИмяТекущейЯчейки);
	
	Если ТипЗнч(СтруктураВозврата) <> Тип("Структура") Тогда 
		Возврат;
	КонецЕсли;
	
	ПараметрыОтчета = Новый Структура;
	ПараметрыОтчета.Вставить("НачалоПериода", Объект.НачалоПериода);
	ПараметрыОтчета.Вставить("КонецПериода", Объект.КонецПериода);
	ПараметрыОтчета.Вставить("ПериметрКонсолидации", Объект.ПериметрКонсолидации);
	ПараметрыОтчета.Вставить("ПараметрыРасшифровки", СтруктураВозврата);
	// создадим отчет-расшифровку
	//ПараметрыФормы = Новый Структура("ПараметрыОтчета, СБ_ОтчетПоГруппеКомпаний", ПараметрыОтчета, Истина);
	Форма = ПолучитьФорму("Отчет.СБ_ОборотыСчетаМеждународный.Форма", , ЭтаФорма);
	Форма.СБ_ОтчетПоГруппеКомпанийРасшифровкаЗаполнить(ПараметрыОтчета);
	Форма.Открыть();
	
КонецПроцедуры
// КнопкаРасшифроватьНажатие()

&НаСервере
Функция КнопкаРасшифроватьНажатиеНаСервере(ИмяТекущейЯчейки)

	Макет =РеквизитФормыВЗначение("Объект").ПолучитьМакет("Макет");
	
	ИмяЯчейкиСПараметром = Лев(ИмяТекущейЯчейки, Найти(ИмяТекущейЯчейки, "C")) + "2";
	ЯчейкаСПараметром = Макет.ПолучитьОбласть(ИмяЯчейкиСПараметром);
	Если ЯчейкаСПараметром.Параметры.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Для данной ячейки расшифровка отчетом не предусмотрена.'");
		Сообщить(ТекстСообщения,СтатусСообщения.Информация);
		Возврат Неопределено;
	КонецЕсли;
	ПараметрЯчейки = ЯчейкаСПараметром.Параметры[0];
	
	ИмяЯчейкиСНазванием = Лев(ИмяТекущейЯчейки, Найти(ИмяТекущейЯчейки, "C")) + "1";
	ЯчейкаСНазванием = Результат.Область(ИмяЯчейкиСНазванием);
	
	ИмяЯчейкиСОрганизацией = "R6C" + Прав(ИмяТекущейЯчейки, СтрДлина(ИмяТекущейЯчейки) - Найти(ИмяТекущейЯчейки, "C"));
	ЯчейкаСОрганизацией = Результат.Область(ИмяЯчейкиСОрганизацией);
	
	ЗапросПар = Новый Запрос;
	УстановитьПараметрыСчетов(ЗапросПар);
	Показатель = "";
	
	Для Каждого Параметр Из ЗапросПар.Параметры Цикл
		ИмяПараметра = ?(Лев(Параметр.Ключ, 3) = "Сче", Прав(Параметр.Ключ, СтрДлина(Параметр.Ключ) - 6), Прав(Параметр.Ключ, СтрДлина(Параметр.Ключ) - 9));
		Попытка
			Пров = ЯчейкаСПараметром.Параметры[ИмяПараметра + "_КонОст"];
			Показатель = "_КонОст";
			Прервать;
		Исключение
			Попытка
				Пров = ЯчейкаСПараметром.Параметры[ИмяПараметра + "_НачОст"];
				Показатель = "_НачОст";
				Прервать;
			Исключение
				Попытка
					Пров = ЯчейкаСПараметром.Параметры[ИмяПараметра + "_Оборот"];
					Показатель = "_Оборот";
					Прервать;
				Исключение
					Попытка
						Пров = ЯчейкаСПараметром.Параметры[ИмяПараметра + "_СпецКонОст"];
						Показатель = "_СпецКонОст";
						Прервать;
					Исключение
						Продолжить;
					КонецПопытки;
				КонецПопытки;
			КонецПопытки;
		КонецПопытки;
	КонецЦикла;
	
	Если Показатель = "" Тогда
		
		ТекстСообщения = НСтр("ru = 'Для данной ячейки расшифровка отчетом не предусмотрена.'");
		Сообщить(ТекстСообщения,СтатусСообщения.Информация);
		Возврат Неопределено;
		
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура("Показатель, ЯчейкаСОрганизацией, ЯчейкаСНазванием, Счета_ИмяПараметра", Показатель, ЯчейкаСОрганизацией.Текст, ЯчейкаСНазванием.Текст, ЗапросПар.Параметры["Счета_" + ИмяПараметра]);
	Если ЗапросПар.Параметры.Свойство("КорСчета_" + ИмяПараметра) Тогда 
		СтруктураВозврата.Вставить("КорСчета_ИмяПараметра", ЗапросПар.Параметры["КорСчета_" + ИмяПараметра]);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Процедура-обработчик события "Нажатие" кнопки "СохранитьЭкземпляр"
//
&НаКлиенте
Процедура КнопкаСохранитьЭкземплярНажатие(Элемент)
	
	// упакуем объект в структуру
	ПараметрыОтчета = Новый Структура("Организация");
	ПараметрыОтчета.Вставить("НастройкаОтчета", ПредопределенноеЗначение("Справочник.бит_НастройкиПроизвольныхОтчетов.СБ_ОтчетСПрограммнойРеализацией"));
	//ПараметрыОтчета.Вставить("ОтборВОтчете", Новый ТаблицаЗначений);
	//ПараметрыОтчета.Вставить("ТаблицаПараметры", Новый ТаблицаЗначений);
	//ПараметрыОтчета.Вставить("ТаблицаДанныеОтчета", Новый ТаблицаЗначений);
	ПараметрыОтчета.Вставить("ДатаНачала", Объект.НачалоПериода);
	ПараметрыОтчета.Вставить("ДатаОкончания", Объект.КонецПериода);
	ПараметрыОтчета.Вставить("ФорматЧисел", "ЧЦ=15; ЧДЦ=0; ЧС=3; ЧРГ=' '; ЧН=-; ЧО=0");
	ПараметрыОтчета.Вставить("РежимРасшифровки", Ложь);
	ПараметрыОтчета.Вставить("Язык", Справочники_НайтиПоНаименованию("бит_Языки", Объект.ЯзыкОтчета));
	ПараметрыОтчета.Вставить("УдалитьПримечания", Ложь);
	ПараметрыОтчета.Вставить("ВалютаДокумента", ПредопределенноеЗначение("Справочник.Валюты.ПустаяСсылка"));
	ПараметрыОтчета.Вставить("КурсДокумента", 1);
	ПараметрыОтчета.Вставить("КратностьДокумента", 1);
	ПараметрыОтчета.Вставить("НастройкаПулаПодключений", ПредопределенноеЗначение("Справочник.бит_мпд_НастройкиПуловПодключений.ПустаяСсылка"));
	СтандПериод = Новый СтандартныйПериод;
	СтандПериод.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ПараметрыОтчета.Вставить("СтандартныйПериод", СтандПериод);
	
	// упакуем ТабличныйДокумент Результат
	//ТД = Новый ТабличныйДокумент;
	//ТД.ФиксацияСверху = Результат.ФиксацияСверху;
	//ТД.ФиксацияСлева  = Результат.ФиксацияСлева;
	//ТД.Вывести(Результат);
	
	ПараметрыОтчета.Вставить("ТабДокРезультат", Результат);
	
	// создадим параметры формы
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПараметрыОтчета", ПараметрыОтчета);
	
	ОткрытьФорму("Справочник.бит_ЭкземплярыОтчетов.ФормаОбъекта",ПараметрыФормы);
	
КонецПроцедуры // КнопкаСохранитьЭкземплярНажатие()

&НаСервереБезКонтекста
Функция Справочники_НайтиПоНаименованию(ИмяСправочника, Наименование)
	Возврат Справочники[ИмяСправочника].НайтиПоНаименованию(Наименование);
КонецФункции

//BIT Amerkulov ++ 25-08-2015
&НаКлиенте
Процедура ИмяExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогФыбораФайла.Каталог = ИмяExcel;
	ДиалогФыбораФайла.Фильтр="Файл шаблона Excel(*.xlsx)|*.xlsx|(*.xlsx)|*.xlsx";
	ДиалогФыбораФайла.Заголовок = "Выберите файл";
	Если ДиалогФыбораФайла.Выбрать() Тогда	
		ИмяExcel = ДиалогФыбораФайла.ПолноеИмяФайла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьВExcel(Команда)
	
	Отказ = Ложь;
	
	Если Не ЗначениеЗаполнено(Объект.НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ПериметрКонсолидации) Тогда
		Сообщить("Не заполнен периметр консолидации!");
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ИмяExcel) Тогда
		Сообщить("Укажите путь к сохраняемому файлу!");	
		Возврат;		
	КонецЕсли;
	
	ЭкспортExcel();

КонецПроцедуры

&НаКлиенте
Процедура ЭкспортExcel()
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Начало 2019-07-11 (#3387)	
	//ТабДок = СформироватьОтчетДляВыгрузки();
	СформироватьОтчет(Истина);
	Результат.Записать(ИмяExcel,ТипФайлаТабличногоДокумента.XLSX);
	// ОКЕЙ Чернов И.Е.(СофтЛаб) Конец 2019-07-11 (#3387)
	
	Попытка	
		Эксель = Новый COMОбъект("Excel.Application");
	Исключение
		Сообщить("Excel на данном компьютере не установлен");
		Возврат;
	КонецПопытки;
	
	Эксель.DisplayAlerts = 0; 	
	Книга = Эксель.WorkBooks.Open(ИмяExcel);
	Лист = Книга.WorkSheets(1);   

	ВсегоКолонок = Лист.Cells(1,1).SpecialCells(11).Column;
	ВсегоСтрок = Лист.Cells(1,1).SpecialCells(11).Row;      

	Для Строка = 1 По ВсегоСтрок Цикл   

		Для Колонка = 1 По ВсегоКолонок Цикл
			
			Попытка
				Лист.Cells(Строка,Колонка).NumberFormatLocal = "##0 ;(##0 )";
			Исключение
				
			КонецПопытки;
			
		КонецЦикла;       

	КонецЦикла;
	
	Попытка
		Книга.SaveAs(ИмяExcel);
	Исключение
		Сообщить(ОписаниеОшибки()+" Файл не сохранен!");
	КонецПопытки;
	
	Эксель.Application.Quit();
	
	
КонецПроцедуры

&НаСервере
Функция СформироватьОтчетДляВыгрузки()
	
	// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаКонечныеОстатки = СформироватьТаблицуКонечныеОстатки();
	//ТаблицаНачальныеОстатки = СформироватьТаблицуНачальныеОстатки();
	// -СБ. Кузнецова С.
	ТаблицаОбороты = СформироватьТаблицуОбороты();
	// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаСпецКонечныеОстатки = СформироватьТаблицуСпецифическиеКонечныеОстатки();
	// -СБ. Кузнецова С.
	
	ТаблДок = Результат;
	ТаблДок.Очистить();
	Макет =РеквизитФормыВЗначение("Объект").ПолучитьМакет("МакетБезФорматирования");
	ОбластьПерваяКолонка = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаПоказатели");
	ОбластьКолонкаОрганизация = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаОрганизации");
	ОбластьКолонкаИтоги = Макет.ПолучитьОбласть("ОбластьОтчета|КолонкаИтоги");
	
	// первая колонка
	
	// часть "ОФП"
	ОбластьПерваяКолонка.Параметры.ЗаголовокОтчета = ?(Объект.ЯзыкОтчета = "Русский", "Отчет по группе компаний", "Report on the group of companies");
	ОбластьПерваяКолонка.Параметры.ПериметрКонсолидации = ?(Объект.ЯзыкОтчета = "Русский", "Периметр консолидации: ", "Consolidation perimeter: ") + Объект.ПериметрКонсолидации;
	ОбластьПерваяКолонка.Параметры.Период = ?(Объект.ЯзыкОтчета = "Русский", "Период: ", "Period: ") + ПолучитьНадписьПериода();
	ОбластьПерваяКолонка.Параметры.ТысячиРублей = ?(Объект.ЯзыкОтчета = "Русский", "В тыс. руб", "In thousand RUR");	
	
	ОбластьПерваяКолонка.Параметры.ЗаголовокТаблицы = ?(Объект.ЯзыкОтчета = "Русский", "Статья консолидированной отчетности", "Consolidated FS");
	ОбластьПерваяКолонка.Параметры.Активы = ?(Объект.ЯзыкОтчета = "Русский", "АКТИВЫ", "ASSETS");
	ОбластьПерваяКолонка.Параметры.ВнеоборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Внеоборотные активы", "Noncurrent assets");
	ОбластьПерваяКолонка.Параметры.ИнвестСобственность = ?(Объект.ЯзыкОтчета = "Русский", "Инвестиционная собственность", "Investment property");
	ОбластьПерваяКолонка.Параметры.ЗемляВИС = ?(Объект.ЯзыкОтчета = "Русский", "Земля в инвестиционной собственности", "Land IP");
	ОбластьПерваяКолонка.Параметры.ЗданияВИС = ?(Объект.ЯзыкОтчета = "Русский", "Здания в инвестиционной собственности", "Buildings IP");
	ОбластьПерваяКолонка.Параметры.ОС = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства", "Property, plant and equipment");
	ОбластьПерваяКолонка.Параметры.Земля = ?(Объект.ЯзыкОтчета = "Русский", "Земля", "Land");
	ОбластьПерваяКолонка.Параметры.Здания = ?(Объект.ЯзыкОтчета = "Русский", "Здания", "Buildings");
	ОбластьПерваяКолонка.Параметры.ХолодильноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Холодильное оборудование", "Refrigerating equipment");
	ОбластьПерваяКолонка.Параметры.ТехнологическоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Технологическое оборудование", "Production equipment");
	ОбластьПерваяКолонка.Параметры.СухоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Сухое оборудование", "Dry equipment");
	ОбластьПерваяКолонка.Параметры.СкладскоеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Складское оборудование", "Warehouse equipment");
	ОбластьПерваяКолонка.Параметры.ОхранноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Охранное оборудование", "Security equipment");
	ОбластьПерваяКолонка.Параметры.РекламноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Рекламное оборудование", "Advertising equipment");
	ОбластьПерваяКолонка.Параметры.ITОборудование = ?(Объект.ЯзыкОтчета = "Русский", "IT оборудование", "IT equipment");
	ОбластьПерваяКолонка.Параметры.ИнженерноеОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Инженерное оборудование", "Engineering equipment");
	ОбластьПерваяКолонка.Параметры.ПрочееОборудование = ?(Объект.ЯзыкОтчета = "Русский", "Прочее оборудование", "Other fixed assets");
	ОбластьПерваяКолонка.Параметры.ОСдо40тсч = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства до 40 тыс. руб.", "FA less than 40 RUB thousands");
	ОбластьПерваяКолонка.Параметры.НеотделимыеУлучшения = ?(Объект.ЯзыкОтчета = "Русский", "Неотделимые улучшения ", "Leasehold improvements");
	ОбластьПерваяКолонка.Параметры.Транспорт = ?(Объект.ЯзыкОтчета = "Русский", "Транспорт", "Vehicles");
	ОбластьПерваяКолонка.Параметры.Сооружения = ?(Объект.ЯзыкОтчета = "Русский", "Сооружения", "Constructions");
	ОбластьПерваяКолонка.Параметры.ОСдляПродажи = ?(Объект.ЯзыкОтчета = "Русский", "ОС, предназначенные для продажи", "FA available for sale");
	ОбластьПерваяКолонка.Параметры.НЗС = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство", "Construction in progress");
	ОбластьПерваяКолонка.Параметры.НЗСземля = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - земля", "CIP - land");
	ОбластьПерваяКолонка.Параметры.НЗСздания = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - здания", "CIP - buildings");
	ОбластьПерваяКолонка.Параметры.НЗСоборудование = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное строительство - оборудование", "CIP - machinery and equipment");
	//БИТ АКриштопов 10022016 -->>
	ОбластьПерваяКолонка.Параметры.ОСВПути = ?(Объект.ЯзыкОтчета = "Русский", "Основные средства в пути", "Fixed assets in the way");
	//БИТ АКриштопов 10022016 <<--
	ОбластьПерваяКолонка.Параметры.Гудвил = ?(Объект.ЯзыкОтчета = "Русский", "Гудвилл", "Goodwill");
    // ок Видяйкин В. 20170313 (добавил по аналогии с: +СБ Кузнецова С. 2016-12-09 Redmine 2747)  +
    ОбластьПерваяКолонка.Параметры.ПраваАренды = ?(Объект.ЯзыкОтчета = "Русский", "Права аренды", "Leasehold rights");
    // ок Видяйкин В. 20170313 –
	ОбластьПерваяКолонка.Параметры.НМА = ?(Объект.ЯзыкОтчета = "Русский", "Нематериальные активы", "Intangible assets");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные инвестиции", "Long-term investments");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеИнвестицииВПаиИАкции = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные инвестиции в паи и акции компаний", "Investments in other companies");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеЗаймыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные займы выданные", "Long-term loans issued");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеДолговыеЦБ = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные долговые ценные бумаги", "Long-term bonds");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные инвестиции", "Other long-term investments");
	ОбластьПерваяКолонка.Параметры.ОтложенныеНалоговыеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Отложенные налоговые активы", "Deferred income tax asset");
	ОбластьПерваяКолонка.Параметры.ПрочиеВА = ?(Объект.ЯзыкОтчета = "Русский", "Прочие внеоборотные активы", "Other non-current assets");
	ОбластьПерваяКолонка.Параметры.ДолгосрочнаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочная дебиторская задолженность", "Other non-current receivables");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоОСиНМА = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по ОС и НМА", "Prepayments for PPE and IA");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоАренде = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по аренде (долгосрочные депозиты)", "Prepayments for rent (long-term deposits)");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеАвансыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные авансы выданные", "Other non-current advances issued");
	// +СБ Кузнецова С. 2016-12-09 Redmine 2747
	//ОбластьПерваяКолонка.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Первоначальная стоимость затрат по договорам аренды земли", "Initial cost of land lease");
	// -СБ Кузнецова С.
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные активы", "Other non-current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоВА = ?(Объект.ЯзыкОтчета = "Русский", "Итого внеоборотных активов", "Total non-current assets");

	ОбластьПерваяКолонка.Параметры.ОборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Оборотные активы", "Current assets");
	ОбластьПерваяКолонка.Параметры.Запасы = ?(Объект.ЯзыкОтчета = "Русский", "Запасы", "Inventories");
	ОбластьПерваяКолонка.Параметры.СырьеИМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Сырье и материалы", "Raw materials and other inventory");
	ОбластьПерваяКолонка.Параметры.НЗП = ?(Объект.ЯзыкОтчета = "Русский", "Незавершенное производство", "WIP");
	ОбластьПерваяКолонка.Параметры.ГотоваяПродукция = ?(Объект.ЯзыкОтчета = "Русский", "Готовая продукция и товары для перепродажи", "Finished goods and goods for resale");
	ОбластьПерваяКолонка.Параметры.ТоварыВПути = ?(Объект.ЯзыкОтчета = "Русский", "Товары в пути", "Goods in transit");
	ОбластьПерваяКолонка.Параметры.ИзменениеСтоимостиЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Изменение стоимости запасов", "Change of inventory cost");
	ОбластьПерваяКолонка.Параметры.КраткосрочнаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочная дебиторская задолженность", "Trade and other receivables");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПокупателейИЗаказчиков = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность покупателей и заказчиков", "Trade receivables");
	ОбластьПерваяКолонка.Параметры.НДСкВозмещению = ?(Объект.ЯзыкОтчета = "Русский", "НДС к возмещению", "VAT recoverable");
	ОбластьПерваяКолонка.Параметры.ПредоплатыВыданныеТекущие = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты выданные текущие", "Prepayments (related to ordinary activities)");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПоНалогам = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты по налогам", "Taxes prepaid");
	ОбластьПерваяКолонка.Параметры.ПрочаяДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прочая дебиторская задолженность (без бонусов от поставщиков)", "Other receivables");
	//БИТ АКриштопов 10022016 -->>
	ОбластьПерваяКолонка.Параметры.БонусыПолученныеОтПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Бонусы, полученные от поставщиков", "Bonuses received from suppliers");
	//БИТ АКриштопов 10022016 <<--
	ОбластьПерваяКолонка.Параметры.РезервПоСомнительнымДолгам = ?(Объект.ЯзыкОтчета = "Русский", "Резерв по сомнительным долгам", "less: provision for doubtful debts");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеФинансовыеВложения = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные финансовые вложения", "Short-term financial investments");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеЗаймыВыданные = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные займы выданные", "Short-term loans issued");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеДолговыеЦБ = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные долговые ценные бумаги", "Short-term bonds ");
	ОбластьПерваяКолонка.Параметры.ПрочиеКраткосрочныеИнвестиции = ?(Объект.ЯзыкОтчета = "Русский", "Прочие краткосрочные инвестиции", "Other short-term investments");
	ОбластьПерваяКолонка.Параметры.ДСиЭквиваленты = ?(Объект.ЯзыкОтчета = "Русский", "Денежные средства и эквиваленты", "Cash and cash equivalents");
	ОбластьПерваяКолонка.Параметры.Касса = ?(Объект.ЯзыкОтчета = "Русский", "Касса", "Petty cash");
	ОбластьПерваяКолонка.Параметры.РасчетныйСчет = ?(Объект.ЯзыкОтчета = "Русский", "Расчетный счет", "Bank account");
	ОбластьПерваяКолонка.Параметры.ВалютныйСчет = ?(Объект.ЯзыкОтчета = "Русский", "Валютный счет", "Currency account");
	ОбластьПерваяКолонка.Параметры.СпецСчетаВБанках = ?(Объект.ЯзыкОтчета = "Русский", "Специальные счета в банках", "Special bank accounts");
	// +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
	ОбластьПерваяКолонка.Параметры.СпецСчетаВБанкахВВалюте = ?(Объект.ЯзыкОтчета = "Русский", "Специальные счета в банках (в валюте)", "Special bank accounts (in foreign currency)");
	// -СБ Кузнецова С.
	ОбластьПерваяКолонка.Параметры.ДСвПути = ?(Объект.ЯзыкОтчета = "Русский", "Денежные средства в пути", "Cash in transit");
	ОбластьПерваяКолонка.Параметры.ПрочиеОборотныеАктивы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие оборотные активы", "Other current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоОборотныхАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Итого оборотных активов", "Total current assets");
	ОбластьПерваяКолонка.Параметры.ИтогоАктивов = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО АКТИВОВ", "TOTAL ASSETS");

	ОбластьПерваяКолонка.Параметры.СобственныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Собственный капитал", "EQUITY");
	ОбластьПерваяКолонка.Параметры.АкционерныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Акционерный капитал", "Share capital");
	ОбластьПерваяКолонка.Параметры.ЭмиссионныйДоход = ?(Объект.ЯзыкОтчета = "Русский", "Эмиссионный доход", "Share premium");
	ОбластьПерваяКолонка.Параметры.СобственныеВыкупленныеАкции = ?(Объект.ЯзыкОтчета = "Русский", "Собственные выкупленные акции", "Treasury shares");
	ОбластьПерваяКолонка.Параметры.РезервыПоЗаконодательству = ?(Объект.ЯзыкОтчета = "Русский", "Резервы, создаваемые согласно с законодательством", "Legal reserve");
	ОбластьПерваяКолонка.Параметры.ДобавочныйКапитал = ?(Объект.ЯзыкОтчета = "Русский", "Добавочный капитал", "Additional paid-in capital");
	ОбластьПерваяКолонка.Параметры.НераспределеннаяПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Нераспределенная прибыль", "Retained earnings");
	ОбластьПерваяКолонка.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет = ?(Объект.ЯзыкОтчета = "Русский", "Нераспределенная прибыль (убыток) прошлых лет", "Retained earnings - opening balance");
	ОбластьПерваяКолонка.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет = ?(Объект.ЯзыкОтчета = "Русский", "Корректировка нераспределенной прибыли (убытка) прошлых лет", "Adjustment to RE opening balance");
	ОбластьПерваяКолонка.Параметры.ПрибыльЗаГод = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль за год", "Retained earnings - current year profit");
	ОбластьПерваяКолонка.Параметры.РаспределениеАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Распределение активов", "Distributions to shareholders");
	ОбластьПерваяКолонка.Параметры.ОбъявленныеДивиденды = ?(Объект.ЯзыкОтчета = "Русский", "Объявленные дивиденды", "Dividends paid");
	ОбластьПерваяКолонка.Параметры.ДивидендыЗаПредыдущийПериод = ?(Объект.ЯзыкОтчета = "Русский", "Дивиденды за предыдущий период", "Dividends for the previous period");
	ОбластьПерваяКолонка.Параметры.ДивидендыЗаТекущийПериод = ?(Объект.ЯзыкОтчета = "Русский", "Дивиденды за текущий период ", "Dividends for the current period");
	ОбластьПерваяКолонка.Параметры.ПрочиеРезервы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие резервы", "Other reserves");
	ОбластьПерваяКолонка.Параметры.ТрансляционнаяРазница = ?(Объект.ЯзыкОтчета = "Русский", "Трансляционная разница", "Translation difference");
	ОбластьПерваяКолонка.Параметры.КапиталИРезервыНаАкционеров = ?(Объект.ЯзыкОтчета = "Русский", "Капитал и резервы, приходящиеся на акционеров", "Equity attributable to the Company’s equity holders");
	ОбластьПерваяКолонка.Параметры.ДоляНеконтролирующихАкционеров = ?(Объект.ЯзыкОтчета = "Русский", "Доля неконтролирующих акционеров", "Minority interest");
	ОбластьПерваяКолонка.Параметры.ИтогоСобственногоКапитала = ?(Объект.ЯзыкОтчета = "Русский", "Итого собственного капитала", "TOTAL EQUITY");

	ОбластьПерваяКолонка.Параметры.Обязательства = ?(Объект.ЯзыкОтчета = "Русский", "Обязательства", "LIABILITIES");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Долгосрочные обязательства", "Non-current liabilities");
	ОбластьПерваяКолонка.Параметры.ДолгосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Кредиты и займы", "Borrowings");
	ОбластьПерваяКолонка.Параметры.ОНО = ?(Объект.ЯзыкОтчета = "Русский", "Отложенные налоговые обязательства", "Deferred income tax liability");
	ОбластьПерваяКолонка.Параметры.ДБП = ?(Объект.ЯзыкОтчета = "Русский", "Доходы будущих периодов", "Deferred income");
	ОбластьПерваяКолонка.Параметры.ПрочиеДолгосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Прочие долгосрочные обязательства", "Other non-current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоДолгосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Итого долгосрочных обязательств", "Total non-current liabilities");

	ОбластьПерваяКолонка.Параметры.КраткосрочныеОбязательства = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные обязательства", "Current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоКраткосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Кредиты и займы", "Borrowings");
	ОбластьПерваяКолонка.Параметры.КраткосрочныеКредитыИЗаймы = ?(Объект.ЯзыкОтчета = "Русский", "Краткосрочные кредиты и займы", "Short-term borrowings");
	ОбластьПерваяКолонка.Параметры.ТекущаяДоляДолгосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Текущая доля долгосрочных обязательств", "Short-term portion of long-term borrowings");
	ОбластьПерваяКолонка.Параметры.ТорговаяИПрочаяКЗ = ?(Объект.ЯзыкОтчета = "Русский", "Торговая и прочая кредиторская задолженность", "Trade and other payables");
	ОбластьПерваяКолонка.Параметры.КЗинвестиционная = ?(Объект.ЯзыкОтчета = "Русский", "КЗ инвестиционная", "Trade payables (related to construction and acquisition of PP&E)");
	ОбластьПерваяКолонка.Параметры.КЗоперационная = ?(Объект.ЯзыкОтчета = "Русский", "КЗ операционная", "Trade payables (related to ordinary activities)");
	ОбластьПерваяКолонка.Параметры.ПредоплатыПолученные = ?(Объект.ЯзыкОтчета = "Русский", "Предоплаты полученные", "Advances received");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПоНалогам = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность по налогам", "Taxes payable (other than Income tax)");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПередПерсоналом = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность перед персоналом", "Payables to staff");
	ОбластьПерваяКолонка.Параметры.ПрочаяКЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прочая кредиторская задолженность", "Other current payables");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
	//ОбластьПерваяКолонка.Параметры.ЦелевоеФинансирование = ?(Объект.ЯзыкОтчета = "Русский", "Целевое финансирование", "Special purpose financing");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПоНалогуНаПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность по налогу на прибыль", "Current income tax payable");
	ОбластьПерваяКолонка.Параметры.ЗадолженностьПередУчредителями = ?(Объект.ЯзыкОтчета = "Русский", "Задолженность перед учредителями", "Liabilities to the founders");
	ОбластьПерваяКолонка.Параметры.ИтогоКраткосрочныхОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Итого краткосрочных обязательств", "Total current liabilities");
	ОбластьПерваяКолонка.Параметры.ИтогоОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО ОБЯЗАТЕЛЬСТВ", "TOTAL LIABILITIES");
	ОбластьПерваяКолонка.Параметры.ИтогоОбязательствИКапитала = ?(Объект.ЯзыкОтчета = "Русский", "ИТОГО ОБЯЗАТЕЛЬСТВ И СОБСТВЕННОГО КАПИТАЛА", "TOTAL LIABILITIES AND EQUITY");

	ОбластьПерваяКолонка.Параметры.ДельтаАктивовИОбязательств = ?(Объект.ЯзыкОтчета = "Русский", "Дельта (Итого Активы-Итого обязательств и собственного капитала)", "Difference (TOTAL ASSETS-TOTAL LIABILITIES AND EQUITY)");
	
	// часть "ОСД"
	ОбластьПерваяКолонка.Параметры.Выручка = ?(Объект.ЯзыкОтчета = "Русский", "Выручка", "Revenue");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации товаров", "Revenue from sales of goods");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииПродукцииОбщепита = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации продукции общественного питания", "Revenue from sales of own-produced goods");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАренды = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды", "Rental revenue");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды земли", "Rental revenue (land)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды оборудования", "Rental revenue (equipment)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды помещений", "Rental revenue (premises)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды площадей под банкоматы", "Rental revenue (ATM)");
	ОбластьПерваяКолонка.Параметры.ПрочиеДоходыОтАренды = ?(Объект.ЯзыкОтчета = "Русский", "Прочие доходы от аренды", "Rental revenue (other)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтРекламныхУслуг = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от рекламных услуг", "Revenue from advertising services");
	ОбластьПерваяКолонка.Параметры.ДоходыОтАрендыРекламныхПлощадей = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от аренды рекламных площадей", "Rental revenue (advertising premises)");
	ОбластьПерваяКолонка.Параметры.ДоходыОтПрочихРекламныхУслуг = ?(Объект.ЯзыкОтчета = "Русский", "Доходы от прочих рекламных услуг", "Revenue from other advertising services");

	ОбластьПерваяКолонка.Параметры.СебестоимостьПродаж = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость продаж", "Cost of sales");
	ОбластьПерваяКолонка.Параметры.СебестоимостьРеализацииТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость реализации товаров", "Cost of sales of goods");
	ОбластьПерваяКолонка.Параметры.СебестоимостьРеализацииПродукцииОбщепита = ?(Объект.ЯзыкОтчета = "Русский", "Себестоимость реализации продукции общественного питания", "Cost of sales of own-produced goods");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков", "Less of any bonuses from suppliers");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковРетро = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (ретро)", "Bonuses from suppliers (retro)");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковПромо = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (промо)", "Bonuses from suppliers (promo)");
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковАдм = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (административные)", "Bonuses from suppliers (administrative)");
	//СофтЛаб Начало 2018-09-09 3074
	ОбластьПерваяКолонка.Параметры.ПремииПоставщиковРекламныеУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Премии поставщиков (рекламные услуги)", "Bonuses from suppliers (advertising services)");
	//СофтЛаб Конец 2018-09-09 3074
	ОбластьПерваяКолонка.Параметры.ДоходОтЛогистики = ?(Объект.ЯзыкОтчета = "Русский", "Доход от логистических услуг", "Revenue from logistic services");
	ОбластьПерваяКолонка.Параметры.ШтрафыПоставщиков = ?(Объект.ЯзыкОтчета = "Русский", "Штрафы поставщиков", "Penalties from suppliers");
	ОбластьПерваяКолонка.Параметры.ЗатратыЛогистики = ?(Объект.ЯзыкОтчета = "Русский", "Затраты логистики", "Transportation and logistics costs");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаОбработкуТоваровВнеш = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на обработку товаров (внешние)", "Processing cost of goods (external)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаОбработкуТоваровВнутр = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на обработку товаров (внутренние)", "Processing cost of goods (internal)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаДоставку = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на доставку", "Transportation costs");
	ОбластьПерваяКолонка.Параметры.ПрочиеЗатратыНаЛогистику = ?(Объект.ЯзыкОтчета = "Русский", "Прочие затраты на логистику", "Other logistic costs");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаТаможенныеУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на таможенные услуги", "Custom services");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаТаможенныеПлатежи = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на таможенные платежи", "Custom payments");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаХранениеТоваров = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на хранение товара", "Cost of lease of warehouses (for goods)");
	ОбластьПерваяКолонка.Параметры.КомпенсацияЛогистическихЗатрат = ?(Объект.ЯзыкОтчета = "Русский", "Компенсация логистических затрат", "Logistic bonuses");
	ОбластьПерваяКолонка.Параметры.СтоимостьЛогистикиДляМагазинов = ?(Объект.ЯзыкОтчета = "Русский", "Стоимость логистики для магазинов", "Cost of logistics for stores");
	ОбластьПерваяКолонка.Параметры.РасходникиДляТорговогоПроцесса = ?(Объект.ЯзыкОтчета = "Русский", "Расходники для торгового процесса", "Packing and labeling costs");
	ОбластьПерваяКолонка.Параметры.ЗащитныеМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Защитные материалы", "Protective materials");
	ОбластьПерваяКолонка.Параметры.Упаковка = ?(Объект.ЯзыкОтчета = "Русский", "Упаковка", "Packaging");
	ОбластьПерваяКолонка.Параметры.ЭлементыЦенников = ?(Объект.ЯзыкОтчета = "Русский", "Элементы ценников", "Elements of price labels");
	ОбластьПерваяКолонка.Параметры.ПотериТовара = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара", "Less inventory shortages provision");
	ОбластьПерваяКолонка.Параметры.ПотериТовараИнв = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара - Инвентаризация", "Finish good shortage - stock - takes");
	ОбластьПерваяКолонка.Параметры.ПотериТовараСпис = ?(Объект.ЯзыкОтчета = "Русский", "Потери товара - Списания", "Finish good shortage - write offs");
	ОбластьПерваяКолонка.Параметры.РезервПодСнижениеСтоимостиЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Резерв под снижение стоимости запасов (товарных)", "(Less provision for obsolete stock)");
	ОбластьПерваяКолонка.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации = ?(Объект.ЯзыкОтчета = "Русский", "Корректировка себестоимости по обратной реализации", "(Adjustment cost of implementation of reverse)");
	ОбластьПерваяКолонка.Параметры.ВаловаяПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Валовая прибыль", "Gross profit");

	ОбластьПерваяКолонка.Параметры.ОбщехозКомАдмРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Общехозяйственные, коммерческие и административные расходы", "General, selling and administrative expenses");
	ОбластьПерваяКолонка.Параметры.РасходыНаОплатуТруда = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на оплату труда", "Labour costs");
	ОбластьПерваяКолонка.Параметры.ФОТ = ?(Объект.ЯзыкОтчета = "Русский", "ФОТ", "Payroll");
	ОбластьПерваяКолонка.Параметры.СтраховыеВзносы = ?(Объект.ЯзыкОтчета = "Русский", "Страховые взносы с ФОТ", "Insurance fee from payroll");
	ОбластьПерваяКолонка.Параметры.Пособия = ?(Объект.ЯзыкОтчета = "Русский", "Пособия", "Material aid");
	ОбластьПерваяКолонка.Параметры.ПремированиеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Премирование сотрудников", "Bonuses");
	ОбластьПерваяКолонка.Параметры.СтрахованиеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Страхование сотрудников", "Voluntary medical insurance");
	ОбластьПерваяКолонка.Параметры.ПитаниеСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Питание сотрудников", "Meal compensations");
	ОбластьПерваяКолонка.Параметры.МедосмотрСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Медосмотр сотрудников", "Medical inspection");
	ОбластьПерваяКолонка.Параметры.ОрганизацияКорпМероприятий = ?(Объект.ЯзыкОтчета = "Русский", "Организация корпоративных мероприятий", "Corporate activities");
	ОбластьПерваяКолонка.Параметры.Аутсорсинг = ?(Объект.ЯзыкОтчета = "Русский", "Аутсорсинг", "Outsourcing");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаСотрудников = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на сотрудников", "Other staff costs");
	ОбластьПерваяКолонка.Параметры.КомандировочныеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Командировочные расходы", "Travel costs");
	ОбластьПерваяКолонка.Параметры.ОбучениеПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Обучение персонала", "Trainings and seminars");
	ОбластьПерваяКолонка.Параметры.СпецОбучениеПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Обучение персонала (специальное обучение)", "Trainings and seminars (special)");
	ОбластьПерваяКолонка.Параметры.ПоискПерсонала = ?(Объект.ЯзыкОтчета = "Русский", "Поиск персонала", "Recruiting");
	ОбластьПерваяКолонка.Параметры.АрендаКвартир = ?(Объект.ЯзыкОтчета = "Русский", "Аренда квартир", "Rent of apartments");
	//СофтЛаб Начало 2019-06-20 #3383
	ОбластьПерваяКолонка.Параметры.АрендаКвартирСотрудникам = ?(Объект.ЯзыкОтчета = "Русский", "Аренда квартир сотрудникам", "Rent of staff apartments");
	//СофтЛаб Конец 2019-06-20 #3383
	ОбластьПерваяКолонка.Параметры.ВыплатаНаОсновеАкций = ?(Объект.ЯзыкОтчета = "Русский", "Выплата на основе акций", "Yield on shares");

	ОбластьПерваяКолонка.Параметры.АмортизацияОСиНМА = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС и НМА", "Depreciation and amortization");
	ОбластьПерваяКолонка.Параметры.АмортизацияОС = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС", "Depreciation of PP&E");
	ОбластьПерваяКолонка.Параметры.АмортизацияОСдо40тсч = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ОС до 40 тыс. руб.", "Depreciation of low-valued PPE (less than 40k)");
	ОбластьПерваяКолонка.Параметры.АмортизацияНМА = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация НМА", "Amortization of Intangible assets");
	ОбластьПерваяКолонка.Параметры.АмортизацияICLL = ?(Объект.ЯзыкОтчета = "Русский", "Амортизация ICLL", "Depreciation of ICLL");

	ОбластьПерваяКолонка.Параметры.РасходыНаРекламу = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на рекламу и маркетинг", "Advertising and marketing");
	ОбластьПерваяКолонка.Параметры.ВнутрОформление = ?(Объект.ЯзыкОтчета = "Русский", "Внутреннее оформление помещений", "Internal design of stores for advertising purposes");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//ОбластьПерваяКолонка.Параметры.ЗатратыНаПромоакции = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию промоакций", "Organisation of promotion actions");
	//ОбластьПерваяКолонка.Параметры.Листовки = ?(Объект.ЯзыкОтчета = "Русский", "Листовки и др. печатные материалы", "Leaflets and other printed materials");
	//ОбластьПерваяКолонка.Параметры.ВнешРеклама = ?(Объект.ЯзыкОтчета = "Русский", "Внешняя реклама (ATL)", "Outdoor advertising (ATL)");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаПромоакции 	= ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию федеральных промоакций", "Organisation of federal promotion actions");
	ОбластьПерваяКолонка.Параметры.Листовки 			= ?(Объект.ЯзыкОтчета = "Русский", "Каталог, листовки (дизайн, печать)", "Catalogues and leaflets (design and printing)");
	ОбластьПерваяКолонка.Параметры.ВнешРеклама 			= ?(Объект.ЯзыкОтчета = "Русский", "Внешняя реклама (ООН)", "Outdoor advertising (OOH)");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
	ОбластьПерваяКолонка.Параметры.ТОреклОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО рекламного оборудования", "Maintenance of advertising tools");
	ОбластьПерваяКолонка.Параметры.PRактивность = ?(Объект.ЯзыкОтчета = "Русский", "PR активность", "PR activities");
	ОбластьПерваяКолонка.Параметры.МаркетинговыеИсследования = ?(Объект.ЯзыкОтчета = "Русский", "Маркетинговые исследования", "Marketing researches");
	ОбластьПерваяКолонка.Параметры.ПоддержкаБренда = ?(Объект.ЯзыкОтчета = "Русский", "Поддержка бренда", "Brand support");
	ОбластьПерваяКолонка.Параметры.ПрограммаЛояльности = ?(Объект.ЯзыкОтчета = "Русский", "Программа лояльности", "Loyalty program");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
	//ОбластьПерваяКолонка.Параметры.РекламаИНавигация = ?(Объект.ЯзыкОтчета = "Русский", "Реклама и навигация в ТРК (использовать с 2014 г.)", "Advertising and navigation in TEC");
	ОбластьПерваяКолонка.Параметры.РекламаИНавигация 			= ?(Объект.ЯзыкОтчета = "Русский", "Реклама и навигация в ТРК", "In-store advertising and navigation");
	ОбластьПерваяКолонка.Параметры.ИнтернетРекламаСМИ 			= ?(Объект.ЯзыкОтчета = "Русский", "Интернет-реклама и СМИ", "Digital advertising and media");
	ОбластьПерваяКолонка.Параметры.ЛистовкиАудитРаспространение = ?(Объект.ЯзыкОтчета = "Русский", "Каталог, листовки (аудит, распространение)", "Catalogues and leaflets (audit and distribution)");
	ОбластьПерваяКолонка.Параметры.СМСViber 					= ?(Объект.ЯзыкОтчета = "Русский", "СМС, Viber, e-mail", "SMS, Viber, e-mail");
	ОбластьПерваяКолонка.Параметры.РегиональныеПромоакции 		= ?(Объект.ЯзыкОтчета = "Русский", "Затраты на организацию региональных промоакций", "Organisation of regional promotion actions");
	ОбластьПерваяКолонка.Параметры.Видеореклама 				= ?(Объект.ЯзыкОтчета = "Русский", "Видеореклама", "Video advertising");
	ОбластьПерваяКолонка.Параметры.Радиореклама 				= ?(Объект.ЯзыкОтчета = "Русский", "Радиореклама", "Radio advertising");
	ОбластьПерваяКолонка.Параметры.ИнтернетРекламаECom 			= ?(Объект.ЯзыкОтчета = "Русский", "Интернет-реклама E-com", "Digital advertising E-commerce");
	ОбластьПерваяКолонка.Параметры.ПоддержкаБрендаСТМ 			= ?(Объект.ЯзыкОтчета = "Русский", "Поддержка бренда СТМ", "Brand support of private label");
	//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)	
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.Мониторинг = ?(Объект.ЯзыкОтчета = "Русский", "Мониторинг", "Monitoring");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыМаркетинга = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы маркетинга", "Other marketing costs");

	ОбластьПерваяКолонка.Параметры.ОперАренда = ?(Объект.ЯзыкОтчета = "Русский", "Операционная аренда", "Operating leases");
	ОбластьПерваяКолонка.Параметры.АрендаЗемли = ?(Объект.ЯзыкОтчета = "Русский", "Аренда земли", "Cost of lease of land");
	ОбластьПерваяКолонка.Параметры.АрендаТоргПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Аренда торговых помещений (фиксированная часть)", "Cost of lease of trade premises (fixed)");
	ОбластьПерваяКолонка.Параметры.АрендаОфиса = ?(Объект.ЯзыкОтчета = "Русский", "Аренда офиса", "Cost of lease of office");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаАрендуСклада = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на аренду склада (кроме складов для товара)", "Cost of lease of warehouses (other than for goods)");
	ОбластьПерваяКолонка.Параметры.ПрочаяАренда = ?(Объект.ЯзыкОтчета = "Русский", "Прочая аренда", "Cost of other lease");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаРемонтИОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на ремонт и обслуживание", "Repairs and maintenance costs");
	ОбластьПерваяКолонка.Параметры.ОбслуживаниеЗданийПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Обслуживание зданий и помещений", "Maintenance of buildings");
	ОбластьПерваяКолонка.Параметры.РемонтЗданийПомещений = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт зданий и помещений", "Repair of buildings");
	ОбластьПерваяКолонка.Параметры.РемонтИОбслуживаниеТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт и обслуживание территории", "R&M: territory");
	ОбластьПерваяКолонка.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт и содержание оборудования для обслуживания покупателей", "R&M of equipment for customer's servicing");
	ОбластьПерваяКолонка.Параметры.ТОавтотранспорта = ?(Объект.ЯзыкОтчета = "Русский", "ТО автотранспорта", "Maintenance of vehicles");
	ОбластьПерваяКолонка.Параметры.ТОинженерногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО инженерного оборудования (регулярное)", "Maintenance of engineering equipment (regular)");
	ОбластьПерваяКолонка.Параметры.ТОкулинарногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО кулинарного оборудования", "Maintenance of culinary equipment");
	ОбластьПерваяКолонка.Параметры.ОбслуживаниеОфисногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Обслуживание офисного оборудования", "Maintenance of office equipment");
	ОбластьПерваяКолонка.Параметры.ТОохранногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО охранного оборудования", "Maintenance of security equipment");
	ОбластьПерваяКолонка.Параметры.ТОскладскогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО складского оборудования", "Maintenance of warehouse equipment");
	ОбластьПерваяКолонка.Параметры.ТОсухогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО сухого оборудования", "Maintenance of dry equipment");
	ОбластьПерваяКолонка.Параметры.ТОхолодильногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "ТО холодильного оборудования", "Maintenance of cooling equipment");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияЭКЛЗ = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: ЭКЛЗ", "Maintenance of electronic equipment: ЭКЛЗ");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияЕжемесячное = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: ежемесячное", "Maintenance of electronic equipment: monthly");
	ОбластьПерваяКолонка.Параметры.ТОэлектронногоОборудованияПлановое = ?(Объект.ЯзыкОтчета = "Русский", "ТО электронного оборудования: плановое", "Maintenance of electronic equipment: planned");
	ОбластьПерваяКолонка.Параметры.ТОпрочихОСиИнвентаря = ?(Объект.ЯзыкОтчета = "Русский", "ТО прочих ОС и инвентаря", "Maintenance of other FA and inventory");
	ОбластьПерваяКолонка.Параметры.РемонтИнженерногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт инженерного оборудования", "Repairs of engineering equipment");
	ОбластьПерваяКолонка.Параметры.РемонтКулинарногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт кулинарного оборудования", "Repairs of culinary equipment");
	ОбластьПерваяКолонка.Параметры.РемонтСкладскогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт складского оборудования", "Repairs of warehouse equipment");
	ОбластьПерваяКолонка.Параметры.РемонтСухогоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт сухого оборудования", "Repairs of dry equipment");
	ОбластьПерваяКолонка.Параметры.РемонтХолодильногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт холодильного оборудования", "Repairs of cooling equipment");
	ОбластьПерваяКолонка.Параметры.РемонтЭлектронногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт электронного оборудования", "Repairs of electronic equipment");
	ОбластьПерваяКолонка.Параметры.РемонтОхранногоОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт охранного оборудования", "Repairs of security equipment");
	ОбластьПерваяКолонка.Параметры.РемонтПрочихОСиИнвентаря = ?(Объект.ЯзыкОтчета = "Русский", "Ремонт прочих ОС и инвентаря", "Repairs of other FA and inventory");
	ОбластьПерваяКолонка.Параметры.ПрочийРемонт = ?(Объект.ЯзыкОтчета = "Русский", "Прочий ремонт (стройматериалы)", "Other repairs - construction materials");
	ОбластьПерваяКолонка.Параметры.ОзеленениеТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Озеленение территории", "Landscape gardening");
	ОбластьПерваяКолонка.Параметры.СодержаниеШатров = ?(Объект.ЯзыкОтчета = "Русский", "Содержание шатров", "Maintenance of tents");

	ОбластьПерваяКолонка.Параметры.КоммУслугиИСвязь = ?(Объект.ЯзыкОтчета = "Русский", "Коммунальные услуги и связь", "Communication and utilities");
	ОбластьПерваяКолонка.Параметры.Водоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Водоснабжение", "Water supply");
	ОбластьПерваяКолонка.Параметры.Газоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Газоснабжение", "Gas supply");
	ОбластьПерваяКолонка.Параметры.Теплоснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Теплоснабжение", "Heat supply");
	ОбластьПерваяКолонка.Параметры.Электроснабжение = ?(Объект.ЯзыкОтчета = "Русский", "Электроснабжение", "Power supply");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (топливо)", "Running diesel generators (fuel)");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (услуги)", "Running diesel generators (services)");
	ОбластьПерваяКолонка.Параметры.РасходыНаСодержаниеДизельгенераторов = ?(Объект.ЯзыкОтчета = "Русский", "Расходы на содержание дизельгенераторов (использовать с 2016г.)", "Running diesel generators");
	ОбластьПерваяКолонка.Параметры.ПрочиеКоммРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие коммунальные расходы", "Other utilities");
	ОбластьПерваяКолонка.Параметры.ВывозМусора = ?(Объект.ЯзыкОтчета = "Русский", "Вывоз мусора", "Utilisation of wastes");
	ОбластьПерваяКолонка.Параметры.ВыручкаОтРеализацииВторсырья = ?(Объект.ЯзыкОтчета = "Русский", "Выручка от реализации вторсырья", "Revenue from sales of recyclable materials");
	ОбластьПерваяКолонка.Параметры.ДератизацияДезинфекция = ?(Объект.ЯзыкОтчета = "Русский", "Дератизация и дезинфекция", "Deratization and dezinfection");
	ОбластьПерваяКолонка.Параметры.ОчисткаЖиропескоуловителей = ?(Объект.ЯзыкОтчета = "Русский", "Очистка жиропескоуловителей", "Filter for fat and sand");
	ОбластьПерваяКолонка.Параметры.УборкаПомещенийУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Уборка помещений (услуги)", "Cleaning of premises (services)");
	ОбластьПерваяКолонка.Параметры.УборкаПомещенийРасходники = ?(Объект.ЯзыкОтчета = "Русский", "Уборка помещений (расходники)", "Cleaning of premises (materials)");
	ОбластьПерваяКолонка.Параметры.УборкаТерритории = ?(Объект.ЯзыкОтчета = "Русский", "Уборка территории", "Cleaning of territory");
	ОбластьПерваяКолонка.Параметры.СборТележек = ?(Объект.ЯзыкОтчета = "Русский", "Сбор тележек", "Collection of trolleys");
	ОбластьПерваяКолонка.Параметры.УборкаКрыши = ?(Объект.ЯзыкОтчета = "Русский", "Уборка крыши", "Roof cleaning");
	ОбластьПерваяКолонка.Параметры.ВывозСнега = ?(Объект.ЯзыкОтчета = "Русский", "Вывоз снега", "Snow carriage");
	ОбластьПерваяКолонка.Параметры.ЧисткаКовров = ?(Объект.ЯзыкОтчета = "Русский", "Чистка ковров", "Cleaning of carpets");
	ОбластьПерваяКолонка.Параметры.СтационарнаяСвязьИнтернет = ?(Объект.ЯзыкОтчета = "Русский", "Стационарная связь, интернет", "Fixed location phones, internet");
	ОбластьПерваяКолонка.Параметры.МобильнаяСвязь = ?(Объект.ЯзыкОтчета = "Русский", "Мобильная связь", "Mobile phones");
	ОбластьПерваяКолонка.Параметры.ПочтовыеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Почтовые расходы", "Postoffice charges");
	ОбластьПерваяКолонка.Параметры.АрендаОборудования = ?(Объект.ЯзыкОтчета = "Русский", "Аренда оборудования", "Cost of lease of equipment");
	ОбластьПерваяКолонка.Параметры.АрендаДизельгенераторов = ?(Объект.ЯзыкОтчета = "Русский", "Аренда дизельгенераторов", "Cost of lease of equipment (diesel generator)");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
	ОбластьПерваяКолонка.Параметры.ШтрафыПДКиПНВ = ?(Объект.ЯзыкОтчета = "Русский", "Штрафы за ПДК и ПНВ", "Penalties for PDK");
	// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)

	ОбластьПерваяКолонка.Параметры.ИнвентарьМатериалы = ?(Объект.ЯзыкОтчета = "Русский", "Инвентарь и материалы", "Materials and supplies");
	ОбластьПерваяКолонка.Параметры.ПроизводственныйИнвентарь = ?(Объект.ЯзыкОтчета = "Русский", "Производственный инвентарь", "Production inventory");
	ОбластьПерваяКолонка.Параметры.ХозтоварыИнвентарь = ?(Объект.ЯзыкОтчета = "Русский", "Хозтовары/инвентарь", "Houseware materials");
	ОбластьПерваяКолонка.Параметры.МатериалыДляАУПиМедикаменты = ?(Объект.ЯзыкОтчета = "Русский", "Материалы для АУП и медикаменты", "Materials for AUP and medicine");
	ОбластьПерваяКолонка.Параметры.КанцТовары = ?(Объект.ЯзыкОтчета = "Русский", "Канцелярские товары", "Stationery");
	ОбластьПерваяКолонка.Параметры.Спецодежда = ?(Объект.ЯзыкОтчета = "Русский", "Спецодежда", "Working clothes");
	ОбластьПерваяКолонка.Параметры.Топливо = ?(Объект.ЯзыкОтчета = "Русский", "Топливо", "Fuel");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаОхрану = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на охрану", "Security expenses");
	ОбластьПерваяКолонка.Параметры.УслугиОхраннойСигнализации = ?(Объект.ЯзыкОтчета = "Русский", "Услуги охранной организации", "Security service charges");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаОхрану = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на охрану", "Other security expenses");

	ОбластьПерваяКолонка.Параметры.СтрахованиеИБанковскаяКомиссия = ?(Объект.ЯзыкОтчета = "Русский", "Страхование и банковская комиссия", "Insurance and bank commission");
	ОбластьПерваяКолонка.Параметры.Эквайринг = ?(Объект.ЯзыкОтчета = "Русский", "Эквайринг", "Cost of collection payments by credit cards (Acquiring)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеИмуществаТоварныхЗапасов = ?(Объект.ЯзыкОтчета = "Русский", "Страхование имущества, товарных запасов", "Insurance (property, goods on stock)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеГрузов = ?(Объект.ЯзыкОтчета = "Русский", "Страхование грузов", "Insurance (goods in transit)");
	ОбластьПерваяКолонка.Параметры.СтрахованиеАвтотранспорта = ?(Объект.ЯзыкОтчета = "Русский", "Страхование автотранспорта", "Insurance (vehicles)");
	ОбластьПерваяКолонка.Параметры.ПрочееСтрахование = ?(Объект.ЯзыкОтчета = "Русский", "Прочее страхование", "Insurance (other)");
	ОбластьПерваяКолонка.Параметры.БанковскоеОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Банковское обслуживание", "Bank commission");

	ОбластьПерваяКолонка.Параметры.ЗатратыНаПрофУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на профессиональные услуги", "Legal and professional expenses");
	ОбластьПерваяКолонка.Параметры.СодержаниеАрхива = ?(Объект.ЯзыкОтчета = "Русский", "Содержание архива", "Maintenance of the archive");
	ОбластьПерваяКолонка.Параметры.АудитИОценка = ?(Объект.ЯзыкОтчета = "Русский", "Аудит и оценка", "Audit and valuation services");
	ОбластьПерваяКолонка.Параметры.ОформлениеДокументов = ?(Объект.ЯзыкОтчета = "Русский", "Оформление документов", "Documentation");
	ОбластьПерваяКолонка.Параметры.ЗатратыНаПО = ?(Объект.ЯзыкОтчета = "Русский", "Затраты на ПО", "Software maintenance");
	ОбластьПерваяКолонка.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование = ?(Объект.ЯзыкОтчета = "Русский", "Разрешительная документация, сертификация и лицензирование", "Permission documentation, certification and licensing");
	ОбластьПерваяКолонка.Параметры.ЮрУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Юридические услуги", "Law services");
	ОбластьПерваяКолонка.Параметры.ИнфУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Информационные услуги", "Information services");
	ОбластьПерваяКолонка.Параметры.БухОбслуживание = ?(Объект.ЯзыкОтчета = "Русский", "Бухгалтерское обслуживание", "Book-keeping services");
	ОбластьПерваяКолонка.Параметры.КонсУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Консультационные услуги", "Consulting services");

	ОбластьПерваяКолонка.Параметры.ОперНалоги = ?(Объект.ЯзыкОтчета = "Русский", "Операционные налоги", "Operating taxes");
	ОбластьПерваяКолонка.Параметры.НалогНаИмущество = ?(Объект.ЯзыкОтчета = "Русский", "Налог на имущество", "Property tax");
	ОбластьПерваяКолонка.Параметры.ЗемНалог = ?(Объект.ЯзыкОтчета = "Русский", "Земельный налог", "Land tax");
	ОбластьПерваяКолонка.Параметры.ТранспНалог = ?(Объект.ЯзыкОтчета = "Русский", "Транспортный налог", "Transportation tax");
	ОбластьПерваяКолонка.Параметры.НДСнепринимаемыйКвычету = ?(Объект.ЯзыкОтчета = "Русский", "НДС, не принимаемый к вычету", "VAT recoverable");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперНалоги = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные налоги", "Other operating taxes");

	ОбластьПерваяКолонка.Параметры.ИтогоПрочиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы", "Other costs");
	ОбластьПерваяКолонка.Параметры.ТранспУслуги = ?(Объект.ЯзыкОтчета = "Русский", "Транспортные услуги", "Transportation cost");
	ОбластьПерваяКолонка.Параметры.ПредставительскиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Представительские расходы", "Hospitality costs");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы", "Other expenses");

	ОбластьПерваяКолонка.Параметры.ПрочиеОперационныеДоходыРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы и расходы", "Other operating income and expenses");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от реализации ОС и прочих активов", "Profit/(loss) from sale of fixed and other assets");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтСписанияКЗДЗ = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от списания кредиторской/дебиторской задолженности", "Profit/(loss) from write-off of payables/(receivables)");
	ОбластьПерваяКолонка.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль/убыток от переоценки инвестиционной собственности", "Profit/(loss) from revaluation of Investment property");
	ОбластьПерваяКолонка.Параметры.ОбесценениеОСНМА = ?(Объект.ЯзыкОтчета = "Русский", "Обесценение ОС и НМА", "Impairment of PP&E and Intangible assets");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперДоходыРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы и расходы", "Other operating income and expenses");
	ОбластьПерваяКолонка.Параметры.ДоходОтСтраховогоВозмещения = ?(Объект.ЯзыкОтчета = "Русский", "Доход от страхового возмещения", "Insurance income");
	ОбластьПерваяКолонка.Параметры.ДоходОтШтрафовНеустоек = ?(Объект.ЯзыкОтчета = "Русский", "Доход от полученных штрафов и неустоек", "Income from fees and penalties");
	ОбластьПерваяКолонка.Параметры.УбытокОтШтрафовНеустоек = ?(Объект.ЯзыкОтчета = "Русский", "Убыток от уплаченных штрафов и неустоек", "Loss from fees and penalties");
	ОбластьПерваяКолонка.Параметры.Благотворительность = ?(Объект.ЯзыкОтчета = "Русский", "Благотворительность", "Charity");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперДоходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные доходы", "Other operating income");
	ОбластьПерваяКолонка.Параметры.ПрочиеОперРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Прочие операционные расходы", "Other operating expenses");

	ОбластьПерваяКолонка.Параметры.ДоходОтУчастияВАссоцКомпаниях = ?(Объект.ЯзыкОтчета = "Русский", "Доход от участия в ассоциированных компаниях", "Income from associates");
	ОбластьПерваяКолонка.Параметры.ДоходОтПроцентовПолученных = ?(Объект.ЯзыкОтчета = "Русский", "Доход от процентов полученных", "Interest income");
	ОбластьПерваяКолонка.Параметры.ПроцентыПоОстаткамНаСчетах = ?(Объект.ЯзыкОтчета = "Русский", "Проценты по остаткам на счетах", "Bank interest");
	ОбластьПерваяКолонка.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, полученные по предоставленным кредитам и займам", "Interest income from loans issued");

	ОбластьПерваяКолонка.Параметры.ФинРасходы = ?(Объект.ЯзыкОтчета = "Русский", "Финансовые расходы", "Finance costs");
	ОбластьПерваяКолонка.Параметры.РасходыПоПроцентам = ?(Объект.ЯзыкОтчета = "Русский", "Расходы по процентам", "Interest expenses");
	ОбластьПерваяКолонка.Параметры.ПроцентыНачисленныеПоДолгОбязательствам = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, начисленные по долговым обязательствам", "Interest accrued on loans and borrowings");
	ОбластьПерваяКолонка.Параметры.ПроцентыНачисленныеПоФинАренде = ?(Объект.ЯзыкОтчета = "Русский", "Проценты, начисленные по финансовой аренде", "Interest accrued on financial leasing");
	ОбластьПерваяКолонка.Параметры.ХеджированиеПроцентов = ?(Объект.ЯзыкОтчета = "Русский", "Хеджирование процентов", "Hedging");
	ОбластьПерваяКолонка.Параметры.КомиссииПоКредитам = ?(Объект.ЯзыкОтчета = "Русский", "Комиссии по кредитам", "Commissions on loans");
	ОбластьПерваяКолонка.Параметры.ПрочиеРасходыНаФинансирование = ?(Объект.ЯзыкОтчета = "Русский", "Прочие расходы на финансирование", "Other finance costs");

	ОбластьПерваяКолонка.Параметры.КурсовыеРазницы = ?(Объект.ЯзыкОтчета = "Русский", "Курсовые разницы", "Exchange rates gain/(loss)");

	ОбластьПерваяКолонка.Параметры.ПрибыльДоНалогообложения = ?(Объект.ЯзыкОтчета = "Русский", "Прибыль до налогообложения", "Profit before income tax");

	ОбластьПерваяКолонка.Параметры.РасходПоНалогуНаПрибыль = ?(Объект.ЯзыкОтчета = "Русский", "Расход по налогу на прибыль", "Income tax expense");

	ОбластьПерваяКолонка.Параметры.ЧистаяПрибыльЗаПериод = ?(Объект.ЯзыкОтчета = "Русский", "Чистая прибыль за период", "Net profit for the period");

	ОбластьПерваяКолонка.Параметры.ДельтаПрибыли = ?(Объект.ЯзыкОтчета = "Русский", "Дельта (Чистая прибыль за период - Прибыль за год)", "Difference (Net profit for the period - Retained earnings - current year profit)");
	
	ТаблДок.Вывести(ОбластьПерваяКолонка);
	
	// определить список участвующих в отчете организаций
	// +СБ. Кузнецова С. 2014-11-05  - изменен алгоритм
	ТаблицаОбороты_Копия =ТаблицаОбороты.Скопировать(, "Организация");
	ТаблицаОбороты_Копия.Свернуть("Организация");
	ТаблицаОбороты_Копия.Сортировать("Организация");
	
	Организации = ТаблицаОбороты_Копия.ВыгрузитьКолонку("Организация");
	// -СБ. Кузнецова С.
	
	//ОКЕЙ Лобанов В.И.(СофтЛаб) Начало 2019-11-25 (#3527)
	//// +СБ. Кузнецова С. 2014-11-05 
	//ТаблицаКонечныеОстатки = СформироватьТаблицуКонечныеОстатки(Организации);
	//ТаблицаНачальныеОстатки = СформироватьТаблицуНачальныеОстатки(Организации);
	//ТаблицаСпецКонечныеОстатки = СформироватьТаблицуСпецифическиеКонечныеОстатки(Организации);
	//// -СБ. Кузнецова С.
	//Заменено на:                                    	
	ОрганизацииВСоставеНаКонецПериода = ТаблицаОбороты.Скопировать(, "Организация,ПериодКонПараметра");
	
	ТаблицаКонечныеОстатки		 = СформироватьТаблицуКонечныеОстатки(ОрганизацииВСоставеНаКонецПериода);
	ТаблицаНачальныеОстатки		 = СформироватьТаблицуНачальныеОстатки(Организации);
	ТаблицаСпецКонечныеОстатки	 = СформироватьТаблицуСпецифическиеКонечныеОстатки(ОрганизацииВСоставеНаКонецПериода);

	//ОКЕЙ Лобанов В.И.(СофтЛаб) Конец 2019-11-25 (#3527)
	
	
	СтруктураИтогов = Новый Структура("ИнвестСобственность, ОС, НЗС, ДолгосрочныеИнвестиции, ПрочиеВА, ИтогоВА, Запасы, КраткосрочнаяДЗ, КраткосрочныеФинансовыеВложения, ДСиЭквиваленты, ИтогоОборотныхАктивов, ИтогоАктивов,
	|НераспределеннаяПрибыль, КапиталИРезервыНаАкционеров, ИтогоСобственногоКапитала, ИтогоДолгосрочныхОбязательств, ИтогоКраткосрочныеКредитыИЗаймы, ТорговаяИПрочаяКЗ, ИтогоКраткосрочныхОбязательств, ИтогоОбязательств,
	|ИтогоОбязательствИКапитала, ДельтаАктивовИОбязательств, Выручка, ДоходыОтАренды, ДоходыОтРекламныхУслуг, СебестоимостьПродаж, ПремииПоставщиков, ЗатратыЛогистики, РасходникиДляТорговогоПроцесса, ПотериТовара,
	|ВаловаяПрибыль, ОбщехозКомАдмРасходы, РасходыНаОплатуТруда, АмортизацияОСиНМА, РасходыНаРекламу, ОперАренда, ЗатратыНаРемонтИОбслуживание, КоммУслугиИСвязь, ИнвентарьМатериалы, ЗатратыНаОхрану, СтрахованиеИБанковскаяКомиссия,
	|ЗатратыНаПрофУслуги, ОперНалоги, ИтогоПрочиеРасходы, ПрочиеОперационныеДоходыРасходы, ПрочиеОперДоходыРасходы, ДоходОтПроцентовПолученных, ФинРасходы, РасходыПоПроцентам, ПрибыльДоНалогообложения, ЧистаяПрибыльЗаПериод,
	|ДельтаПрибыли", 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);
	
	СтруктураПоискаПоОрганизации = Новый Структура("Организация");
	
	КонОст_ПустыеПараметры =ТаблицаКонечныеОстатки.Скопировать();
	КонОст_ПустыеПараметры.Очистить();
	НоваяСтрока = КонОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из КонОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	КонОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	НачОст_ПустыеПараметры =ТаблицаНачальныеОстатки.Скопировать();
	НачОст_ПустыеПараметры.Очистить();
	НоваяСтрока = НачОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из НачОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	НачОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	Обороты_ПустыеПараметры =ТаблицаОбороты.Скопировать();
	Обороты_ПустыеПараметры.Очистить();
	НоваяСтрока = Обороты_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из Обороты_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	Обороты_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	СпецКонОст_ПустыеПараметры =ТаблицаСпецКонечныеОстатки.Скопировать();
	СпецКонОст_ПустыеПараметры.Очистить();
	НоваяСтрока = СпецКонОст_ПустыеПараметры.Добавить();
	Колонки = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из СпецКонОст_ПустыеПараметры.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			Колонки = Колонки + ", ";
		КонецЕсли;
		Колонки = Колонки + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	СпецКонОст_ПустыеПараметры.ЗаполнитьЗначения(0, Колонки);
	
	Для Каждого Организация Из Организации Цикл
		
		ОбластьКолонкаОрганизация.Параметры.Заполнить(КонОст_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(НачОст_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(Обороты_ПустыеПараметры[0]);
		ОбластьКолонкаОрганизация.Параметры.Заполнить(СпецКонОст_ПустыеПараметры[0]);
		
		// +СБ. Кузнецова С. 2014-11-05 
		//ОбластьКолонкаОрганизация.Параметры.Организация = Организация.Ключ;
		//СтруктураПоискаПоОрганизации.Организация = Организация.Ключ;
		ОбластьКолонкаОрганизация.Параметры.Организация = Организация;
		СтруктураПоискаПоОрганизации.Организация = Организация;
		// -СБ. Кузнецова С.
		
		СтрокиКонОст = ТаблицаКонечныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиКонОст.Количество() <> 0 Тогда
			СтрокаКонОст = СтрокиКонОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаКонОст);
		КонецЕсли;
		СтрокиНачОст = ТаблицаНачальныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиНачОст.Количество() <> 0 Тогда
			СтрокаНачОст = СтрокиНачОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаНачОст);
		КонецЕсли;
		СтрокиОбор = ТаблицаОбороты.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиОбор.Количество() <> 0 Тогда
			СтрокаОбор = СтрокиОбор[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаОбор);
		КонецЕсли;
		СтрокиСпецКонОст = ТаблицаСпецКонечныеОстатки.НайтиСтроки(СтруктураПоискаПоОрганизации);
		Если СтрокиСпецКонОст.Количество() <> 0 Тогда
			СтрокаСпецКонОст = СтрокиСпецКонОст[0];
			ЗаполнитьЗначенияСвойств(ОбластьКолонкаОрганизация.Параметры, СтрокаСпецКонОст);
		КонецЕсли;
		
		// итоговые колонки по ОФП
		ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность 			= ?(ОбластьКолонкаОрганизация.Параметры.ЗемляВИС_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗемляВИС_КонОст) 
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗданияВИС_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗданияВИС_КонОст);
		СтруктураИтогов.ИнвестСобственность = СтруктураИтогов.ИнвестСобственность + ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность;																	
		ОбластьКолонкаОрганизация.Параметры.ОС								= ?(ОбластьКолонкаОрганизация.Параметры.Земля_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Земля_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Здания_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Здания_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХолодильноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХолодильноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТехнологическоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТехнологическоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СухоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СухоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СкладскоеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СкладскоеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОхранноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОхранноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РекламноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РекламноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ITОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ITОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнженерноеОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнженерноеОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочееОборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочееОборудование_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСдо40тсч_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСдо40тсч_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НеотделимыеУлучшения_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НеотделимыеУлучшения_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Транспорт_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Транспорт_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Сооружения_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Сооружения_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСдляПродажи_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСдляПродажи_КонОст);
		СтруктураИтогов.ОС = СтруктураИтогов.ОС + ОбластьКолонкаОрганизация.Параметры.ОС;																	
		ОбластьКолонкаОрганизация.Параметры.НЗС								= ?(ОбластьКолонкаОрганизация.Параметры.НЗСземля_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСземля_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗСздания_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСздания_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗСоборудование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗСоборудование_КонОст)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОСВПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОСВПути_КонОст);
																			//БИТ АКриштопов 10022016 <<--
		СтруктураИтогов.НЗС = СтруктураИтогов.НЗС + ОбластьКолонкаОрганизация.Параметры.НЗС;																	
		ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции			= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестицииВПаиИАкции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестицииВПаиИАкции_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеЗаймыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеЗаймыВыданные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеДолговыеЦБ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеДолговыеЦБ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеИнвестиции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеИнвестиции_КонОст);
		СтруктураИтогов.ДолгосрочныеИнвестиции = СтруктураИтогов.ДолгосрочныеИнвестиции + ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции;																	
		ОбластьКолонкаОрганизация.Параметры.ПрочиеВА						= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочнаяДЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочнаяДЗ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоОСиНМА_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоОСиНМА_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоАренде_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоАренде_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАвансыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАвансыВыданные_КонОст)
																			// +СБ Кузнецова С. 2016-12-09 Redmine 2747
																			//+ ?(ОбластьКолонкаОрганизация.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПервоначальнаяСтоимостьЗатратПоДоговорамАрендыЗемли_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеАктивы_КонОст);
		СтруктураИтогов.ПрочиеВА = СтруктураИтогов.ПрочиеВА + ОбластьКолонкаОрганизация.Параметры.ПрочиеВА;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоВА							= ОбластьКолонкаОрганизация.Параметры.ИнвестСобственность
																			+ ОбластьКолонкаОрганизация.Параметры.ОС
																			+ ОбластьКолонкаОрганизация.Параметры.НЗС
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Гудвил_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Гудвил_КонОст)
																			// +СБ Кузнецова С. 2016-12-09 Redmine 2747
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПраваАренды_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПраваАренды_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НМА_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НМА_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеИнвестиции
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОтложенныеНалоговыеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОтложенныеНалоговыеАктивы_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеВА;
		СтруктураИтогов.ИтогоВА = СтруктураИтогов.ИтогоВА + ОбластьКолонкаОрганизация.Параметры.ИтогоВА;																	
		ОбластьКолонкаОрганизация.Параметры.Запасы							= ?(ОбластьКолонкаОрганизация.Параметры.СырьеИМатериалы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СырьеИМатериалы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НЗП_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НЗП_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ГотоваяПродукция_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ГотоваяПродукция_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТоварыВПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТоварыВПути_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИзменениеСтоимостиЗапасов_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИзменениеСтоимостиЗапасов_КонОст);
		СтруктураИтогов.Запасы = СтруктураИтогов.Запасы + ОбластьКолонкаОрганизация.Параметры.Запасы;																	
		ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ					= ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПокупателейИЗаказчиков_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПокупателейИЗаказчиков_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НДСкВозмещению_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НДСкВозмещению_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыВыданныеТекущие_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыВыданныеТекущие_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоНалогам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПоНалогам_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяДЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяДЗ_КонОст)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БонусыПолученныеОтПоставщиков_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БонусыПолученныеОтПоставщиков_КонОст)
																			//БИТ АКриштопов 10022016 <<--
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервПоСомнительнымДолгам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервПоСомнительнымДолгам_КонОст);
		СтруктураИтогов.КраткосрочнаяДЗ = СтруктураИтогов.КраткосрочнаяДЗ + ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ;																	
		ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения = ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеЗаймыВыданные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеЗаймыВыданные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеДолговыеЦБ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеДолговыеЦБ_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеКраткосрочныеИнвестиции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеКраткосрочныеИнвестиции_КонОст);
		СтруктураИтогов.КраткосрочныеФинансовыеВложения = СтруктураИтогов.КраткосрочныеФинансовыеВложения + ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения;																	
		ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты					= ?(ОбластьКолонкаОрганизация.Параметры.Касса_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Касса_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасчетныйСчет_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасчетныйСчет_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВалютныйСчет_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВалютныйСчет_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанках_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанках_КонОст)
																			// +СБ Кузнецова С. 2016-06-06 Задача Redmine #2496
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанкахВВалюте_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецСчетаВБанкахВВалюте_КонОст)
																			// -СБ Кузнецова С.
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДСвПути_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДСвПути_КонОст);
		СтруктураИтогов.ДСиЭквиваленты = СтруктураИтогов.ДСиЭквиваленты + ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов			= ОбластьКолонкаОрганизация.Параметры.Запасы
																			+ ОбластьКолонкаОрганизация.Параметры.КраткосрочнаяДЗ
																			+ ОбластьКолонкаОрганизация.Параметры.КраткосрочныеФинансовыеВложения
																			+ ОбластьКолонкаОрганизация.Параметры.ДСиЭквиваленты
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОборотныеАктивы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОборотныеАктивы_КонОст);
		СтруктураИтогов.ИтогоОборотныхАктивов = СтруктураИтогов.ИтогоОборотныхАктивов + ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов					= ОбластьКолонкаОрганизация.Параметры.ИтогоВА
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОборотныхАктивов;
		СтруктураИтогов.ИтогоАктивов = СтруктураИтогов.ИтогоАктивов + ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов;																	
		ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль			= ?(ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет_СпецКонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыльУбытокПрошлыхЛет_СпецКонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_СпецКонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КорректировкаНераспределеннойПрибылиУбыткаПрошлыхЛет_СпецКонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РаспределениеАктивов_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РаспределениеАктивов_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбъявленныеДивиденды_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбъявленныеДивиденды_КонОст);
		СтруктураИтогов.НераспределеннаяПрибыль = СтруктураИтогов.НераспределеннаяПрибыль + ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль;																	
		ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров		= ?(ОбластьКолонкаОрганизация.Параметры.АкционерныйКапитал_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АкционерныйКапитал_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЭмиссионныйДоход_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЭмиссионныйДоход_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СобственныеВыкупленныеАкции_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СобственныеВыкупленныеАкции_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервыПоЗаконодательству_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервыПоЗаконодательству_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДобавочныйКапитал_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДобавочныйКапитал_КонОст)
																			+ ОбластьКолонкаОрганизация.Параметры.НераспределеннаяПрибыль
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРезервы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРезервы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТрансляционнаяРазница_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТрансляционнаяРазница_КонОст);
		СтруктураИтогов.КапиталИРезервыНаАкционеров = СтруктураИтогов.КапиталИРезервыНаАкционеров + ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала		= ОбластьКолонкаОрганизация.Параметры.КапиталИРезервыНаАкционеров;
		СтруктураИтогов.ИтогоСобственногоКапитала = СтруктураИтогов.ИтогоСобственногоКапитала + ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств	= ?(ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеКредитыИЗаймы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДолгосрочныеКредитыИЗаймы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОНО_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОНО_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДБП_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДБП_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеОбязательства_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДолгосрочныеОбязательства_КонОст);
		СтруктураИтогов.ИтогоДолгосрочныхОбязательств = СтруктураИтогов.ИтогоДолгосрочныхОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы = ?(ОбластьКолонкаОрганизация.Параметры.КраткосрочныеКредитыИЗаймы_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КраткосрочныеКредитыИЗаймы_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТекущаяДоляДолгосрочныхОбязательств_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТекущаяДоляДолгосрочныхОбязательств_КонОст);
		СтруктураИтогов.ИтогоКраткосрочныеКредитыИЗаймы = СтруктураИтогов.ИтогоКраткосрочныеКредитыИЗаймы + ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы;																	
		ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ				= ?(ОбластьКолонкаОрганизация.Параметры.КЗинвестиционная_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КЗинвестиционная_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КЗоперационная_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КЗоперационная_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредоплатыПолученные_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредоплатыПолученные_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогам_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогам_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередПерсоналом_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередПерсоналом_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяКЗ_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяКЗ_КонОст)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2021-02-04 (#4006)
																			//+ ?(ОбластьКолонкаОрганизация.Параметры.ЦелевоеФинансирование_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЦелевоеФинансирование_КонОст);
																			;
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2021-02-04 (#4006)
		СтруктураИтогов.ТорговаяИПрочаяКЗ = СтруктураИтогов.ТорговаяИПрочаяКЗ + ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств	= ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныеКредитыИЗаймы
																			+ ОбластьКолонкаОрганизация.Параметры.ТорговаяИПрочаяКЗ
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогуНаПрибыль_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПоНалогуНаПрибыль_КонОст)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередУчредителями_КонОст = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗадолженностьПередУчредителями_КонОст);
		СтруктураИтогов.ИтогоКраткосрочныхОбязательств = СтруктураИтогов.ИтогоКраткосрочныхОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств				= ОбластьКолонкаОрганизация.Параметры.ИтогоДолгосрочныхОбязательств
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоКраткосрочныхОбязательств;
		СтруктураИтогов.ИтогоОбязательств = СтруктураИтогов.ИтогоОбязательств + ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала		= ОбластьКолонкаОрганизация.Параметры.ИтогоСобственногоКапитала
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательств;
		СтруктураИтогов.ИтогоОбязательствИКапитала = СтруктураИтогов.ИтогоОбязательствИКапитала + ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала;																	
		ОбластьКолонкаОрганизация.Параметры.ДельтаАктивовИОбязательств		= ОбластьКолонкаОрганизация.Параметры.ИтогоАктивов
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоОбязательствИКапитала;
		СтруктураИтогов.ДельтаАктивовИОбязательств = СтруктураИтогов.ДельтаАктивовИОбязательств + ОбластьКолонкаОрганизация.Параметры.ДельтаАктивовИОбязательств;																	
		
		// итоговые колонки по ОСД
		ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды					= ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыЗемли_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыЗемли_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыПлощадейПодБанкоматы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеДоходыОтАренды_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеДоходыОтАренды_Оборот);
		СтруктураИтогов.ДоходыОтАренды = СтруктураИтогов.ДоходыОтАренды + ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды;																	
		ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг			= ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыРекламныхПлощадей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтАрендыРекламныхПлощадей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходыОтПрочихРекламныхУслуг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходыОтПрочихРекламныхУслуг_Оборот);
		СтруктураИтогов.ДоходыОтРекламныхУслуг = СтруктураИтогов.ДоходыОтРекламныхУслуг + ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг;																	
		ОбластьКолонкаОрганизация.Параметры.Выручка							= ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииПродукцииОбщепита_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииПродукцииОбщепита_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходыОтАренды
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходыОтРекламныхУслуг;
		СтруктураИтогов.Выручка = СтруктураИтогов.Выручка + ОбластьКолонкаОрганизация.Параметры.Выручка;																	
		ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков				= ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРетро_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРетро_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковПромо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковПромо_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковАдм_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковАдм_Оборот)
																			//СофтЛаб Начало 2018-09-09 3074
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРекламныеУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиковРекламныеУслуги_Оборот)
																			//СофтЛаб Конец 2018-09-09 3074
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтЛогистики_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтЛогистики_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ШтрафыПоставщиков_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ШтрафыПоставщиков_Оборот);
		СтруктураИтогов.ПремииПоставщиков = СтруктураИтогов.ПремииПоставщиков + ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики				= ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнеш_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнеш_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнутр_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОбработкуТоваровВнутр_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаДоставку_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаДоставку_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеЗатратыНаЛогистику_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеЗатратыНаЛогистику_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеПлатежи_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаТаможенныеПлатежи_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаХранениеТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаХранениеТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомпенсацияЛогистическихЗатрат_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомпенсацияЛогистическихЗатрат_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтоимостьЛогистикиДляМагазинов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтоимостьЛогистикиДляМагазинов_Оборот);
		СтруктураИтогов.ЗатратыЛогистики = СтруктураИтогов.ЗатратыЛогистики + ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики;																	
		ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса	= ?(ОбластьКолонкаОрганизация.Параметры.ЗащитныеМатериалы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗащитныеМатериалы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Упаковка_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Упаковка_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЭлементыЦенников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЭлементыЦенников_Оборот);
		СтруктураИтогов.РасходникиДляТорговогоПроцесса = СтруктураИтогов.РасходникиДляТорговогоПроцесса + ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса;																	
		ОбластьКолонкаОрганизация.Параметры.ПотериТовара					= ?(ОбластьКолонкаОрганизация.Параметры.ПотериТовараИнв_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПотериТовараИнв_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПотериТовараСпис_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПотериТовараСпис_Оборот);
		СтруктураИтогов.ПотериТовара = СтруктураИтогов.ПотериТовара + ОбластьКолонкаОрганизация.Параметры.ПотериТовара;																	
		ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж				= ?(ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииТоваров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииТоваров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииПродукцииОбщепита_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СебестоимостьРеализацииПродукцииОбщепита_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ПремииПоставщиков
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыЛогистики
																			+ ОбластьКолонкаОрганизация.Параметры.РасходникиДляТорговогоПроцесса
																			+ ОбластьКолонкаОрганизация.Параметры.ПотериТовара
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РезервПодСнижениеСтоимостиЗапасов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РезервПодСнижениеСтоимостиЗапасов_Оборот)
																			//БИТ АКриштопов 10022016 -->>
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КорректировкаСебестоимостиПоОбратнойРеализации_Оборот);
																			//БИТ АКриштопов 10022016 <<--
		СтруктураИтогов.СебестоимостьПродаж = СтруктураИтогов.СебестоимостьПродаж + ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж;																	
		ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль					= ОбластьКолонкаОрганизация.Параметры.Выручка
																			+ ОбластьКолонкаОрганизация.Параметры.СебестоимостьПродаж;
		СтруктураИтогов.ВаловаяПрибыль = СтруктураИтогов.ВаловаяПрибыль + ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда			= ?(ОбластьКолонкаОрганизация.Параметры.ФОТ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ФОТ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтраховыеВзносы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтраховыеВзносы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Пособия_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Пособия_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПремированиеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПремированиеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПитаниеСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПитаниеСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МедосмотрСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МедосмотрСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОрганизацияКорпМероприятий_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОрганизацияКорпМероприятий_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Аутсорсинг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Аутсорсинг_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаСотрудников_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаСотрудников_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомандировочныеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомандировочныеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбучениеПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбучениеПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СпецОбучениеПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СпецОбучениеПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоискПерсонала_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоискПерсонала_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаКвартир_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаКвартир_Оборот)
																			//СофтЛаб Начало 2019-06-20 #3383
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаКвартирСотрудникам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаКвартирСотрудникам_Оборот)
																			//СофтЛаб Конец 2019-06-20 #3383
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыплатаНаОсновеАкций_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыплатаНаОсновеАкций_Оборот);
		СтруктураИтогов.РасходыНаОплатуТруда = СтруктураИтогов.РасходыНаОплатуТруда + ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда;																	
		ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА				= ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияОС_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияОС_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияОСдо40тсч_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияОСдо40тсч_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияНМА_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияНМА_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АмортизацияICLL_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АмортизацияICLL_Оборот);
		СтруктураИтогов.АмортизацияОСиНМА = СтруктураИтогов.АмортизацияОСиНМА + ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу				= ?(ОбластьКолонкаОрганизация.Параметры.ВнутрОформление_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВнутрОформление_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПромоакции_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПромоакции_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Листовки_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Листовки_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВнешРеклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВнешРеклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОреклОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОреклОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.PRактивность_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.PRактивность_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МаркетинговыеИсследования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МаркетинговыеИсследования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоддержкаБренда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоддержкаБренда_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрограммаЛояльности_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрограммаЛояльности_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РекламаИНавигация_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РекламаИНавигация_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Мониторинг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Мониторинг_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Начало 2020-05-26 (#3761)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаСМИ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаСМИ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЛистовкиАудитРаспространение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЛистовкиАудитРаспространение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СМСViber_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СМСViber_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РегиональныеПромоакции_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РегиональныеПромоакции_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Видеореклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Видеореклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Радиореклама_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Радиореклама_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаECom_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнтернетРекламаECom_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПоддержкаБрендаСТМ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПоддержкаБрендаСТМ_Оборот)
																			//ОКЕЙ Поздняков А.С. (СофтЛаб) Конец 2020-05-26 (#3761)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыМаркетинга_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыМаркетинга_Оборот);
		СтруктураИтогов.РасходыНаРекламу = СтруктураИтогов.РасходыНаРекламу + ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу;																	
		ОбластьКолонкаОрганизация.Параметры.ОперАренда						= ?(ОбластьКолонкаОрганизация.Параметры.АрендаЗемли_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаЗемли_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаТоргПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаТоргПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаОфиса_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаОфиса_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаАрендуСклада_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаАрендуСклада_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочаяАренда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочаяАренда_Оборот);
		СтруктураИтогов.ОперАренда = СтруктураИтогов.ОперАренда + ОбластьКолонкаОрганизация.Параметры.ОперАренда;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание	= ?(ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеЗданийПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеЗданийПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтЗданийПомещений_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтЗданийПомещений_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИОбслуживаниеТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИОбслуживаниеТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИСодержаниеОборудованияДляОбслуживанияПокупателей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОавтотранспорта_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОавтотранспорта_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОинженерногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОинженерногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОкулинарногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОкулинарногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеОфисногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбслуживаниеОфисногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОохранногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОохранногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОскладскогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОскладскогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОсухогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОсухогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОхолодильногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОхолодильногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЭКЛЗ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЭКЛЗ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЕжемесячное_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияЕжемесячное_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияПлановое_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОэлектронногоОборудованияПлановое_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТОпрочихОСиИнвентаря_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТОпрочихОСиИнвентаря_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтИнженерногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтИнженерногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтКулинарногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтКулинарногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтСкладскогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтСкладскогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтСухогоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтСухогоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтХолодильногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтХолодильногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтЭлектронногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтЭлектронногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтОхранногоОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтОхранногоОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РемонтПрочихОСиИнвентаря_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РемонтПрочихОСиИнвентаря_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочийРемонт_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочийРемонт_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОзеленениеТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОзеленениеТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СодержаниеШатров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СодержаниеШатров_Оборот);
		СтруктураИтогов.ЗатратыНаРемонтИОбслуживание = СтруктураИтогов.ЗатратыНаРемонтИОбслуживание + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание;																	
		ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь				= ?(ОбластьКолонкаОрганизация.Параметры.Водоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Водоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Газоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Газоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Теплоснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Теплоснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Электроснабжение_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Электроснабжение_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовТопливо_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторовУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходыНаСодержаниеДизельгенераторов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеКоммРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеКоммРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВывозМусора_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВывозМусора_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииВторсырья_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВыручкаОтРеализацииВторсырья_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДератизацияДезинфекция_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДератизацияДезинфекция_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОчисткаЖиропескоуловителей_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОчисткаЖиропескоуловителей_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийРасходники_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаПомещенийРасходники_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаТерритории_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаТерритории_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СборТележек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СборТележек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УборкаКрыши_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УборкаКрыши_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ВывозСнега_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ВывозСнега_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЧисткаКовров_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЧисткаКовров_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтационарнаяСвязьИнтернет_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтационарнаяСвязьИнтернет_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МобильнаяСвязь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МобильнаяСвязь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПочтовыеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПочтовыеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаОборудования_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаОборудования_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АрендаДизельгенераторов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АрендаДизельгенераторов_Оборот)
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Начало 2017-05-26 (#2833)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ШтрафыПДКиПНВ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ШтрафыПДКиПНВ_Оборот);
																			// ОКЕЙ Наумов А.Н.(СофтЛаб) Конец 2017-05-26 (#2833)
		СтруктураИтогов.КоммУслугиИСвязь = СтруктураИтогов.КоммУслугиИСвязь + ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь;																	
		ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы 				= ?(ОбластьКолонкаОрганизация.Параметры.ПроизводственныйИнвентарь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроизводственныйИнвентарь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХозтоварыИнвентарь_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХозтоварыИнвентарь_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.МатериалыДляАУПиМедикаменты_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.МатериалыДляАУПиМедикаменты_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КанцТовары_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КанцТовары_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Спецодежда_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Спецодежда_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Топливо_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Топливо_Оборот);
		СтруктураИтогов.ИнвентарьМатериалы = СтруктураИтогов.ИнвентарьМатериалы + ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану					= ?(ОбластьКолонкаОрганизация.Параметры.УслугиОхраннойСигнализации_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УслугиОхраннойСигнализации_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаОхрану_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаОхрану_Оборот);
		СтруктураИтогов.ЗатратыНаОхрану = СтруктураИтогов.ЗатратыНаОхрану + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану;																	
		ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия	= ?(ОбластьКолонкаОрганизация.Параметры.Эквайринг_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Эквайринг_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеИмуществаТоварныхЗапасов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеИмуществаТоварныхЗапасов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеГрузов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеГрузов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.СтрахованиеАвтотранспорта_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СтрахованиеАвтотранспорта_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочееСтрахование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочееСтрахование_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БанковскоеОбслуживание_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БанковскоеОбслуживание_Оборот);
		СтруктураИтогов.СтрахованиеИБанковскаяКомиссия = СтруктураИтогов.СтрахованиеИБанковскаяКомиссия + ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия;																	
		ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги				= ?(ОбластьКолонкаОрганизация.Параметры.СодержаниеАрхива_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.СодержаниеАрхива_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.АудитИОценка_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.АудитИОценка_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОформлениеДокументов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОформлениеДокументов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПО_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПО_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РазрешительнаяДокументацияСертификацияЛицензирование_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЮрУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЮрУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ИнфУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ИнфУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.БухОбслуживание_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.БухОбслуживание_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КонсУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КонсУслуги_Оборот);
		СтруктураИтогов.ЗатратыНаПрофУслуги = СтруктураИтогов.ЗатратыНаПрофУслуги + ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги;																	
		ОбластьКолонкаОрганизация.Параметры.ОперНалоги						= ?(ОбластьКолонкаОрганизация.Параметры.НалогНаИмущество_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НалогНаИмущество_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ЗемНалог_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ЗемНалог_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ТранспНалог_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТранспНалог_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.НДСнепринимаемыйКвычету_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.НДСнепринимаемыйКвычету_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперНалоги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперНалоги_Оборот);
		СтруктураИтогов.ОперНалоги = СтруктураИтогов.ОперНалоги + ОбластьКолонкаОрганизация.Параметры.ОперНалоги;																	
		ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы				= ?(ОбластьКолонкаОрганизация.Параметры.ТранспУслуги_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ТранспУслуги_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПредставительскиеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПредставительскиеРасходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходы_Оборот);
		СтруктураИтогов.ИтогоПрочиеРасходы = СтруктураИтогов.ИтогоПрочиеРасходы + ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы			= ОбластьКолонкаОрганизация.Параметры.РасходыНаОплатуТруда
																			+ ОбластьКолонкаОрганизация.Параметры.АмортизацияОСиНМА
																			+ ОбластьКолонкаОрганизация.Параметры.РасходыНаРекламу
																			+ ОбластьКолонкаОрганизация.Параметры.ОперАренда
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаРемонтИОбслуживание
																			+ ОбластьКолонкаОрганизация.Параметры.КоммУслугиИСвязь
																			+ ОбластьКолонкаОрганизация.Параметры.ИнвентарьМатериалы
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаОхрану
																			+ ОбластьКолонкаОрганизация.Параметры.СтрахованиеИБанковскаяКомиссия
																			+ ОбластьКолонкаОрганизация.Параметры.ЗатратыНаПрофУслуги
																			+ ОбластьКолонкаОрганизация.Параметры.ОперНалоги
																			+ ОбластьКолонкаОрганизация.Параметры.ИтогоПрочиеРасходы;
		СтруктураИтогов.ОбщехозКомАдмРасходы = СтруктураИтогов.ОбщехозКомАдмРасходы + ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы			= ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтСтраховогоВозмещения_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтСтраховогоВозмещения_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтШтрафовНеустоек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтШтрафовНеустоек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.УбытокОтШтрафовНеустоек_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.УбытокОтШтрафовНеустоек_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.Благотворительность_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.Благотворительность_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходы_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеОперРасходы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеОперРасходы_Оборот);
		СтруктураИтогов.ПрочиеОперДоходыРасходы = СтруктураИтогов.ПрочиеОперДоходыРасходы + ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы	= ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтРеализацииОСиПрочихАктивов_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтСписанияКЗДЗ_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтСписанияКЗДЗ_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльУбытокОтПереоценкиИнвСобственности_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ОбесценениеОСНМА_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ОбесценениеОСНМА_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеОперДоходыРасходы;
		СтруктураИтогов.ПрочиеОперационныеДоходыРасходы = СтруктураИтогов.ПрочиеОперационныеДоходыРасходы + ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных		= ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыПоОстаткамНаСчетах_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыПоОстаткамНаСчетах_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыПолучениеПоПредостКредитамЗаймам_Оборот);
		СтруктураИтогов.ДоходОтПроцентовПолученных = СтруктураИтогов.ДоходОтПроцентовПолученных + ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных;																	
		ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам				= ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоДолгОбязательствам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоДолгОбязательствам_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоФинАренде_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПроцентыНачисленныеПоФинАренде_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ХеджированиеПроцентов_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ХеджированиеПроцентов_Оборот);
		СтруктураИтогов.РасходыПоПроцентам = СтруктураИтогов.РасходыПоПроцентам + ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам;																	
		ОбластьКолонкаОрганизация.Параметры.ФинРасходы						= ОбластьКолонкаОрганизация.Параметры.РасходыПоПроцентам
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КомиссииПоКредитам_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КомиссииПоКредитам_Оборот)
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаФинансирование_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрочиеРасходыНаФинансирование_Оборот);
		СтруктураИтогов.ФинРасходы = СтруктураИтогов.ФинРасходы + ОбластьКолонкаОрганизация.Параметры.ФинРасходы;																	
		ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения		= ОбластьКолонкаОрганизация.Параметры.ВаловаяПрибыль
																			+ ОбластьКолонкаОрганизация.Параметры.ОбщехозКомАдмРасходы
																			+ ОбластьКолонкаОрганизация.Параметры.ПрочиеОперационныеДоходыРасходы
																			+ ?(ОбластьКолонкаОрганизация.Параметры.ДоходОтУчастияВАссоцКомпаниях_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ДоходОтУчастияВАссоцКомпаниях_Оборот)
																			+ ОбластьКолонкаОрганизация.Параметры.ДоходОтПроцентовПолученных
																			+ ОбластьКолонкаОрганизация.Параметры.ФинРасходы
																			+ ?(ОбластьКолонкаОрганизация.Параметры.КурсовыеРазницы_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.КурсовыеРазницы_Оборот);
		СтруктураИтогов.ПрибыльДоНалогообложения = СтруктураИтогов.ПрибыльДоНалогообложения + ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения;																	
		ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод			= ОбластьКолонкаОрганизация.Параметры.ПрибыльДоНалогообложения
																			+ ?(ОбластьКолонкаОрганизация.Параметры.РасходПоНалогуНаПрибыль_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.РасходПоНалогуНаПрибыль_Оборот);
		СтруктураИтогов.ЧистаяПрибыльЗаПериод = СтруктураИтогов.ЧистаяПрибыльЗаПериод + ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод;																	
		ОбластьКолонкаОрганизация.Параметры.ДельтаПрибыли					= ОбластьКолонкаОрганизация.Параметры.ЧистаяПрибыльЗаПериод
																			- ?(ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот = Неопределено, 0, ОбластьКолонкаОрганизация.Параметры.ПрибыльЗаГод_Оборот);
		СтруктураИтогов.ДельтаПрибыли = СтруктураИтогов.ДельтаПрибыли + ОбластьКолонкаОрганизация.Параметры.ДельтаПрибыли;																	
		
		ТаблДок.Присоединить(ОбластьКолонкаОрганизация);
		
	КонецЦикла;
	
	ОбластьКолонкаИтоги.Параметры.Итого = ?(Объект.ЯзыкОтчета = "Русский", "Итого", "Total");
	
	ТаблицаКонечныеОстатки_Копия =ТаблицаКонечныеОстатки.Скопировать();
	ТаблицаНачальныеОстатки_Копия =ТаблицаНачальныеОстатки.Скопировать();
	ТаблицаОбороты_Копия =ТаблицаОбороты.Скопировать();
	// +СБ. Кузнецова С. 2014-11-06 
	ТаблицаСпецКонечныеОстатки_Копия =ТаблицаСпецКонечныеОстатки.Скопировать();
	// -СБ. Кузнецова С.
	
	КолонкиКонОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаКонечныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиКонОст = КолонкиКонОст + ", ";
		КонецЕсли;
		КолонкиКонОст = КолонкиКонОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаКонечныеОстатки_Копия.Свернуть(, КолонкиКонОст);
	Если ТаблицаКонечныеОстатки_Копия.Количество() <> 0 Тогда
		КонОст_Итоги = ТаблицаКонечныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, КонОст_Итоги);
	КонецЕсли;
	
	КолонкиНачОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаНачальныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиНачОст = КолонкиНачОст + ", ";
		КонецЕсли;
		КолонкиНачОст = КолонкиНачОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаНачальныеОстатки_Копия.Свернуть(, КолонкиНачОст);
	Если ТаблицаНачальныеОстатки_Копия.Количество() <> 0 Тогда
		НачОст_Итоги = ТаблицаНачальныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, НачОст_Итоги);
	КонецЕсли;
	
	КолонкиОбороты = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаОбороты.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиОбороты = КолонкиОбороты + ", ";
		КонецЕсли;
		КолонкиОбороты = КолонкиОбороты + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаОбороты_Копия.Свернуть(, КолонкиОбороты);
	Если ТаблицаОбороты_Копия.Количество() <> 0 Тогда
		Обороты_Итоги = ТаблицаОбороты_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, Обороты_Итоги);
	КонецЕсли;
	
	// +СБ. Кузнецова С. 2014-11-06 
	КолонкиСпецКонОст = "";
	ПерваяСтрока = Истина;
	Для Каждого Колонка Из ТаблицаСпецКонечныеОстатки.Колонки Цикл
		Если Не ПерваяСтрока Тогда
			КолонкиСпецКонОст = КолонкиСпецКонОст + ", ";
		КонецЕсли;
		КолонкиСпецКонОст = КолонкиСпецКонОст + Колонка.Имя;
		ПерваяСтрока = Ложь;
	КонецЦикла;
	ТаблицаСпецКонечныеОстатки_Копия.Свернуть(, КолонкиСпецКонОст);
	Если ТаблицаСпецКонечныеОстатки_Копия.Количество() <> 0 Тогда
		СпецКонОст_Итоги = ТаблицаСпецКонечныеОстатки_Копия[0];
		ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, СпецКонОст_Итоги);
	КонецЕсли;
	// -СБ. Кузнецова С.
	
	ЗаполнитьЗначенияСвойств(ОбластьКолонкаИтоги.Параметры, СтруктураИтогов);
	
	ТаблДок.ФиксацияСверху = 6;
	ТаблДок.ФиксацияСлева = 1;
	ТаблДок.Присоединить(ОбластьКолонкаИтоги);
	
	Возврат ТаблДок;
	
КонецФункции // СформироватьОтчет()


//BIT Amerkulov -- 25-08-2015



////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ
