
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	Если Параметры.Свойство("СтруктураНастроек") Тогда
		Обработки.бит_ГрупповаяОплатаЗаявок.НастроитьОбработку(Объект, Параметры.СтруктураНастроек, Ложь);
	КонецЕсли;
	
	// Установить видимость реквизитов формы
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если СозданиеПлатежныхПоручений = 0 Тогда
		Объект.НеФормироватьПлатежныеПоручения = Истина;
		Объект.ПроводитьПлатежныеПоручения  	= Ложь;
	ИначеЕсли СозданиеПлатежныхПоручений = 1 Тогда
		Объект.НеФормироватьПлатежныеПоручения = Ложь;
		Объект.ПроводитьПлатежныеПоручения  	= Ложь;
	ИначеЕсли СозданиеПлатежныхПоручений = 2 Тогда
		Объект.НеФормироватьПлатежныеПоручения = Ложь;
		Объект.ПроводитьПлатежныеПоручения  	= Истина;
	КонецЕсли; 
	
	Если СозданиеДокументовОплаты = 0 Тогда
		Объект.НеФормироватьДокументыОплаты = Истина;
		Объект.ПроводитьДокументыОплаты     = Ложь;
		Объект.РежимЗаписи = "";
	ИначеЕсли СозданиеДокументовОплаты = 1 Тогда
		Объект.НеФормироватьДокументыОплаты = Ложь;
		Объект.ПроводитьДокументыОплаты     = Ложь;
		Объект.РежимЗаписи = "Запись";
	ИначеЕсли СозданиеДокументовОплаты = 2 Тогда
		Объект.НеФормироватьДокументыОплаты = Ложь;
		Объект.ПроводитьДокументыОплаты     = Истина;
		Объект.РежимЗаписи = "Проведение";
	КонецЕсли; 

	Результат = ЗаполнитьНастройки(Ложь);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Объект   = Форма.Объект;
	Элементы = Форма.Элементы;
	
	Если Объект.ПроводитьДокументыОплаты Тогда
		Форма.СозданиеДокументовОплаты = 2;
	ИначеЕсли Объект.НеФормироватьДокументыОплаты = Ложь Тогда
		Форма.СозданиеДокументовОплаты = 1;
	КонецЕсли; 
	
	Если Объект.ПроводитьПлатежныеПоручения Тогда
		Форма.СозданиеПлатежныхПоручений = 2;
	ИначеЕсли Объект.НеФормироватьПлатежныеПоручения = Ложь Тогда
		Форма.СозданиеПлатежныхПоручений = 1;
	КонецЕсли; 
	
КонецПроцедуры // УстановитьВидимость()

// Функция формирует структуру настроек.
// 
&НаСервере
Функция ЗаполнитьНастройки(РежимСохранения)
	
	Возврат Обработки.бит_ГрупповаяОплатаЗаявок.ЗаполнитьНастройки(Объект, РежимСохранения);
	
КонецФункции // СохранитьНастройки()

#КонецОбласти

