
&НаКлиенте
Процедура ВыбПериодНажатие(Элемент)
	
	ДиалогРедактированияПериода = Новый ДиалогРедактированияСтандартногоПериода;	
	
	ДиалогРедактированияПериода.Период.Вариант = ВариантСтандартногоПериода.ПроизвольныйПериод;
	ДиалогРедактированияПериода.Период.ДатаНачала = Объект.НачПериода;
	ДиалогРедактированияПериода.Период.ДатаНачала = Объект.КонПериода;
	
	Если ДиалогРедактированияПериода.Редактировать() Тогда
		Объект.НачПериода = НачалоДня(ДиалогРедактированияПериода.Период.ДатаНачала);
		Объект.КонПериода = КонецДня(ДиалогРедактированияПериода.Период.ДатаОкончания);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПриОткрытии_Сервер()
	Возврат Метаданные.РегистрыСведений.Найти("ОК_ЗагружаемыеТипыОперацийАксапты") = Неопределено
КонецФункции

&НаСервере
Функция ПриОткрытии_Сервер_1()
	
	Если РольДоступна("ПолныеПрава") Тогда 
		Элементы.НастройкиМеханизмаИмпортаДанных.ТолькоПросмотр = Ложь;
		Элементы.НастройкиМеханизмаИмпортаДанных.Доступность	 = Истина;
	КонецЕсли;
	
	Объект.Организация =  Справочники.Организации.НайтиПоКоду("000000046");
	

	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_ок_ТипыОперацийАксапты.Ссылка КАК ТипОперацииАксапты
	               |ИЗ
	               |	Справочник.бит_ок_ТипыОперацийАксапты КАК бит_ок_ТипыОперацийАксапты
	               |ГДЕ
	               |	(НЕ бит_ок_ТипыОперацийАксапты.ПометкаУдаления)
	               |	И (НЕ бит_ок_ТипыОперацийАксапты.СвернутыеОбороты)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	бит_ок_ТипыОперацийАксапты.Ссылка КАК ТипОперацииАксапты
	               |ИЗ
	               |	Справочник.бит_ок_ТипыОперацийАксапты КАК бит_ок_ТипыОперацийАксапты
	               |ГДЕ
	               |	(НЕ бит_ок_ТипыОперацийАксапты.ПометкаУдаления)
	               |	И бит_ок_ТипыОперацийАксапты.СвернутыеОбороты";
	
	Результат 	= Запрос.ВыполнитьПакет();
	
	ТЗРезультат = Результат[0].Выгрузить();
	ОтборГруппы	= Новый СписокЗначений;	
	ОтборГруппы.ЗагрузитьЗначения(ТЗРезультат.ВыгрузитьКолонку("ТипОперацииАксапты"));
	//++СВВ
	ЭлементОтбора = ТипыОперацийГруппы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОперацииАксапты");
	ЭлементОтбора.ПравоеЗначение = ОтборГруппы;
	//ТипыОперацийГруппы.Отбор.ТипОперацииАксапты.ВидСравнения		= ВидСравнения.ВСписке;
	//ТипыОперацийГруппы.Отбор.ТипОперацииАксапты.Значение			= ОтборГруппы;
	//ТипыОперацийГруппы.Отбор.ТипОперацииАксапты.Использование	= Истина;
	//--СВВ
	
	ОтборСвернутые	= Новый СписокЗначений;
	ТЗРезультат 	= Результат[1].Выгрузить();
	ОтборСвернутые.ЗагрузитьЗначения(ТЗРезультат.ВыгрузитьКолонку("ТипОперацииАксапты"));
	//++СВВ
	ЭлементОтбора = ТипыОперацийСвернутые.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ТипОперацииАксапты");
	ЭлементОтбора.ПравоеЗначение = ОтборСвернутые;
	//ТипыОперацийСвернутые.Отбор.ТипОперацииАксапты.ВидСравнения	= ВидСравнения.ВСписке;
	//ТипыОперацийСвернутые.Отбор.ТипОперацииАксапты.Значение		= ОтборСвернутые;
	//ТипыОперацийСвернутые.Отбор.ТипОперацииАксапты.Использование	= Истина;
	//--СВВ
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если
	ПриОткрытии_Сервер() Тогда 
		Предупреждение("Данная обработка не предназначена для работы с текущей конфигурацией");
		ЭтаФорма.Закрыть();
		Возврат;
	КонецЕсли;
	
	ПриОткрытии_Сервер_1();
	
	
	
КонецПроцедуры

&НаСервере
Функция ОрганизацияНачалоВыбораИзСписка_Сервер(Элемент)
	СписокОрганизаций = Новый СписокЗначений;
	СписокОрганизаций.Добавить(Справочники.Организации.НайтиПоКоду("000000046"));
	Элемент.СписокВыбора.Очистить();
	Для Каждого тек_Значение_уник Из  СписокОрганизаций Цикл
	Элемент.СписокВыбора.Добавить(тек_Значение_уник.Значение, тек_Значение_уник.Представление);
	КонецЦикла;
КонецФункции

&НаКлиенте
Процедура ОрганизацияНачалоВыбораИзСписка(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОрганизацияНачалоВыбораИзСписка_Сервер(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыОсновныеДействияФормыВыполнить(Команда)
	
	
	ТекущаяСтраница = Элементы.ПанельГруппаОдин.ТекущаяСтраница;
		
	Если ТекущаяСтраница = Элементы.ЗагрузкаКонтрагентов Тогда 

		Рез = ПодключениеКБазе_Вызов_Функции();
		Если Рез тогда
			ЗагрузитьКонтрагентов_Вызов_Функции();
		КонецЕсли;
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗагрузкаДоговоров Тогда
		
		ПодключениеКБазе_Вызов_Функции();
		ЗагрузитьДоговора_Вызов_Функции();
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗагрузкаНоменклатуры Тогда
		
		ПодключениеКБазе_Вызов_Функции();
		ЗагрузитьНоменклатуру_Вызов_Функции();
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗагрузкаРБП Тогда
		
		ПодключениеКБазе_Вызов_Функции();
		ЗагрузитьРБП_Вызов_Функции();
		
	// ++ BIT AMerkulov 24072014 /Загрузка ОС		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗагрузкаОС Тогда
		
		ПодключениеКБазе_Вызов_Функции();
		ЗагрузитьОС_Вызов_Функции();		
	// -- BIT AMerkulov 24072014 /Загрузка ОС

	ИначеЕсли ТекущаяСтраница = Элементы.ПакетнаяЗагрузка Тогда
		
		ПакетнаяЗагрузка_Вызов_Функции();
				
	ИначеЕсли ТекущаяСтраница = Элементы.Группа Тогда 

		ЗагрузитьГруппу_Вызов_Функции(RecNo);
		
	ИначеЕсли ТекущаяСтраница = Элементы.Один Тогда 
		// загрузка не свернутых оборотов по RecNo
		
		ЗагрузитьПоRecNo_Вызов_Функции(RecNo);
		
	ИначеЕсли ТекущаяСтраница = Элементы.Ваучеры1 Тогда 
		
		ЗагрузитьПоВаучеру_Вызов_Функции(Ваучеры);
		
	ИначеЕсли ТекущаяСтраница = Элементы.Свернутые Тогда
		// загрузка свернутых оборотов
		
		ЗагрузитьСвернутые_Вызов_Функции();
		
	ИначеЕсли ТекущаяСтраница = Элементы.Сопоставление Тогда
		// сопоставление без загрузки из SQL
		
		ВыполнитьСопоставление_Вызов_Функции(АналитикаАксапты);
		
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Процедура КоманднаяПанельТипаОперацииУстановитьВсеСопоставление(Команда)
	
	Объект.ТипыОперацийСопоставление.ЗаполнитьПометки(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанельТипаОперацииСнятьВсеСопоставление(Команда)
	
	Объект.ТипыОперацийСопоставление.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанель1Заполнить(Команда)
	//++СВВ
//	Если Элементы.ТекущаяСтраница.Имя = "Свернутые" Тогда 
	Если ЭтаФорма.ТекущийЭлемент.Родитель <> Неопределено И ЭтаФорма.ТекущийЭлемент.Родитель.Родитель <> Неопределено И
			ЭтаФорма.ТекущийЭлемент.Родитель.Родитель.Имя = "Свернутые" тогда
	//--	
		Свернутые	= Истина;
	Иначе 
		Свернутые	= Ложь;
	КонецЕсли;
	ЗаполнитьРС_ОК_ЗагружаемыеТипыОперацийАксапты_Вызов_Функции(Свернутые);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанель1УстановитьВсе(Команда)
	//++СВВ
//	Если Элементы.ТекущаяСтраница.Имя = "Свернутые" Тогда 
	ТекущаяСтраница = Элементы.ПанельГруппаОдин.ТекущаяСтраница;
	Если ТекущаяСтраница.Имя = "Свернутые" тогда
	//--	
		Свернутые	= Истина;
	Иначе 
		Свернутые	= Ложь;
	КонецЕсли;
	ПроставитьВсеФлагиРС_ОК_ЗагружаемыеТипыОперацийАксапты_Вызов_Функции(Истина, Свернутые);
КонецПроцедуры

&НаКлиенте
Процедура КоманднаяПанель1СнятьВсе(Команда)
	//++СВВ
//	Если Элементы.ТекущаяСтраница.Имя = "Свернутые" Тогда 
	ТекущаяСтраница = Элементы.ПанельГруппаОдин.ТекущаяСтраница;
	Если ТекущаяСтраница.Имя = "Свернутые" тогда
	//--	
		Свернутые	= Истина;
	Иначе 
		Свернутые	= Ложь;
	КонецЕсли;
	ПроставитьВсеФлагиРС_ОК_ЗагружаемыеТипыОперацийАксапты_Вызов_Функции(Ложь, Свернутые);
КонецПроцедуры

&НаСервере
Функция ПодключениеКБазе_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	результат = _объект.ПодключениеКБазе();
	ЗначениеВРеквизитФормы(_объект, "Объект");
	Возврат результат;
КонецФункции

&НаСервере
Функция ЗагрузитьКонтрагентов_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьКонтрагентов();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьДоговора_Вызов_Функции(Проверка=Ложь)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьДоговора(Проверка);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьНоменклатуру_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьНоменклатуру();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьРБП_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьРБП();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьОС_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьОС();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ПакетнаяЗагрузка_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ПакетнаяЗагрузка();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьГруппу_Вызов_Функции(RecNo)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьГруппу(RecNo);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьПоRecNo_Вызов_Функции(RecNo)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьПоRecNo(RecNo);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьПоВаучеру_Вызов_Функции(Ваучеры)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьПоВаучеру(Ваучеры);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗагрузитьСвернутые_Вызов_Функции()
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗагрузитьСвернутые();
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ВыполнитьСопоставление_Вызов_Функции(АналитикаАксапты)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ВыполнитьСопоставление(АналитикаАксапты);
	ЗначениеВРеквизитФормы(_объект, "Объект");
КонецФункции

&НаСервере
Функция ЗаполнитьРС_ОК_ЗагружаемыеТипыОперацийАксапты_Вызов_Функции(Свернутые)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ЗаполнитьРС_ОК_ЗагружаемыеТипыОперацийАксапты(Свернутые);
	ЗначениеВРеквизитФормы(_объект, "Объект");
	Элементы.ТипыОперацийСвернутые.Обновить();
	Элементы.ТипыОперацийГруппы.Обновить();
КонецФункции

&НаСервере
Функция ПроставитьВсеФлагиРС_ОК_ЗагружаемыеТипыОперацийАксапты_Вызов_Функции(Пометка, Свернутые)
	_объект=РеквизитФормыВЗначение("Объект");
	_объект.ПроставитьВсеФлагиРС_ОК_ЗагружаемыеТипыОперацийАксапты(Пометка, Свернутые);
	ЗначениеВРеквизитФормы(_объект, "Объект");
	Элементы.ТипыОперацийСвернутые.Обновить();
	Элементы.ТипыОперацийГруппы.Обновить();
КонецФункции

НастройкаПериода = Новый СтандартныйПериод;
                              