#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс
	
// Процедура заполняет предопределенные элементы значениями по умолчанию при обновлении ИБ.
// 
Процедура ОбновитьПредопределенные() Экспорт

	СоотвествиеЭлементов = Новый Соответствие;
	СоотвествиеЭлементов.Вставить(EURIBOR , Справочники.Валюты.НайтиПоКоду("978"));
	СоотвествиеЭлементов.Вставить(LIBOR   , Справочники.Валюты.НайтиПоКоду("840"));
	СоотвествиеЭлементов.Вставить(MosPrime, Справочники.Валюты.НайтиПоКоду("643"));
	
	Для каждого ТекЭлемент Из СоотвествиеЭлементов Цикл
		
		Если НЕ ЗначениеЗаполнено(ТекЭлемент.Ключ.ВалютаСтавки) Тогда
			СправочникОбъект = ТекЭлемент.Ключ.ПолучитьОбъект();
			СправочникОбъект.ВалютаСтавки = ТекЭлемент.Значение;
			СправочникОбъект.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ОбновитьПредопределенные()

#КонецОбласти

#КонецЕсли
