
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// +СБ Кузнецова С. 2016-07-27 
	//ОК_ОбщегоНазначения.ОткрытьОтчетРискЛиквидности();
	ИмяОбработки = Неопределено;
	ОткрытьОтчетРискЛиквидности(ИмяОбработки);
	Если ИмяОбработки <> Неопределено Тогда
		ОткрытьФорму("ВнешнийОтчет."+ ИмяОбработки +".Форма");	
	КонецЕсли;
	// -СБ Кузнецова С.
КонецПроцедуры

// +СБ Кузнецова С. 2016-07-27 
&НаСервере
Процедура ОткрытьОтчетРискЛиквидности(ИмяОбработки) 
	имяотчета_="Риск ликвидности";
	попытка
		ИмяФайла = ПолучитьИмяВременногоФайла("erf");		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДополнительныеОтчетыИОбработки.Ссылка
		|ИЗ
		|	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
		|ГДЕ
		|	ДополнительныеОтчетыИОбработки.Наименование = &Наименование";
		Запрос.УстановитьПараметр("Наименование", имяотчета_);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Возврат;
		Иначе
			Выборка = Запрос.Выполнить().Выбрать();
			Выборка.Следующий();
			ОтчетСсылка = Выборка.Ссылка;
		КонецЕсли;
		ИмяОбработки = ДополнительныеОтчетыИОбработкиВызовСервера.ПодключитьВнешнююОбработку(ОтчетСсылка);					
	исключение
	конецпопытки;	
КонецПроцедуры
// -СБ Кузнецова С.