
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
	МожноРедактировать = ПравоДоступа("Редактирование", Метаданные.Справочники.Проекты);
	Элементы.СписокКонтекстноеМенюИзменитьВыделенные.Видимость = МожноРедактировать;
	// Конец СтандартныеПодсистемы.ГрупповоеИзменениеОбъектов.
    
    // бит_РаботаСExcel
    Если бит_ОбщегоНазначения.ЭтоСемействоERP() Тогда    
    	бит_ОбменДаннымиЭксельСервер.СоздатьКнопкиРаботыСExcel(ЭтотОбъект);
    КонецЕсли;
        
КонецПроцедуры // ПриСозданииНаСервере()

#КонецОбласти

#Область ОбработчикиКомандФормы

#Область СтандартныеПодсистемыОбработчикиКоманд

&НаКлиенте
Процедура ИзменитьВыделенные(Команда)
	
	ГрупповоеИзменениеОбъектовКлиент.ИзменитьВыделенные(Элементы.Список, Список);
	
КонецПроцедуры

#КонецОбласти

#Область бит_ОбработчикиКомандРаботаСExcel

&НаКлиенте
Процедура Подключаемый_ЗагрузитьЧерезТабДок(Команда)
    
    ПараметрыФормы = Новый Структура;
    ПараметрыФормы.Вставить("РежимЗагрузки"	, "Справочник");
    ПараметрыФормы.Вставить("ИмяСправочника", "Проекты");
    
    ОткрытьФорму("Обработка.бит_ЗагрузкаДанныхИзТабличногоДокумента.Форма"
                    , ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
    
КонецПроцедуры // Подключаемый_ЗагрузитьЧерезТабДок()

#КонецОбласти

#КонецОбласти
